ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"

/* USER CODE BEGIN Includes */
#include "stm32l4xx_hal_uart.h"
#include <time.h>
#include "ai_tools.h"
#include "ai_data.h"
#include "adxl345.h"
#include "com_functions.h"


#define ACCELERO_I2C hi2c3
#define SAMPLE_SIZE 120
#define INPUT_SIZE 30
#define OUTPUT_SIZE 4
#define INPUT_SIZE_FILTER 150
#define NB_EPOCHS 500
#define HIDDEN_NEURON 20
#define CIRCLE_SAMPLES 40
#define SQUARE_SAMPLES 40
#define TRIANGLE_SAMPLES 40
#define S_SAMPLES 40

#define TRAINING
#define TESTING
#define ACCELERO_
#define LOUKA_
#define FILTER_
#define FPGA_COM_
#define ACCELERO_

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c3;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
int __io_putchar(int ch)
{
   HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
  return ch;
}

int _write(int file, char *ptr, int len)
{
	int DataIdx;
	for(DataIdx = 0; DataIdx < len; DataIdx++){__io_putchar(*ptr++);}
	return len;
}

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2C3_Init(void);

/* USER CODE BEGIN PFP */



/* Private function prototypes -----------------------------------------------*/
//extern void initialise_monitor_handles(void);

void fill_matrix_input_1();
void fill_matrix_input_2();
void fill_matrix_input_3();
void fill_static_matrix_inputs();
void fill_static_matrix_outputs();
void fill_matrix_syn1();
void fill_matrix_syn2();
void fill_matrix_square();
void fill_matrix_circle();
void fill_matrix_triangle();
void fill_matrix_S();

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
//Testing matrices
MAT *l1;
MAT *l2;
MAT *syn1;
MAT *syn2;
MAT *input;
MAT *input_filter;

MAT *l1_complete;
MAT *l2_complete;
MAT *l2Error_complete;
MAT *l1Error_complete;
MAT *l1Temp_complete;
MAT *l1Transpose_complete;
MAT *syn2Temp_complete;
MAT *inputsTranspose;

//Training matrices (plus testing matrices)
//MAT *inputs;
MAT *l2Error;
MAT *l1Error;
MAT *l1Temp;
MAT *syn2Transpose;
MAT *l1Transpose;
MAT *inputTranspose;
MAT *syn2Temp;
MAT *syn1Temp;
MAT *output;
uint32_t totalTrainingTime = 0;
//MAT *outputs;

#ifdef TRAINING
float inputs[SAMPLE_SIZE][INPUT_SIZE];
float outputs[SAMPLE_SIZE][OUTPUT_SIZE];
float circle[CIRCLE_SAMPLES][INPUT_SIZE];
float square[SQUARE_SAMPLES][INPUT_SIZE];
float triangle[TRIANGLE_SAMPLES][INPUT_SIZE];
float S[S_SAMPLES][INPUT_SIZE];
#endif




void initTestingMatrix(){
	input = createMatrix_float(1,INPUT_SIZE);
	input_filter = createMatrix_float(1,INPUT_SIZE_FILTER*2);
  l1 = createMatrix_float(1,HIDDEN_NEURON);
  l2 = createMatrix_float(1,OUTPUT_SIZE);
  output = createMatrix_float(1,OUTPUT_SIZE);
}
void freeTestingMatrix(){
    free(input);
    free(l1);
    free(l2);
    free(output);
}
void initTrainingSoloMatrix(){
	//inputs = createMatrix_float(120,20);
	//outputs = createMatrix_float(120,4);
    input = createMatrix_float(1,INPUT_SIZE);
    inputTranspose = createMatrix_float(INPUT_SIZE,1);
    syn1Temp = createMatrix_float(INPUT_SIZE,HIDDEN_NEURON);
    l1 = createMatrix_float(1,HIDDEN_NEURON);
    l1Error = createMatrix_float(1,HIDDEN_NEURON);
    l1Transpose = createMatrix_float(HIDDEN_NEURON,1);
    l1Temp = createMatrix_float(1,HIDDEN_NEURON);
    syn2Transpose = createMatrix_float(OUTPUT_SIZE,HIDDEN_NEURON);
    syn2Temp = createMatrix_float(HIDDEN_NEURON,OUTPUT_SIZE);
    l2 = createMatrix_float(1,OUTPUT_SIZE);
    l2Error = createMatrix_float(1,OUTPUT_SIZE);
    output = createMatrix_float(1,OUTPUT_SIZE);
}
void freeTrainingSoloMatrix(){
    free(input);
    free(inputTranspose);
    free(syn1Temp);
    free(l1Error);
    free(l1);
    free(l1Transpose);
    free(l1Temp);
    free(syn2Transpose);
    free(syn2Temp);
    free(l2);
    free(output);
    free(l2Error);
}
void initTrainingMatrix(int nb_training_sample){
    //inputs = createMatrix_float(nb_training_sample,20);
    inputsTranspose = createMatrix_float(INPUT_SIZE,nb_training_sample);
    syn1Temp = createMatrix_float(INPUT_SIZE,HIDDEN_NEURON);
    l1_complete = createMatrix_float(nb_training_sample,HIDDEN_NEURON);
    l1Error_complete = createMatrix_float(nb_training_sample,HIDDEN_NEURON);
    l1Transpose_complete = createMatrix_float(HIDDEN_NEURON,nb_training_sample);
    l1Temp_complete = createMatrix_float(nb_training_sample,HIDDEN_NEURON);
    syn2Transpose = createMatrix_float(OUTPUT_SIZE,HIDDEN_NEURON);
    syn2Temp = createMatrix_float(HIDDEN_NEURON,OUTPUT_SIZE);
    l2_complete = createMatrix_float(nb_training_sample,OUTPUT_SIZE);
    l2Error_complete = createMatrix_float(nb_training_sample,OUTPUT_SIZE);
    //outputs = createMatrix_float(nb_training_sample,4);
}
void freeTrainingMatrix(){
    //free(inputs);
    free(inputsTranspose);
    free(syn1Temp);
    free(l1_complete);
    free(l1Error_complete);
    free(l1Transpose_complete);
    free(l1Temp_complete);
    free(syn2Transpose);
    free(syn2Temp);
    free(l2_complete);
    free(l2Error_complete);
    //free(outputs);
}

void performComputation(){
    matrixProduct_float(input,syn1,l1);
    //printMatrix_float(l1,(char*)"L1Before");
    limitMatrix(l1,l1);
    //printMatrix_float(l1, (char*)"L1After");
    sigmoid_matrix(l1,l1);
    matrixProduct_float(l1,syn2,l2);
    limitMatrix(l2,l2);
    sigmoid_matrix(l2,l2);
}

void train_solo(){
    /*if(inputs->matM != outputs->matM){
        printf("Error : Number of inputs and outputs mismatch");
        return;
    }*/
#ifdef TRAINING
    int i;
    for(i = 0; i < SAMPLE_SIZE;i++){//Iterate through data (inputs and output)
        ((VAR**)input->mat)[0] = inputs[i];

        //input->matN = inputs->matN;
        input->matN = INPUT_SIZE;
        input->matM = 1;

        ((VAR**)output->mat)[0] = outputs[i];
        //output->matN = outputs->matN;
        output->matN = OUTPUT_SIZE;
        output->matM = 1;
        //printMatrix(input,(char*)"input");
        //printMatrix(output,(char*)"output");

