ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
        matrixProduct_float(input,syn1,l1);
        limitMatrix(l1,l1);
        sigmoid_matrix(l1,l1);
        matrixProduct_float(l1,syn2,l2);
        limitMatrix(l2,l2);
        sigmoid_matrix(l2,l2);

        matrixSubstract(output,l2,l2Error);// output - l2 => l2Error
        limitMatrix(l2Error,l2Error);
        dSigmoid_matrix(l2,l2); // dSigmoid(l2) => l2
        matrixMultiply(l2Error,l2,l2Error); // l2Error * l2 => L2Error
        limitMatrix(l2Error,l2Error);
        transposeMatrix_float(syn2,syn2Transpose);
        matrixProduct_float(l2Error,syn2Transpose,l1Error);
        limitMatrix(l1Error,l1Error);
        dSigmoid_matrix(l1,l1Temp);
        matrixMultiply(l1Error,l1Temp,l1Error);
        limitMatrix(l1Error,l1Error);

        transposeMatrix_float(l1,l1Transpose);
        matrixProduct_float(l1Transpose,l2Error,syn2Temp);
        limitMatrix(syn2Temp,syn2Temp);
        matrixAdd(syn2,syn2Temp,syn2);
        limitMatrix(syn2,syn2);

        transposeMatrix_float(input,inputTranspose);
        matrixProduct_float(inputTranspose,l1Error,syn1Temp);
        matrixAdd(syn1,syn1Temp,syn1);
        limitMatrix(syn1,syn1);
    }
#endif

}

void printMatData(MAT* mat,char *name){
  int i,j;
  printf("data_of_%s(){\n",name);
    for(i = 0; i < mat->matM; i++){
        for(j = 0; j < mat->matN; j++){
                printf("((float**)%s->mat)[%d][%d]=%f;",name,i,j,((VAR**)mat->mat)[i][j]); 
        }
    } 
    printf("\n}\n");
}

void testInputCom(){
	printf("test ongoing...\n");
	init_com();
	float INPUT[30] = {0};
	//init_INPUT(INPUT);
	for(int i = 0; i < 30; i++){
		INPUT[i] = 0.5;
	}
	for(int i = 0; i < 30; i++){
			printf("Value %d : %f\n",i,INPUT[i]);
		}
	float OUTPUT[4] = {0};

	printf("initialisations effectues!\n");

	send_STM32_Input_request();

	int i,verif;
	float temp_fpga_element = 0;

	for(i = 0; i < 30;){
			send_input_element(INPUT[i]);
			send_STM32_Input_request();
			//wait_for_ack_FPGA();
			printf("Le FPGA a bien recut l'element %d\n",i);
			wait_for_req_FPGA();
			printf("Le FPGA a renvoye son element %d\n",i);
			temp_fpga_element = read_fpga_input_element();

			printf("Read from pins : %f\n",temp_fpga_element);
			verif=verif_input_element(INPUT[i], temp_fpga_element);
			if (verif==0)
			{
				send_verif_false();
				printf("l'element renvoye est different\n");

			}else{
				send_verif_OK();
				printf("element du FPGA = element du STM32\n");
				i+=1;
			}
	}
	wait_for_ack_FPGA();
	for(int j = 0 ; j<4;){
		wait_for_req_FPGA();
		temp_fpga_element = read_fpga_input_element();
		send_input_element(temp_fpga_element);
		send_ack_STM32();
		HAL_Delay(10);
		verif = FPGA_verification_result();
		if (verif==1){
			OUTPUT[j]= temp_fpga_element;
			j+=1;
		}else {
			printf("le STM32 a renvoye au FPGA un element faux \n");
		}
	}

}


float getTestingScore(){
	  int successCpt = 0;
	  int testCpt = 0;
	  //Circle
	  for(int sample = 30; sample < 40; sample++){
		  for(int i = 0; i < INPUT_SIZE; i++){
			  ((float**)input->mat)[0][i] = (float)(circle[sample][i]+250.0)/(float)500.0;
		  }
		  performComputation();
		  if(((float**)l2->mat)[0][3] > ((float**)l2->mat)[0][0] &&
				  ((float**)l2->mat)[0][3] > ((float**)l2->mat)[0][1] &&
				  ((float**)l2->mat)[0][3] > ((float**)l2->mat)[0][2]){
			  successCpt++;
		  }
		  else{
		  }
		  testCpt++;
	  }
	  //Square
	  for(int sample = 30; sample < 40; sample++){
		  for(int i = 0; i < INPUT_SIZE; i++){
			  ((float**)input->mat)[0][i] = (float)(square[sample][i]+250.0)/(float)500.0;
		  }
		  performComputation();
		  if(((float**)l2->mat)[0][2] > ((float**)l2->mat)[0][0] &&
					  ((float**)l2->mat)[0][2] > ((float**)l2->mat)[0][1] &&
					  ((float**)l2->mat)[0][2] > ((float**)l2->mat)[0][3]){
				  successCpt++;
		  }

		  testCpt++;
	  }
	  //Triangle
	  for(int sample = 30; sample < 40; sample++){
			  for(int i = 0; i < INPUT_SIZE; i++){
				  ((float**)input->mat)[0][i] = (float)(triangle[sample][i]+250.0)/(float)500.0;
			  }
			  performComputation();
			if(((float**)l2->mat)[0][1] > ((float**)l2->mat)[0][0] &&
						  ((float**)l2->mat)[0][1] > ((float**)l2->mat)[0][2] &&
						  ((float**)l2->mat)[0][1] > ((float**)l2->mat)[0][3]){
					  successCpt++;
			  }
			  testCpt++;
	  }
	  //S
	  for(int sample = 30; sample < 40; sample++){
			  for(int i = 0; i < INPUT_SIZE; i++){
				  ((float**)input->mat)[0][i] = (float)(S[sample][i]+250.0)/(float)500.0;
			  }
			  performComputation();
			if(((float**)l2->mat)[0][0] > ((float**)l2->mat)[0][1] &&
						  ((float**)l2->mat)[0][0] > ((float**)l2->mat)[0][2] &&
						  ((float**)l2->mat)[0][0] > ((float**)l2->mat)[0][3]){
				  successCpt++;
			  }

			  testCpt++;
	  }
	  return (float)successCpt/(float)testCpt;
}


/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_I2C3_Init();

  /* USER CODE BEGIN 2 */
  printf("\n\nSTM32 Neural Net implementation\n");

  GPIO_InitTypeDef GPIO_InitStruct;
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  //LED
  GPIO_InitStruct.Pin = GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  //button
  GPIO_InitStruct.Pin = GPIO_PIN_13;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

