ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
  HAL_RCC_MCOConfig(RCC_MCO, RCC_MCO1SOURCE_SYSCLK, RCC_MCODIV_16);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
	 HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);

	 printf("Init (limit:[%d,%d]); SystemCoreClock:[%ldMHz]; Sizeof VAR:[%d]; INPUT_SIZE:[%d]; HIDDEN_SIZE:[%d]; OUTPUT_SIZE:[%d]\n",MIN_VALUE,MAX_VALUE, SystemCoreClock/1000000,sizeof(VAR), INPUT_SIZE, HIDDEN_NEURON, OUTPUT_SIZE);

	 srand(time(NULL));

	 syn1 = createMatrix_float(INPUT_SIZE,HIDDEN_NEURON);
	 syn2 = createMatrix_float(HIDDEN_NEURON,OUTPUT_SIZE);

#ifdef TRAINING
	fillRandomValuesFloat(syn1,-1,1);
	fillRandomValuesFloat(syn2,-1,1);
	initTrainingSoloMatrix();

    fill_matrix_circle();
    fill_matrix_square();
    fill_matrix_triangle();
    fill_matrix_S();

    printf("Setting data in inputs matrix...\n");
    //First matrix filling
    int cpt = 0;
    for(int i = 0; i < 30; i++){//Take the 30 first samples
      for(int j = 0; j < INPUT_SIZE; j++){
        inputs[cpt][j] = (float)(circle[i][j]+250.0)/(float)500.0;//Formatting data
        inputs[cpt+1][j] = (float)(square[i][j]+250.0)/(float)500.0;//Formatting data
        inputs[cpt+2][j] = (float)(triangle[i][j]+250.0)/(float)500.0;//Formatting data
        inputs[cpt+3][j] = (float)(S[i][j]+250.0)/(float)500.0;//Formatting data

        //inputs[cpt][j] = (float)(circle[i][j])/(float)500.0;//Formatting data
        //inputs[cpt+1][j] = (float)(square[i][j])/(float)500.0;//Formatting data
      }
      outputs[cpt][0] = 0;
      outputs[cpt][1] = 0;
      outputs[cpt][2] = 0;
      outputs[cpt][3] = 1;

      outputs[cpt+1][0] = 0;
      outputs[cpt+1][1] = 0;
      outputs[cpt+1][2] = 1;
      outputs[cpt+1][3] = 0;

      outputs[cpt+2][0] = 0;
      outputs[cpt+2][1] = 1;
      outputs[cpt+2][2] = 0;
      outputs[cpt+2][3] = 0;

      outputs[cpt+3][0] = 1;
      outputs[cpt+3][1] = 0;
      outputs[cpt+3][2] = 0;
      outputs[cpt+3][3] = 0;
      cpt = cpt + 4;
    }
    printf("Matrix : set\n");
#ifdef TESTING
    initTestingMatrix();
#endif
	 uint32_t startTime = HAL_GetTick();
	 for(int epochs = 0; epochs < NB_EPOCHS; epochs++){
		  HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
		  train_solo();
		  printf("Epochs : %d; Performance : %f\n",epochs,getTestingScore());
	  }
	  uint32_t endTime = HAL_GetTick();

	  printf("StartTime : \t%ld\n",startTime);
	  printf("EndTime : \t%ld\n",endTime);
	  totalTrainingTime = endTime - startTime;
	  freeTrainingSoloMatrix();
#ifdef TESTING
	  freeTestingMatrix();
#endif
#endif

#ifdef LOUKA
#ifndef TRAINING
	  fillRandomValuesFloat(syn1,-1,1);
	  fillRandomValuesFloat(syn2,-1,1);
#endif
	  limitMatrix(syn1,syn1);
	  limitMatrix(syn2,syn2);
	 int syn1_int;
	 int syn2_int;
	 printf("Matrice 1\n");
	 printMatrix(syn1,(char*)"syn1");
	 for(int i = 0; i<=HIDDEN_NEURON; i++){
		 printf("%d : ",i);
		 for(int j=16-1; j>=0; j--){
			 if( (((float**)syn1->mat)[j][i]) < 0){
				 syn1_int = (int)(((float**)syn1->mat)[j][i]*2047) + 32768;
			 }
			 else {
				 syn1_int = (int)(((float**)syn1->mat)[j][i]*2047);
			 }

			 printf("%04X",syn1_int);
		 }
		 printf(";\n");
	}
		 for(int i = 0; i<=HIDDEN_NEURON ; i++){
		 		 printf("%d : ",i);
		 		 for(int j=30-1; j>=16; j--){
		 			 if( (((float**)syn1->mat)[j][i]) < 0){
		 				 syn1_int = (int)(((float**)syn1->mat)[j][i]*2047) + 32768;
		 			 }
		 			 else {
		 				 syn1_int = (int)(((float**)syn1->mat)[j][i]*2047);
		 			 }

		 			 printf("%04X",syn1_int);
		 		 }
		 printf(";\n");
	 }
	 printf("End\n");
	 printf("Matrice 2\n");
	 	 printMatrix(syn2,(char*)"syn2");
	 	 for(int i = 0; i<=3; i++){
	 		 printf("%d : ",i);
	 		 for(int j=16-1; j>=0; j--){
	 			 if( (((float**)syn2->mat)[j][i]) < 0){
	 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047) + 32768;
	 			 }
	 			 else {
	 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047);
	 			 }

	 			 printf("%04X",syn2_int);
	 		 }
	 		 printf(";\n");
	 	}
	 	 for(int i = 0; i<=3; i++){
	 		 		 printf("%d : ",i);
	 		 		 for(int j=32-1; j>=16; j--){
	 		 			 if( (((float**)syn2->mat)[j][i]) < 0){
	 		 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047) + 32768;
	 		 			 }
	 		 			 else {
	 		 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047);
	 		 			 }

	 		 			 printf("%04X",syn2_int);
	 		 		 }
	 		 		 printf(";\n");
	 		 	}
	 	 for(int i = 0; i<=3; i++){
	 		 		 printf("%d : ",i);
	 		 		 for(int j=48-1; j>=32; j--){
	 		 			 if( (((float**)syn2->mat)[j][i]) < 0){
	 		 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047) + 32768;
	 		 			 }
	 		 			 else {
	 		 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047);
	 		 			 }

	 		 			 printf("%04X",syn2_int);
	 		 		 }
	 		 		 printf(";\n");
	 		 	}
	 	 for(int i = 0; i<=3; i++){
	 		 		 printf("%d : ",i);
	 		 		 for(int j=50-1; j>=48; j--){
	 		 			 if( (((float**)syn2->mat)[j][i]) < 0){
	 		 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047) + 32768;
	 		 			 }
	 		 			 else {
	 		 				 syn2_int = (int)(((float**)syn2->mat)[j][i]*2047);
	 		 			 }

	 		 			 printf("%04X",syn2_int);
	 		 		 }
	 		 		 printf(";\n");
	 		 	}
	 	 printf("End\n");

#endif

#ifdef ACCELERO

	  initTestingMatrix();
	  ADXL345_Init(&ACCELERO_I2C);
	  HAL_Delay(10);
	  printf("Device ID : 0x%02x\n", getDeviceID(&ACCELERO_I2C));
	  HAL_Delay(10);
	  setDataFormatControl(&ACCELERO_I2C,0x0B);
	  HAL_Delay(10);
	  setDataRate(&ACCELERO_I2C,ADXL345_3200HZ);
	  HAL_Delay(10);
	  setPowerControl(&ACCELERO_I2C,MeasurementMode);
	  HAL_Delay(10);


#endif


#ifdef TESTING
#ifndef TRAINING
    printf("Loading data of synapses\n");
	  fill_matrix_syn1();
	  fill_matrix_syn2();
#endif
#endif

#ifdef TESTING
	  printf("Testing...\n");
	  initTestingMatrix();

	  //Testing with new data
	  for(int i = 0; i < INPUT_SIZE; i++){
		  ((float**)input->mat)[0][i] = circle[30 + 1][i];
	  }
	  uint32_t startTimeTesting = HAL_GetTick();
	  performComputation();
	  uint32_t endTimeTesting = HAL_GetTick();

	  printMatrix(l2,(char*)"1: Circle ? : ");
	  printf("DeltaTick : %ld\n",endTimeTesting-startTimeTesting);
	  int successCpt = 0;
	  int testCpt = 0;
	  //Circle
	  for(int sample = 30; sample < 40; sample++){
		  for(int i = 0; i < INPUT_SIZE; i++){
			  ((float**)input->mat)[0][i] = (float)(circle[sample][i]+250.0)/(float)500.0;
		  }
		  printf("Sample(%d)\n",sample);
		  performComputation();
		  printMatrix(input, "Input :");
		  if(((float**)l2->mat)[0][3] > ((float**)l2->mat)[0][0] &&
				  ((float**)l2->mat)[0][3] > ((float**)l2->mat)[0][1] &&
				  ((float**)l2->mat)[0][3] > ((float**)l2->mat)[0][2]){
			  printf("Success !\n");
			  successCpt++;
		  }
		  else{
			  printf("Fail !\n");
		  }
		  printMatrix(l2,(char*)"1: Circle ? : ");
		  testCpt++;
	  }
	  //Square
	  for(int sample = 30; sample < 40; sample++){
		  for(int i = 0; i < INPUT_SIZE; i++){
			  ((float**)input->mat)[0][i] = (float)(square[sample][i]+250.0)/(float)500.0;
		  }
		  printf("Sample(%d)\n",sample);
		  performComputation();
		  if(((float**)l2->mat)[0][2] > ((float**)l2->mat)[0][0] &&
					  ((float**)l2->mat)[0][2] > ((float**)l2->mat)[0][1] &&
					  ((float**)l2->mat)[0][2] > ((float**)l2->mat)[0][3]){
				  printf("Success !\n");
				  successCpt++;
		  }
		  else{
		  	  printf("Fail !\n");
		  }
		  printMatrix(l2,(char*)"2: Square ? : ");
		  testCpt++;
	  }
	  //Triangle
	  for(int sample = 30; sample < 40; sample++){
	  		  for(int i = 0; i < INPUT_SIZE; i++){
	  			  ((float**)input->mat)[0][i] = (float)(triangle[sample][i]+250.0)/(float)500.0;
	  		  }
	  		  printf("Sample(%d)\n",sample);
	  		  performComputation();
	  		if(((float**)l2->mat)[0][1] > ((float**)l2->mat)[0][0] &&
						  ((float**)l2->mat)[0][1] > ((float**)l2->mat)[0][2] &&
						  ((float**)l2->mat)[0][1] > ((float**)l2->mat)[0][3]){
					  printf("Success !\n");
					  successCpt++;
	  		  }
	  		  else{
	  		  	  printf("Fail !\n");
	  		  }
	  		  printMatrix(l2,(char*)"3: Triangle ? : ");
	  		  testCpt++;
	  }
	  //S
	  for(int sample = 30; sample < 40; sample++){
	  		  for(int i = 0; i < INPUT_SIZE; i++){
	  			  ((float**)input->mat)[0][i] = (float)(S[sample][i]+250.0)/(float)500.0;
	  		  }
	  		  printf("Sample(%d)\n",sample);
	  		  performComputation();
	  		if(((float**)l2->mat)[0][0] > ((float**)l2->mat)[0][1] &&
						  ((float**)l2->mat)[0][0] > ((float**)l2->mat)[0][2] &&
						  ((float**)l2->mat)[0][0] > ((float**)l2->mat)[0][3]){
				  printf("Success !\n");
				  successCpt++;
	  		  }
	  		  else{
	  		  	  printf("Fail !\n");
	  		  }
	  		  printMatrix(l2,(char*)"4: S ? : ");
	  		  testCpt++;
	  }
	  printf("%d/%d success\n", successCpt, testCpt);
	  freeTestingMatrix();

	  printf("Synthesis : \n");
#ifdef TESTING
#ifndef TRAINING
	  printf("\t- TESTING_ONLY\n");
#endif
#ifdef TRAINING
	  printf("\t- TRAINING_AND_TESTING\n");
#endif
#endif
#ifndef TESTING
#ifdef TRAINING
	  printf("\t- TRAINING_ONLY\n");
#endif
#endif
	  printf("\t- TRAINING_TIME : %d\n",totalTrainingTime);
	  printf("\t- NB_TRAINING_SAMPLES : %d\n", SAMPLE_SIZE);
	  printf("\t- NB_TESTING_SAMPLES : %d\n", testCpt);
	  printf("\t- INPUT_SIZE : %d\n", INPUT_SIZE);
	  printf("\t- NB_HIDDEN_NEURONS : %d\n", HIDDEN_NEURON);
	  printf("\t- NB_OUTPUT_NEURONS : %d\n", OUTPUT_SIZE);
	  printf("\t- NB_EPOCHS : %d\n", NB_EPOCHS);
	  printf("\t- SUCCESS_RATE : %f%%\n", (float)successCpt/(float)testCpt);


#endif
#ifdef TRAINING
    //printMatData(syn1,(char*)"syn1");
    //printMatData(syn2,(char*)"syn2");
#endif

	  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
#ifdef FPGA_COM
	  testInputCom();
#endif

while (1)
 {
	if (HAL_GPIO_ReadPin(GPIOC,GPIO_PIN_13) == GPIO_PIN_RESET){
#ifdef FILTER
	  HAL_Delay(100);
	  filter_acc();
#endif

