ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
((float**)syn2->mat)[0][0]=-0.860748;((float**)syn2->mat)[0][1]=-0.946414;((float**)syn2->mat)[0][2]=0.510868;((float**)syn2->mat)[0][3]=0.093052;((float**)syn2->mat)[1][0]=0.578272;((float**)syn2->mat)[1][1]=0.437867;((float**)syn2->mat)[1][2]=-0.425710;((float**)syn2->mat)[1][3]=0.235929;((float**)syn2->mat)[2][0]=-4.628509;((float**)syn2->mat)[2][1]=-4.325458;((float**)syn2->mat)[2][2]=-1.009585;((float**)syn2->mat)[2][3]=2.172581;((float**)syn2->mat)[3][0]=-1.045445;((float**)syn2->mat)[3][1]=-0.004892;((float**)syn2->mat)[3][2]=1.504184;((float**)syn2->mat)[3][3]=-0.233437;((float**)syn2->mat)[4][0]=-2.280049;((float**)syn2->mat)[4][1]=-1.165263;((float**)syn2->mat)[4][2]=4.147265;((float**)syn2->mat)[4][3]=-6.422021;((float**)syn2->mat)[5][0]=1.158191;((float**)syn2->mat)[5][1]=-3.289140;((float**)syn2->mat)[5][2]=-2.928745;((float**)syn2->mat)[5][3]=1.563332;((float**)syn2->mat)[6][0]=-3.799554;((float**)syn2->mat)[6][1]=-3.612845;((float**)syn2->mat)[6][2]=-5.051707;((float**)syn2->mat)[6][3]=5.623632;((float**)syn2->mat)[7][0]=-5.835114;((float**)syn2->mat)[7][1]=-6.388254;((float**)syn2->mat)[7][2]=-1.212695;((float**)syn2->mat)[7][3]=3.244730;((float**)syn2->mat)[8][0]=-3.260185;((float**)syn2->mat)[8][1]=0.461693;((float**)syn2->mat)[8][2]=1.798117;((float**)syn2->mat)[8][3]=-4.065910;((float**)syn2->mat)[9][0]=1.319178;((float**)syn2->mat)[9][1]=-0.730189;((float**)syn2->mat)[9][2]=-1.106432;((float**)syn2->mat)[9][3]=0.274569;((float**)syn2->mat)[10][0]=-1.534551;((float**)syn2->mat)[10][1]=3.680777;((float**)syn2->mat)[10][2]=-4.084251;((float**)syn2->mat)[10][3]=-5.985116;((float**)syn2->mat)[11][0]=4.184460;((float**)syn2->mat)[11][1]=-5.857653;((float**)syn2->mat)[11][2]=-3.294002;((float**)syn2->mat)[11][3]=-1.027014;((float**)syn2->mat)[12][0]=-0.461145;((float**)syn2->mat)[12][1]=-0.678242;((float**)syn2->mat)[12][2]=1.022365;((float**)syn2->mat)[12][3]=0.798284;((float**)syn2->mat)[13][0]=1.035317;((float**)syn2->mat)[13][1]=-0.093845;((float**)syn2->mat)[13][2]=-0.765355;((float**)syn2->mat)[13][3]=-0.602632;((float**)syn2->mat)[14][0]=0.213142;((float**)syn2->mat)[14][1]=-6.255798;((float**)syn2->mat)[14][2]=-6.255063;((float**)syn2->mat)[14][3]=3.756855;((float**)syn2->mat)[15][0]=0.088324;((float**)syn2->mat)[15][1]=0.060564;((float**)syn2->mat)[15][2]=0.489949;((float**)syn2->mat)[15][3]=-0.152535;((float**)syn2->mat)[16][0]=-0.025030;((float**)syn2->mat)[16][1]=-0.261552;((float**)syn2->mat)[16][2]=1.468414;((float**)syn2->mat)[16][3]=-1.477012;((float**)syn2->mat)[17][0]=4.213745;((float**)syn2->mat)[17][1]=-2.474695;((float**)syn2->mat)[17][2]=-1.859632;((float**)syn2->mat)[17][3]=-3.105944;((float**)syn2->mat)[18][0]=-0.931709;((float**)syn2->mat)[18][1]=0.891448;((float**)syn2->mat)[18][2]=-0.557546;((float**)syn2->mat)[18][3]=0.769618;((float**)syn2->mat)[19][0]=-0.071873;((float**)syn2->mat)[19][1]=0.460865;((float**)syn2->mat)[19][2]=-0.486254;((float**)syn2->mat)[19][3]=0.522590;((float**)syn2->mat)[20][0]=4.513178;((float**)syn2->mat)[20][1]=-2.415314;((float**)syn2->mat)[20][2]=-2.969686;((float**)syn2->mat)[20][3]=-5.186864;((float**)syn2->mat)[21][0]=-0.692704;((float**)syn2->mat)[21][1]=3.054346;((float**)syn2->mat)[21][2]=-6.758296;((float**)syn2->mat)[21][3]=-4.078369;((float**)syn2->mat)[22][0]=-3.089108;((float**)syn2->mat)[22][1]=0.035387;((float**)syn2->mat)[22][2]=-1.068687;((float**)syn2->mat)[22][3]=2.186001;((float**)syn2->mat)[23][0]=-4.137681;((float**)syn2->mat)[23][1]=-5.440299;((float**)syn2->mat)[23][2]=2.573318;((float**)syn2->mat)[23][3]=-0.432908;((float**)syn2->mat)[24][0]=3.940788;((float**)syn2->mat)[24][1]=-1.592905;((float**)syn2->mat)[24][2]=-1.644789;((float**)syn2->mat)[24][3]=-4.190807;((float**)syn2->mat)[25][0]=0.318664;((float**)syn2->mat)[25][1]=-1.258730;((float**)syn2->mat)[25][2]=0.587427;((float**)syn2->mat)[25][3]=0.785923;((float**)syn2->mat)[26][0]=-5.919216;((float**)syn2->mat)[26][1]=3.507565;((float**)syn2->mat)[26][2]=-1.892189;((float**)syn2->mat)[26][3]=-5.239147;((float**)syn2->mat)[27][0]=-0.380133;((float**)syn2->mat)[27][1]=1.446767;((float**)syn2->mat)[27][2]=-1.293356;((float**)syn2->mat)[27][3]=-2.129871;((float**)syn2->mat)[28][0]=6.050577;((float**)syn2->mat)[28][1]=-3.905009;((float**)syn2->mat)[28][2]=-3.313271;((float**)syn2->mat)[28][3]=-5.578617;((float**)syn2->mat)[29][0]=-0.007118;((float**)syn2->mat)[29][1]=0.937712;((float**)syn2->mat)[29][2]=0.217924;((float**)syn2->mat)[29][3]=-0.538679;
}

void fill_matrix_input_1(){
//(1, 20) out : 0,0,0,1
    ((float**)input->mat)[0][0] = 0.406667; ((float**)input->mat)[0][1] = 0.661333; ((float**)input->mat)[0][2] = 0.378667; ((float**)input->mat)[0][3] = 0.733333; ((float**)input->mat)[0][4] = 0.556;    ((float**)input->mat)[0][5] = 0.706667; ((float**)input->mat)[0][6] = 0.568;    ((float**)input->mat)[0][7] = 0.697333; ((float**)input->mat)[0][8] = 0.534667; ((float**)input->mat)[0][9] = 0.690667; ((float**)input->mat)[0][10] = 0.525333;    ((float**)input->mat)[0][11] = 0.676;   ((float**)input->mat)[0][12] = 0.525333;    ((float**)input->mat)[0][13] = 0.662667;    ((float**)input->mat)[0][14] = 0.409333;    ((float**)input->mat)[0][15] = 0.717333;    ((float**)input->mat)[0][16] = 0.452;   ((float**)input->mat)[0][17] = 0.698667;    ((float**)input->mat)[0][18] = 0.502667;    ((float**)input->mat)[0][19] = 0.685333;
}
void fill_matrix_input_1_1(){
//(1, 20)
  ((float**)input->mat)[0][0] = 0.445333; ((float**)input->mat)[0][1] = 0.648;  ((float**)input->mat)[0][2] = 0.424;  ((float**)input->mat)[0][3] = 0.7;  ((float**)input->mat)[0][4] = 0.513333; ((float**)input->mat)[0][5] = 0.688;  ((float**)input->mat)[0][6] = 0.552;  ((float**)input->mat)[0][7] = 0.681333; ((float**)input->mat)[0][8] = 0.544;  ((float**)input->mat)[0][9] = 0.674667; ((float**)input->mat)[0][10] = 0.516; ((float**)input->mat)[0][11] = 0.674667;  ((float**)input->mat)[0][12] = 0.517333;  ((float**)input->mat)[0][13] = 0.661333;  ((float**)input->mat)[0][14] = 0.508; ((float**)input->mat)[0][15] = 0.666667;  ((float**)input->mat)[0][16] = 0.433333;  ((float**)input->mat)[0][17] = 0.657333;  ((float**)input->mat)[0][18] = 0.437333;  ((float**)input->mat)[0][19] = 0.674667;
}
void fill_matrix_input_2(){
//(1, 20) out : 0,0,1,0
    ((float**)input->mat)[0][0] = 0.410667; ((float**)input->mat)[0][1] = 0.672;    ((float**)input->mat)[0][2] = 0.461333; ((float**)input->mat)[0][3] = 0.553333; ((float**)input->mat)[0][4] = 0.502667; ((float**)input->mat)[0][5] = 0.630667; ((float**)input->mat)[0][6] = 0.568;    ((float**)input->mat)[0][7] = 0.696;    ((float**)input->mat)[0][8] = 0.532;    ((float**)input->mat)[0][9] = 0.806667; ((float**)input->mat)[0][10] = 0.445333;    ((float**)input->mat)[0][11] = 0.769333;    ((float**)input->mat)[0][12] = 0.428;   ((float**)input->mat)[0][13] = 0.608;   ((float**)input->mat)[0][14] = 0.472;   ((float**)input->mat)[0][15] = 0.572;   ((float**)input->mat)[0][16] = 0.474667;    ((float**)input->mat)[0][17] = 0.629333;    ((float**)input->mat)[0][18] = 0.484;   ((float**)input->mat)[0][19] = 0.748;
}
void fill_matrix_input_3(){
//(1, 20)
	((float**)input->mat)[0][0] = 0.450667;	((float**)input->mat)[0][1] = 0.626667;	((float**)input->mat)[0][2] = 0.533333;	((float**)input->mat)[0][3] = 0.572;	((float**)input->mat)[0][4] = 0.558667;	((float**)input->mat)[0][5] = 0.885333;	((float**)input->mat)[0][6] = 0.429333;	((float**)input->mat)[0][7] = 0.8;	((float**)input->mat)[0][8] = 0.370667;	((float**)input->mat)[0][9] = 0.584;	((float**)input->mat)[0][10] = 0.502667;	((float**)input->mat)[0][11] = 0.544;	((float**)input->mat)[0][12] = 0.614667;	((float**)input->mat)[0][13] = 0.769333;	((float**)input->mat)[0][14] = 0.505333;	((float**)input->mat)[0][15] = 0.864;	((float**)input->mat)[0][16] = 0.425333;	((float**)input->mat)[0][17] = 0.649333;	((float**)input->mat)[0][18] = 0.444;	((float**)input->mat)[0][19] = 0.574667;
}
void fill_matrix_input_4(){
//(1, 20)
  ((float**)input->mat)[0][0] = 0.5;  ((float**)input->mat)[0][1] = 0.716;  ((float**)input->mat)[0][2] = 0.582667; ((float**)input->mat)[0][3] = 0.708;  ((float**)input->mat)[0][4] = 0.5;  ((float**)input->mat)[0][5] = 0.641333; ((float**)input->mat)[0][6] = 0.414667; ((float**)input->mat)[0][7] = 0.616;  ((float**)input->mat)[0][8] = 0.414667; ((float**)input->mat)[0][9] = 0.585333; ((float**)input->mat)[0][10] = 0.44;  ((float**)input->mat)[0][11] = 0.686667;  ((float**)input->mat)[0][12] = 0.518667;  ((float**)input->mat)[0][13] = 0.710667;  ((float**)input->mat)[0][14] = 0.541333;  ((float**)input->mat)[0][15] = 0.693333;  ((float**)input->mat)[0][16] = 0.576; ((float**)input->mat)[0][17] = 0.658667;  ((float**)input->mat)[0][18] = 0.402667;  ((float**)input->mat)[0][19] = 0.734667;
}
void fill_static_matrix_inputs(){
//(102, 20)
  #ifdef TRAINING
