ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
	inputs[0][0] = 0.433333;	inputs[0][1] = 0.596;	inputs[0][2] = 0.558667;	inputs[0][3] = 0.589333;	inputs[0][4] = 0.576;	inputs[0][5] = 0.738667;	inputs[0][6] = 0.561333;	inputs[0][7] = 0.802667;	inputs[0][8] = 0.461333;	inputs[0][9] = 0.805333;	inputs[0][10] = 0.425333;	inputs[0][11] = 0.622667;	inputs[0][12] = 0.432;	inputs[0][13] = 0.578667;	inputs[0][14] = 0.46;	inputs[0][15] = 0.573333;	inputs[0][16] = 0.461333;	inputs[0][17] = 0.661333;	inputs[0][18] = 0.493333;	inputs[0][19] = 0.821333;	inputs[1][0] = 0.392;	inputs[1][1] = 0.653333;	inputs[1][2] = 0.432;	inputs[1][3] = 0.676;	inputs[1][4] = 0.544;	inputs[1][5] = 0.702667;	inputs[1][6] = 0.564;	inputs[1][7] = 0.678667;	inputs[1][8] = 0.542667;	inputs[1][9] = 0.689333;	inputs[1][10] = 0.548;	inputs[1][11] = 0.676;	inputs[1][12] = 0.518667;	inputs[1][13] = 0.682667;	inputs[1][14] = 0.42;	inputs[1][15] = 0.66;	inputs[1][16] = 0.4;	inputs[1][17] = 0.633333;	inputs[1][18] = 0.473333;	inputs[1][19] = 0.654667;	inputs[2][0] = 0.485333;	inputs[2][1] = 0.685333;	inputs[2][2] = 0.56;	inputs[2][3] = 0.749333;	inputs[2][4] = 0.496;	inputs[2][5] = 0.702667;	inputs[2][6] = 0.434667;	inputs[2][7] = 0.566667;	inputs[2][8] = 0.396;	inputs[2][9] = 0.546667;	inputs[2][10] = 0.457333;	inputs[2][11] = 0.710667;	inputs[2][12] = 0.553333;	inputs[2][13] = 0.742667;	inputs[2][14] = 0.616;	inputs[2][15] = 0.677333;	inputs[2][16] = 0.286667;	inputs[2][17] = 0.685333;	inputs[2][18] = 0.454667;	inputs[2][19] = 0.677333;	inputs[3][0] = 0.470667;	inputs[3][1] = 0.666667;	inputs[3][2] = 0.457333;	inputs[3][3] = 0.582667;	inputs[3][4] = 0.508;	inputs[3][5] = 0.648;	inputs[3][6] = 0.585333;	inputs[3][7] = 0.705333;	inputs[3][8] = 0.525333;	inputs[3][9] = 0.834667;	inputs[3][10] = 0.406667;	inputs[3][11] = 0.712;	inputs[3][12] = 0.406667;	inputs[3][13] = 0.556;	inputs[3][14] = 0.564;	inputs[3][15] = 0.613333;	inputs[3][16] = 0.562667;	inputs[3][17] = 0.725333;	inputs[3][18] = 0.464;	inputs[3][19] = 0.789333;	inputs[4][0] = 0.46;	inputs[4][1] = 0.641333;	inputs[4][2] = 0.488;	inputs[4][3] = 0.573333;	inputs[4][4] = 0.565333;	inputs[4][5] = 0.704;	inputs[4][6] = 0.586667;	inputs[4][7] = 0.828;	inputs[4][8] = 0.402667;	inputs[4][9] = 0.769333;	inputs[4][10] = 0.376;	inputs[4][11] = 0.54;	inputs[4][12] = 0.485333;	inputs[4][13] = 0.604;	inputs[4][14] = 0.606667;	inputs[4][15] = 0.678667;	inputs[4][16] = 0.502667;	inputs[4][17] = 0.914667;	inputs[4][18] = 0.44;	inputs[4][19] = 0.734667;	inputs[5][0] = 0.558667;	inputs[5][1] = 0.736;	inputs[5][2] = 0.530667;	inputs[5][3] = 0.685333;	inputs[5][4] = 0.432;	inputs[5][5] = 0.592;	inputs[5][6] = 0.442667;	inputs[5][7] = 0.570667;	inputs[5][8] = 0.42;	inputs[5][9] = 0.694667;	inputs[5][10] = 0.504;	inputs[5][11] = 0.704;	inputs[5][12] = 0.541333;	inputs[5][13] = 0.696;	inputs[5][14] = 0.582667;	inputs[5][15] = 0.686667;	inputs[5][16] = 0.404;	inputs[5][17] = 0.708;	inputs[5][18] = 0.485333;	inputs[5][19] = 0.684;	inputs[6][0] = 0.392;	inputs[6][1] = 0.645333;	inputs[6][2] = 0.373333;	inputs[6][3] = 0.652;	inputs[6][4] = 0.533333;	inputs[6][5] = 0.704;	inputs[6][6] = 0.565333;	inputs[6][7] = 0.657333;	inputs[6][8] = 0.530667;	inputs[6][9] = 0.674667;	inputs[6][10] = 0.584;	inputs[6][11] = 0.676;	inputs[6][12] = 0.541333;	inputs[6][13] = 0.648;	inputs[6][14] = 0.410667;	inputs[6][15] = 0.681333;	inputs[6][16] = 0.488;	inputs[6][17] = 0.693333;	inputs[6][18] = 0.517333;	inputs[6][19] = 0.685333;	inputs[7][0] = 0.490667;	inputs[7][1] = 0.656;	inputs[7][2] = 0.605333;	inputs[7][3] = 0.633333;	inputs[7][4] = 0.493333;	inputs[7][5] = 0.718667;	inputs[7][6] = 0.369333;	inputs[7][7] = 0.774667;	inputs[7][8] = 0.48;	inputs[7][9] = 0.618667;	inputs[7][10] = 0.517333;	inputs[7][11] = 0.558667;	inputs[7][12] = 0.453333;	inputs[7][13] = 0.616;	inputs[7][14] = 0.478667;	inputs[7][15] = 0.676;	inputs[7][16] = 0.532;	inputs[7][17] = 0.688;	inputs[7][18] = 0.684;	inputs[7][19] = 0.677333;	inputs[8][0] = 0.457333;	inputs[8][1] = 0.62;	inputs[8][2] = 0.530667;	inputs[8][3] = 0.589333;	inputs[8][4] = 0.549333;	inputs[8][5] = 0.725333;	inputs[8][6] = 0.481333;	inputs[8][7] = 0.821333;	inputs[8][8] = 0.414667;	inputs[8][9] = 0.685333;	inputs[8][10] = 0.428;	inputs[8][11] = 0.533333;	inputs[8][12] = 0.6;	inputs[8][13] = 0.626667;	inputs[8][14] = 0.529333;	inputs[8][15] = 0.808;	inputs[8][16] = 0.469333;	inputs[8][17] = 0.909333;	inputs[8][18] = 0.437333;	inputs[8][19] = 0.576;	inputs[9][0] = 0.477333;	inputs[9][1] = 0.638667;	inputs[9][2] = 0.530667;	inputs[9][3] = 0.589333;	inputs[9][4] = 0.601333;	inputs[9][5] = 0.745333;	inputs[9][6] = 0.493333;	inputs[9][7] = 0.884;	inputs[9][8] = 0.386667;	inputs[9][9] = 0.633333;	inputs[9][10] = 0.477333;	inputs[9][11] = 0.526667;	inputs[9][12] = 0.625333;	inputs[9][13] = 0.616;	inputs[9][14] = 0.492;	inputs[9][15] = 0.765333;	inputs[9][16] = 0.424;	inputs[9][17] = 0.742667;	inputs[9][18] = 0.445333;	inputs[9][19] = 0.678667;	inputs[10][0] = 0.54;	inputs[10][1] = 0.718667;	inputs[10][2] = 0.556;	inputs[10][3] = 0.66;	inputs[10][4] = 0.418667;	inputs[10][5] = 0.62;	inputs[10][6] = 0.428;	inputs[10][7] = 0.604;	inputs[10][8] = 0.417333;	inputs[10][9] = 0.650667;	inputs[10][10] = 0.492;	inputs[10][11] = 0.697333;	inputs[10][12] = 0.536;	inputs[10][13] = 0.717333;	inputs[10][14] = 0.581333;	inputs[10][15] = 0.701333;	inputs[10][16] = 0.464;	inputs[10][17] = 0.722667;	inputs[10][18] = 0.437333;	inputs[10][19] = 0.690667;	inputs[11][0] = 0.517333;	inputs[11][1] = 0.701333;	inputs[11][2] = 0.578667;	inputs[11][3] = 0.693333;	inputs[11][4] = 0.428;	inputs[11][5] = 0.658667;	inputs[11][6] = 0.448;	inputs[11][7] = 0.552;	inputs[11][8] = 0.428;	inputs[11][9] = 0.614667;	inputs[11][10] = 0.498667;	inputs[11][11] = 0.712;	inputs[11][12] = 0.573333;	inputs[11][13] = 0.701333;	inputs[11][14] = 0.502667;	inputs[11][15] = 0.7;	inputs[11][16] = 0.473333;	inputs[11][17] = 0.688;	inputs[11][18] = 0.498667;	inputs[11][19] = 0.697333;	inputs[12][0] = 0.462667;	inputs[12][1] = 0.650667;	inputs[12][2] = 0.468;	inputs[12][3] = 0.552;	inputs[12][4] = 0.588;	inputs[12][5] = 0.681333;	inputs[12][6] = 0.573333;	inputs[12][7] = 0.796;	inputs[12][8] = 0.408;	inputs[12][9] = 0.746667;	inputs[12][10] = 0.376;	inputs[12][11] = 0.552;	inputs[12][12] = 0.493333;	inputs[12][13] = 0.597333;	inputs[12][14] = 0.562667;	inputs[12][15] = 0.688;	inputs[12][16] = 0.568;	inputs[12][17] = 0.761333;	inputs[12][18] = 0.489333;	inputs[12][19] = 0.846667;	inputs[13][0] = 0.382667;	inputs[13][1] = 0.648;	inputs[13][2] = 0.321333;	inputs[13][3] = 0.749333;	inputs[13][4] = 0.616;	inputs[13][5] = 0.772;	inputs[13][6] = 0.641333;	inputs[13][7] = 0.713333;	inputs[13][8] = 0.570667;	inputs[13][9] = 0.674667;	inputs[13][10] = 0.445333;	inputs[13][11] = 0.712;	inputs[13][12] = 0.329333;	inputs[13][13] = 0.746667;	inputs[13][14] = 0.449333;	inputs[13][15] = 0.697333;	inputs[13][16] = 0.477333;	inputs[13][17] = 0.685333;	inputs[13][18] = 0.494667;	inputs[13][19] = 0.690667;	inputs[14][0] = 0.521333;	inputs[14][1] = 0.698667;	inputs[14][2] = 0.589333;	inputs[14][3] = 0.741333;	inputs[14][4] = 0.490667;	inputs[14][5] = 0.672;	inputs[14][6] = 0.425333;	inputs[14][7] = 0.542667;	inputs[14][8] = 0.418667;	inputs[14][9] = 0.594667;	inputs[14][10] = 0.468;	inputs[14][11] = 0.757333;	inputs[14][12] = 0.536;	inputs[14][13] = 0.726667;	inputs[14][14] = 0.601333;	inputs[14][15] = 0.674667;	inputs[14][16] = 0.474667;	inputs[14][17] = 0.732;	inputs[14][18] = 0.477333;	inputs[14][19] = 0.697333;	inputs[15][0] = 0.569333;	inputs[15][1] = 0.789333;	inputs[15][2] = 0.465333;	inputs[15][3] = 0.726667;	inputs[15][4] = 0.538667;	inputs[15][5] = 0.562667;	inputs[15][6] = 0.445333;	inputs[15][7] = 0.592;	inputs[15][8] = 0.376;	inputs[15][9] = 0.629333;	inputs[15][10] = 0.478667;	inputs[15][11] = 0.722667;	inputs[15][12] = 0.581333;	inputs[15][13] = 0.724;	inputs[15][14] = 0.596;	inputs[15][15] = 0.684;	inputs[15][16] = 0.416;	inputs[15][17] = 0.708;	inputs[15][18] = 0.409333;	inputs[15][19] = 0.678667;	inputs[16][0] = 0.428;	inputs[16][1] = 0.674667;	inputs[16][2] = 0.474667;	inputs[16][3] = 0.684;	inputs[16][4] = 0.597333;	inputs[16][5] = 0.676;	inputs[16][6] = 0.562667;	inputs[16][7] = 0.684;	inputs[16][8] = 0.552;	inputs[16][9] = 0.665333;	inputs[16][10] = 0.606667;	inputs[16][11] = 0.696;	inputs[16][12] = 0.494667;	inputs[16][13] = 0.674667;	inputs[16][14] = 0.384;	inputs[16][15] = 0.681333;	inputs[16][16] = 0.481333;	inputs[16][17] = 0.674667;	inputs[16][18] = 0.493333;	inputs[16][19] = 0.668;	inputs[17][0] = 0.476;	inputs[17][1] = 0.672;	inputs[17][2] = 0.457333;	inputs[17][3] = 0.565333;	inputs[17][4] = 0.541333;	inputs[17][5] = 0.722667;	inputs[17][6] = 0.534667;	inputs[17][7] = 0.825333;	inputs[17][8] = 0.434667;	inputs[17][9] = 0.801333;	inputs[17][10] = 0.384;	inputs[17][11] = 0.602667;	inputs[17][12] = 0.48;	inputs[17][13] = 0.589333;	inputs[17][14] = 0.593333;	inputs[17][15] = 0.64;	inputs[17][16] = 0.546667;	inputs[17][17] = 0.8;	inputs[17][18] = 0.438667;	inputs[17][19] = 0.829333;	inputs[18][0] = 0.390667;	inputs[18][1] = 0.674667;	inputs[18][2] = 0.461333;	inputs[18][3] = 0.714667;	inputs[18][4] = 0.641333;	inputs[18][5] = 0.705333;	inputs[18][6] = 0.605333;	inputs[18][7] = 0.696;	inputs[18][8] = 0.54;	inputs[18][9] = 0.689333;	inputs[18][10] = 0.570667;	inputs[18][11] = 0.653333;	inputs[18][12] = 0.54;	inputs[18][13] = 0.693333;	inputs[18][14] = 0.413333;	inputs[18][15] = 0.694667;	inputs[18][16] = 0.478667;	inputs[18][17] = 0.665333;	inputs[18][18] = 0.485333;	inputs[18][19] = 0.664;	inputs[19][0] = 0.450667;	inputs[19][1] = 0.550667;	inputs[19][2] = 0.546667;	inputs[19][3] = 0.566667;	inputs[19][4] = 0.533333;	inputs[19][5] = 0.816;	inputs[19][6] = 0.517333;	inputs[19][7] = 0.857333;	inputs[19][8] = 0.46;	inputs[19][9] = 0.704;	inputs[19][10] = 0.424;	inputs[19][11] = 0.598667;	inputs[19][12] = 0.464;	inputs[19][13] = 0.573333;	inputs[19][14] = 0.484;	inputs[19][15] = 0.556;	inputs[19][16] = 0.534667;	inputs[19][17] = 0.596;	inputs[19][18] = 0.476;	inputs[19][19] = 0.753333;	inputs[20][0] = 0.474667;	inputs[20][1] = 0.646667;	inputs[20][2] = 0.488;	inputs[20][3] = 0.582667;	inputs[20][4] = 0.581333;	inputs[20][5] = 0.684;	inputs[20][6] = 0.526667;	inputs[20][7] = 0.753333;	inputs[20][8] = 0.445333;	inputs[20][9] = 0.733333;	inputs[20][10] = 0.36;	inputs[20][11] = 0.610667;	inputs[20][12] = 0.450667;	inputs[20][13] = 0.572;	inputs[20][14] = 0.586667;	inputs[20][15] = 0.629333;	inputs[20][16] = 0.512;	inputs[20][17] = 0.862667;	inputs[20][18] = 0.449333;	inputs[20][19] = 0.730667;	inputs[21][0] = 0.532;	inputs[21][1] = 0.682667;	inputs[21][2] = 0.456;	inputs[21][3] = 0.612;	inputs[21][4] = 0.424;	inputs[21][5] = 0.572;	inputs[21][6] = 0.418667;	inputs[21][7] = 0.625333;	inputs[21][8] = 0.477333;	inputs[21][9] = 0.732;	inputs[21][10] = 0.578667;	inputs[21][11] = 0.698667;	inputs[21][12] = 0.610667;	inputs[21][13] = 0.669333;	inputs[21][14] = 0.388;	inputs[21][15] = 0.721333;	inputs[21][16] = 0.476;	inputs[21][17] = 0.669333;	inputs[21][18] = 0.506667;	inputs[21][19] = 0.692;	inputs[22][0] = 0.448;	inputs[22][1] = 0.568;	inputs[22][2] = 0.538667;	inputs[22][3] = 0.697333;	inputs[22][4] = 0.557333;	inputs[22][5] = 0.786667;	inputs[22][6] = 0.464;	inputs[22][7] = 0.778667;	inputs[22][8] = 0.441333;	inputs[22][9] = 0.610667;	inputs[22][10] = 0.478667;	inputs[22][11] = 0.585333;	inputs[22][12] = 0.488;	inputs[22][13] = 0.569333;	inputs[22][14] = 0.501333;	inputs[22][15] = 0.677333;	inputs[22][16] = 0.485333;	inputs[22][17] = 0.722667;	inputs[22][18] = 0.501333;	inputs[22][19] = 0.670667;	inputs[23][0] = 0.554667;	inputs[23][1] = 0.724;	inputs[23][2] = 0.512;	inputs[23][3] = 0.690667;	inputs[23][4] = 0.393333;	inputs[23][5] = 0.617333;	inputs[23][6] = 0.410667;	inputs[23][7] = 0.582667;	inputs[23][8] = 0.424;	inputs[23][9] = 0.666667;	inputs[23][10] = 0.549333;	inputs[23][11] = 0.726667;	inputs[23][12] = 0.577333;	inputs[23][13] = 0.689333;	inputs[23][14] = 0.56;	inputs[23][15] = 0.678667;	inputs[23][16] = 0.416;	inputs[23][17] = 0.690667;	inputs[23][18] = 0.489333;	inputs[23][19] = 0.68;	inputs[24][0] = 0.478667;	inputs[24][1] = 0.641333;	inputs[24][2] = 0.497333;	inputs[24][3] = 0.597333;	inputs[24][4] = 0.570667;	inputs[24][5] = 0.690667;	inputs[24][6] = 0.481333;	inputs[24][7] = 0.804;	inputs[24][8] = 0.410667;	inputs[24][9] = 0.728;	inputs[24][10] = 0.4;	inputs[24][11] = 0.554667;	inputs[24][12] = 0.498667;	inputs[24][13] = 0.581333;	inputs[24][14] = 0.586667;	inputs[24][15] = 0.682667;	inputs[24][16] = 0.504;	inputs[24][17] = 0.802667;	inputs[24][18] = 0.432;	inputs[24][19] = 0.802667;	inputs[25][0] = 0.46;	inputs[25][1] = 0.629333;	inputs[25][2] = 0.529333;	inputs[25][3] = 0.598667;	inputs[25][4] = 0.590667;	inputs[25][5] = 0.732;	inputs[25][6] = 0.493333;	inputs[25][7] = 0.838667;	inputs[25][8] = 0.394667;	inputs[25][9] = 0.634667;	inputs[25][10] = 0.436;	inputs[25][11] = 0.572;	inputs[25][12] = 0.534667;	inputs[25][13] = 0.650667;	inputs[25][14] = 0.562667;	inputs[25][15] = 0.72;	inputs[25][16] = 0.508;	inputs[25][17] = 0.786667;	inputs[25][18] = 0.445333;	inputs[25][19] = 0.762667;	inputs[26][0] = 0.397333;	inputs[26][1] = 0.617333;	inputs[26][2] = 0.445333;	inputs[26][3] = 0.52;	inputs[26][4] = 0.529333;	inputs[26][5] = 0.710667;	inputs[26][6] = 0.581333;	inputs[26][7] = 0.748;	inputs[26][8] = 0.457333;	inputs[26][9] = 0.786667;	inputs[26][10] = 0.425333;	inputs[26][11] = 0.692;	inputs[26][12] = 0.473333;	inputs[26][13] = 0.589333;	inputs[26][14] = 0.472;	inputs[26][15] = 0.546667;	inputs[26][16] = 0.577333;	inputs[26][17] = 0.765333;	inputs[26][18] = 0.492;	inputs[26][19] = 0.76;	inputs[27][0] = 0.476;	inputs[27][1] = 0.702667;	inputs[27][2] = 0.409333;	inputs[27][3] = 0.574667;	inputs[27][4] = 0.518667;	inputs[27][5] = 0.554667;	inputs[27][6] = 0.606667;	inputs[27][7] = 0.677333;	inputs[27][8] = 0.58;	inputs[27][9] = 0.748;	inputs[27][10] = 0.498667;	inputs[27][11] = 0.781333;	inputs[27][12] = 0.436;	inputs[27][13] = 0.722667;	inputs[27][14] = 0.438667;	inputs[27][15] = 0.577333;	inputs[27][16] = 0.445333;	inputs[27][17] = 0.589333;	inputs[27][18] = 0.462667;	inputs[27][19] = 0.566667;	inputs[28][0] = 0.506667;	inputs[28][1] = 0.704;	inputs[28][2] = 0.557333;	inputs[28][3] = 0.745333;	inputs[28][4] = 0.474667;	inputs[28][5] = 0.669333;	inputs[28][6] = 0.454667;	inputs[28][7] = 0.628;	inputs[28][8] = 0.393333;	inputs[28][9] = 0.581333;	inputs[28][10] = 0.441333;	inputs[28][11] = 0.681333;	inputs[28][12] = 0.542667;	inputs[28][13] = 0.726667;	inputs[28][14] = 0.690667;	inputs[28][15] = 0.688;	inputs[28][16] = 0.322667;	inputs[28][17] = 0.776;	inputs[28][18] = 0.444;	inputs[28][19] = 0.714667;	inputs[29][0] = 0.429333;	inputs[29][1] = 0.666667;	inputs[29][2] = 0.462667;	inputs[29][3] = 0.549333;	inputs[29][4] = 0.530667;	inputs[29][5] = 0.572;	inputs[29][6] = 0.572;	inputs[29][7] = 0.76;	inputs[29][8] = 0.518667;	inputs[29][9] = 0.802667;	inputs[29][10] = 0.473333;	inputs[29][11] = 0.724;	inputs[29][12] = 0.412;	inputs[29][13] = 0.570667;	inputs[29][14] = 0.454667;	inputs[29][15] = 0.582667;	inputs[29][16] = 0.430667;	inputs[29][17] = 0.561333;	inputs[29][18] = 0.481333;	inputs[29][19] = 0.769333;	inputs[30][0] = 0.550667;	inputs[30][1] = 0.717333;	inputs[30][2] = 0.512;	inputs[30][3] = 0.696;	inputs[30][4] = 0.452;	inputs[30][5] = 0.609333;	inputs[30][6] = 0.434667;	inputs[30][7] = 0.588;	inputs[30][8] = 0.42;	inputs[30][9] = 0.7;	inputs[30][10] = 0.532;	inputs[30][11] = 0.72;	inputs[30][12] = 0.593333;	inputs[30][13] = 0.701333;	inputs[30][14] = 0.422667;	inputs[30][15] = 0.730667;	inputs[30][16] = 0.46;	inputs[30][17] = 0.7;	inputs[30][18] = 0.506667;	inputs[30][19] = 0.7;	inputs[31][0] = 0.553333;	inputs[31][1] = 0.725333;	inputs[31][2] = 0.513333;	inputs[31][3] = 0.721333;	inputs[31][4] = 0.445333;	inputs[31][5] = 0.594667;	inputs[31][6] = 0.432;	inputs[31][7] = 0.529333;	inputs[31][8] = 0.442667;	inputs[31][9] = 0.674667;	inputs[31][10] = 0.525333;	inputs[31][11] = 0.733333;	inputs[31][12] = 0.562667;	inputs[31][13] = 0.704;	inputs[31][14] = 0.468;	inputs[31][15] = 0.676;	inputs[31][16] = 0.458667;	inputs[31][17] = 0.674667;	inputs[31][18] = 0.502667;	inputs[31][19] = 0.692;	inputs[32][0] = 0.437333;	inputs[32][1] = 0.753333;	inputs[32][2] = 0.409333;	inputs[32][3] = 0.518667;	inputs[32][4] = 0.473333;	inputs[32][5] = 0.586667;	inputs[32][6] = 0.584;	inputs[32][7] = 0.741333;	inputs[32][8] = 0.514667;	inputs[32][9] = 0.886667;	inputs[32][10] = 0.412;	inputs[32][11] = 0.784;	inputs[32][12] = 0.444;	inputs[32][13] = 0.618667;	inputs[32][14] = 0.492;	inputs[32][15] = 0.557333;	inputs[32][16] = 0.425333;	inputs[32][17] = 0.565333;	inputs[32][18] = 0.518667;	inputs[32][19] = 0.621333;	inputs[33][0] = 0.446667;	inputs[33][1] = 0.653333;	inputs[33][2] = 0.448;	inputs[33][3] = 0.706667;	inputs[33][4] = 0.544;	inputs[33][5] = 0.717333;	inputs[33][6] = 0.534667;	inputs[33][7] = 0.698667;	inputs[33][8] = 0.537333;	inputs[33][9] = 0.644;	inputs[33][10] = 0.598667;	inputs[33][11] = 0.677333;	inputs[33][12] = 0.628;	inputs[33][13] = 0.684;	inputs[33][14] = 0.3;	inputs[33][15] = 0.764;	inputs[33][16] = 0.46;	inputs[33][17] = 0.704;	inputs[33][18] = 0.485333;	inputs[33][19] = 0.676;	inputs[34][0] = 0.412;	inputs[34][1] = 0.662667;	inputs[34][2] = 0.488;	inputs[34][3] = 0.556;	inputs[34][4] = 0.54;	inputs[34][5] = 0.606667;	inputs[34][6] = 0.58;	inputs[34][7] = 0.722667;	inputs[34][8] = 0.533333;	inputs[34][9] = 0.825333;	inputs[34][10] = 0.449333;	inputs[34][11] = 0.758667;	inputs[34][12] = 0.393333;	inputs[34][13] = 0.642667;	inputs[34][14] = 0.458667;	inputs[34][15] = 0.588;	inputs[34][16] = 0.477333;	inputs[34][17] = 0.594667;	inputs[34][18] = 0.5;	inputs[34][19] = 0.621333;	inputs[35][0] = 0.432;	inputs[35][1] = 0.608;	inputs[35][2] = 0.333333;	inputs[35][3] = 0.692;	inputs[35][4] = 0.458667;	inputs[35][5] = 0.713333;	inputs[35][6] = 0.626667;	inputs[35][7] = 0.662667;	inputs[35][8] = 0.565333;	inputs[35][9] = 0.718667;	inputs[35][10] = 0.554667;	inputs[35][11] = 0.688;	inputs[35][12] = 0.616;	inputs[35][13] = 0.662667;	inputs[35][14] = 0.589333;	inputs[35][15] = 0.658667;	inputs[35][16] = 0.381333;	inputs[35][17] = 0.702667;	inputs[35][18] = 0.461333;	inputs[35][19] = 0.684;	inputs[36][0] = 0.477333;	inputs[36][1] = 0.632;	inputs[36][2] = 0.481333;	inputs[36][3] = 0.594667;	inputs[36][4] = 0.581333;	inputs[36][5] = 0.717333;	inputs[36][6] = 0.506667;	inputs[36][7] = 0.828;	inputs[36][8] = 0.396;	inputs[36][9] = 0.706667;	inputs[36][10] = 0.416;	inputs[36][11] = 0.537333;	inputs[36][12] = 0.562667;	inputs[36][13] = 0.637333;	inputs[36][14] = 0.598667;	inputs[36][15] = 0.705333;	inputs[36][16] = 0.458667;	inputs[36][17] = 0.838667;	inputs[36][18] = 0.433333;	inputs[36][19] = 0.724;	inputs[37][0] = 0.477333;	inputs[37][1] = 0.649333;	inputs[37][2] = 0.522667;	inputs[37][3] = 0.589333;	inputs[37][4] = 0.530667;	inputs[37][5] = 0.742667;	inputs[37][6] = 0.504;	inputs[37][7] = 0.848;	inputs[37][8] = 0.424;	inputs[37][9] = 0.685333;	inputs[37][10] = 0.430667;	inputs[37][11] = 0.554667;	inputs[37][12] = 0.570667;	inputs[37][13] = 0.628;	inputs[37][14] = 0.56;	inputs[37][15] = 0.732;	inputs[37][16] = 0.488;	inputs[37][17] = 0.845333;	inputs[37][18] = 0.452;	inputs[37][19] = 0.758667;	inputs[38][0] = 0.397333;	inputs[38][1] = 0.538667;	inputs[38][2] = 0.561333;	inputs[38][3] = 0.664;	inputs[38][4] = 0.598667;	inputs[38][5] = 0.817333;	inputs[38][6] = 0.474667;	inputs[38][7] = 0.822667;	inputs[38][8] = 0.401333;	inputs[38][9] = 0.608;	inputs[38][10] = 0.438667;	inputs[38][11] = 0.554667;	inputs[38][12] = 0.469333;	inputs[38][13] = 0.609333;	inputs[38][14] = 0.522667;	inputs[38][15] = 0.677333;	inputs[38][16] = 0.501333;	inputs[38][17] = 0.745333;	inputs[38][18] = 0.504;	inputs[38][19] = 0.690667;	inputs[39][0] = 0.476;	inputs[39][1] = 0.632;	inputs[39][2] = 0.497333;	inputs[39][3] = 0.562667;	inputs[39][4] = 0.545333;	inputs[39][5] = 0.808;	inputs[39][6] = 0.508;	inputs[39][7] = 0.808;	inputs[39][8] = 0.418667;	inputs[39][9] = 0.64;	inputs[39][10] = 0.44;	inputs[39][11] = 0.530667;	inputs[39][12] = 0.558667;	inputs[39][13] = 0.624;	inputs[39][14] = 0.552;	inputs[39][15] = 0.784;	inputs[39][16] = 0.498667;	inputs[39][17] = 0.814667;	inputs[39][18] = 0.453333;	inputs[39][19] = 0.641333;	inputs[40][0] = 0.554667;	inputs[40][1] = 0.628;	inputs[40][2] = 0.624;	inputs[40][3] = 0.698667;	inputs[40][4] = 0.556;	inputs[40][5] = 0.772;	inputs[40][6] = 0.478667;	inputs[40][7] = 0.822667;	inputs[40][8] = 0.409333;	inputs[40][9] = 0.669333;	inputs[40][10] = 0.448;	inputs[40][11] = 0.586667;	inputs[40][12] = 0.493333;	inputs[40][13] = 0.593333;	inputs[40][14] = 0.433333;	inputs[40][15] = 0.465333;	inputs[40][16] = 0.449333;	inputs[40][17] = 0.853333;	inputs[40][18] = 0.492;	inputs[40][19] = 0.718667;	inputs[41][0] = 0.392;	inputs[41][1] = 0.632;	inputs[41][2] = 0.394667;	inputs[41][3] = 0.694667;	inputs[41][4] = 0.490667;	inputs[41][5] = 0.725333;	inputs[41][6] = 0.616;	inputs[41][7] = 0.726667;	inputs[41][8] = 0.602667;	inputs[41][9] = 0.694667;	inputs[41][10] = 0.573333;	inputs[41][11] = 0.669333;	inputs[41][12] = 0.582667;	inputs[41][13] = 0.662667;	inputs[41][14] = 0.417333;	inputs[41][15] = 0.657333;	inputs[41][16] = 0.421333;	inputs[41][17] = 0.645333;	inputs[41][18] = 0.485333;	inputs[41][19] = 0.664;	inputs[42][0] = 0.4;	inputs[42][1] = 0.705333;	inputs[42][2] = 0.630667;	inputs[42][3] = 0.722667;	inputs[42][4] = 0.669333;	inputs[42][5] = 0.697333;	inputs[42][6] = 0.576;	inputs[42][7] = 0.68;	inputs[42][8] = 0.569333;	inputs[42][9] = 0.642667;	inputs[42][10] = 0.658667;	inputs[42][11] = 0.662667;	inputs[42][12] = 0.317333;	inputs[42][13] = 0.688;	inputs[42][14] = 0.445333;	inputs[42][15] = 0.656;	inputs[42][16] = 0.484;	inputs[42][17] = 0.668;	inputs[42][18] = 0.490667;	inputs[42][19] = 0.674667;	inputs[43][0] = 0.466667;	inputs[43][1] = 0.652;	inputs[43][2] = 0.504;	inputs[43][3] = 0.568;	inputs[43][4] = 0.58;	inputs[43][5] = 0.632;	inputs[43][6] = 0.512;	inputs[43][7] = 0.838667;	inputs[43][8] = 0.416;	inputs[43][9] = 0.736;	inputs[43][10] = 0.388;	inputs[43][11] = 0.592;	inputs[43][12] = 0.545333;	inputs[43][13] = 0.609333;	inputs[43][14] = 0.625333;	inputs[43][15] = 0.754667;	inputs[43][16] = 0.52;	inputs[43][17] = 0.829333;	inputs[43][18] = 0.44;	inputs[43][19] = 0.7;	inputs[44][0] = 0.470667;	inputs[44][1] = 0.657333;	inputs[44][2] = 0.478667;	inputs[44][3] = 0.605333;	inputs[44][4] = 0.501333;	inputs[44][5] = 0.592;	inputs[44][6] = 0.570667;	inputs[44][7] = 0.754667;	inputs[44][8] = 0.472;	inputs[44][9] = 0.849333;	inputs[44][10] = 0.368;	inputs[44][11] = 0.658667;	inputs[44][12] = 0.437333;	inputs[44][13] = 0.493333;	inputs[44][14] = 0.596;	inputs[44][15] = 0.692;	inputs[44][16] = 0.530667;	inputs[44][17] = 0.772;	inputs[44][18] = 0.352;	inputs[44][19] = 0.88;	inputs[45][0] = 0.474667;	inputs[45][1] = 0.664;	inputs[45][2] = 0.517333;	inputs[45][3] = 0.597333;	inputs[45][4] = 0.524;	inputs[45][5] = 0.701333;	inputs[45][6] = 0.56;	inputs[45][7] = 0.717333;	inputs[45][8] = 0.496;	inputs[45][9] = 0.869333;	inputs[45][10] = 0.358667;	inputs[45][11] = 0.662667;	inputs[45][12] = 0.438667;	inputs[45][13] = 0.578667;	inputs[45][14] = 0.562667;	inputs[45][15] = 0.604;	inputs[45][16] = 0.556;	inputs[45][17] = 0.741333;	inputs[45][18] = 0.497333;	inputs[45][19] = 0.853333;	inputs[46][0] = 0.445333;	inputs[46][1] = 0.629333;	inputs[46][2] = 0.48;	inputs[46][3] = 0.616;	inputs[46][4] = 0.577333;	inputs[46][5] = 0.625333;	inputs[46][6] = 0.517333;	inputs[46][7] = 0.838667;	inputs[46][8] = 0.428;	inputs[46][9] = 0.76;	inputs[46][10] = 0.366667;	inputs[46][11] = 0.568;	inputs[46][12] = 0.474667;	inputs[46][13] = 0.553333;	inputs[46][14] = 0.586667;	inputs[46][15] = 0.741333;	inputs[46][16] = 0.504;	inputs[46][17] = 0.845333;	inputs[46][18] = 0.438667;	inputs[46][19] = 0.636;	inputs[47][0] = 0.496;	inputs[47][1] = 0.717333;	inputs[47][2] = 0.36;	inputs[47][3] = 0.666667;	inputs[47][4] = 0.476;	inputs[47][5] = 0.533333;	inputs[47][6] = 0.54;	inputs[47][7] = 0.638667;	inputs[47][8] = 0.604;	inputs[47][9] = 0.762667;	inputs[47][10] = 0.494667;	inputs[47][