ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
11] = 0.849333;	inputs[47][12] = 0.450667;	inputs[47][13] = 0.72;	inputs[47][14] = 0.453333;	inputs[47][15] = 0.558667;	inputs[47][16] = 0.481333;	inputs[47][17] = 0.582667;	inputs[47][18] = 0.470667;	inputs[47][19] = 0.589333;	inputs[48][0] = 0.445333;	inputs[48][1] = 0.648;	inputs[48][2] = 0.424;	inputs[48][3] = 0.7;	inputs[48][4] = 0.513333;	inputs[48][5] = 0.688;	inputs[48][6] = 0.552;	inputs[48][7] = 0.681333;	inputs[48][8] = 0.544;	inputs[48][9] = 0.674667;	inputs[48][10] = 0.516;	inputs[48][11] = 0.674667;	inputs[48][12] = 0.517333;	inputs[48][13] = 0.661333;	inputs[48][14] = 0.508;	inputs[48][15] = 0.666667;	inputs[48][16] = 0.433333;	inputs[48][17] = 0.657333;	inputs[48][18] = 0.437333;	inputs[48][19] = 0.674667;	inputs[49][0] = 0.454667;	inputs[49][1] = 0.554667;	inputs[49][2] = 0.526667;	inputs[49][3] = 0.632;	inputs[49][4] = 0.577333;	inputs[49][5] = 0.754667;	inputs[49][6] = 0.488;	inputs[49][7] = 0.82;	inputs[49][8] = 0.444;	inputs[49][9] = 0.792;	inputs[49][10] = 0.46;	inputs[49][11] = 0.654667;	inputs[49][12] = 0.496;	inputs[49][13] = 0.597333;	inputs[49][14] = 0.48;	inputs[49][15] = 0.586667;	inputs[49][16] = 0.472;	inputs[49][17] = 0.605333;	inputs[49][18] = 0.524;	inputs[49][19] = 0.764;	inputs[50][0] = 0.54;	inputs[50][1] = 0.716;	inputs[50][2] = 0.549333;	inputs[50][3] = 0.746667;	inputs[50][4] = 0.485333;	inputs[50][5] = 0.6;	inputs[50][6] = 0.416;	inputs[50][7] = 0.561333;	inputs[50][8] = 0.422667;	inputs[50][9] = 0.624;	inputs[50][10] = 0.513333;	inputs[50][11] = 0.733333;	inputs[50][12] = 0.598667;	inputs[50][13] = 0.714667;	inputs[50][14] = 0.476;	inputs[50][15] = 0.682667;	inputs[50][16] = 0.44;	inputs[50][17] = 0.710667;	inputs[50][18] = 0.488;	inputs[50][19] = 0.710667;	inputs[51][0] = 0.490667;	inputs[51][1] = 0.638667;	inputs[51][2] = 0.542667;	inputs[51][3] = 0.721333;	inputs[51][4] = 0.513333;	inputs[51][5] = 0.697333;	inputs[51][6] = 0.481333;	inputs[51][7] = 0.645333;	inputs[51][8] = 0.421333;	inputs[51][9] = 0.608;	inputs[51][10] = 0.444;	inputs[51][11] = 0.578667;	inputs[51][12] = 0.429333;	inputs[51][13] = 0.712;	inputs[51][14] = 0.556;	inputs[51][15] = 0.728;	inputs[51][16] = 0.617333;	inputs[51][17] = 0.682667;	inputs[51][18] = 0.426667;	inputs[51][19] = 0.690667;	inputs[52][0] = 0.478667;	inputs[52][1] = 0.642667;	inputs[52][2] = 0.484;	inputs[52][3] = 0.632;	inputs[52][4] = 0.490667;	inputs[52][5] = 0.612;	inputs[52][6] = 0.544;	inputs[52][7] = 0.604;	inputs[52][8] = 0.537333;	inputs[52][9] = 0.781333;	inputs[52][10] = 0.382667;	inputs[52][11] = 0.801333;	inputs[52][12] = 0.401333;	inputs[52][13] = 0.590667;	inputs[52][14] = 0.5;	inputs[52][15] = 0.569333;	inputs[52][16] = 0.622667;	inputs[52][17] = 0.681333;	inputs[52][18] = 0.521333;	inputs[52][19] = 0.848;	inputs[53][0] = 0.457333;	inputs[53][1] = 0.601333;	inputs[53][2] = 0.569333;	inputs[53][3] = 0.564;	inputs[53][4] = 0.576;	inputs[53][5] = 0.757333;	inputs[53][6] = 0.473333;	inputs[53][7] = 0.890667;	inputs[53][8] = 0.370667;	inputs[53][9] = 0.604;	inputs[53][10] = 0.445333;	inputs[53][11] = 0.525333;	inputs[53][12] = 0.493333;	inputs[53][13] = 0.604;	inputs[53][14] = 0.590667;	inputs[53][15] = 0.817333;	inputs[53][16] = 0.428;	inputs[53][17] = 0.8;	inputs[53][18] = 0.434667;	inputs[53][19] = 0.617333;	inputs[54][0] = 0.5;	inputs[54][1] = 0.685333;	inputs[54][2] = 0.576;	inputs[54][3] = 0.765333;	inputs[54][4] = 0.497333;	inputs[54][5] = 0.709333;	inputs[54][6] = 0.445333;	inputs[54][7] = 0.546667;	inputs[54][8] = 0.412;	inputs[54][9] = 0.524;	inputs[54][10] = 0.404;	inputs[54][11] = 0.752;	inputs[54][12] = 0.530667;	inputs[54][13] = 0.758667;	inputs[54][14] = 0.632;	inputs[54][15] = 0.684;	inputs[54][16] = 0.413333;	inputs[54][17] = 0.724;	inputs[54][18] = 0.434667;	inputs[54][19] = 0.688;	inputs[55][0] = 0.488;	inputs[55][1] = 0.685333;	inputs[55][2] = 0.54;	inputs[55][3] = 0.741333;	inputs[55][4] = 0.514667;	inputs[55][5] = 0.74;	inputs[55][6] = 0.502667;	inputs[55][7] = 0.568;	inputs[55][8] = 0.444;	inputs[55][9] = 0.542667;	inputs[55][10] = 0.378667;	inputs[55][11] = 0.625333;	inputs[55][12] = 0.492;	inputs[55][13] = 0.756;	inputs[55][14] = 0.617333;	inputs[55][15] = 0.712;	inputs[55][16] = 0.393333;	inputs[55][17] = 0.684;	inputs[55][18] = 0.408;	inputs[55][19] = 0.713333;	inputs[56][0] = 0.532;	inputs[56][1] = 0.72;	inputs[56][2] = 0.578667;	inputs[56][3] = 0.712;	inputs[56][4] = 0.44;	inputs[56][5] = 0.598667;	inputs[56][6] = 0.389333;	inputs[56][7] = 0.537333;	inputs[56][8] = 0.406667;	inputs[56][9] = 0.696;	inputs[56][10] = 0.541333;	inputs[56][11] = 0.732;	inputs[56][12] = 0.658667;	inputs[56][13] = 0.674667;	inputs[56][14] = 0.321333;	inputs[56][15] = 0.758667;	inputs[56][16] = 0.444;	inputs[56][17] = 0.701333;	inputs[56][18] = 0.390667;	inputs[56][19] = 0.725333;	inputs[57][0] = 0.548;	inputs[57][1] = 0.697333;	inputs[57][2] = 0.488;	inputs[57][3] = 0.644;	inputs[57][4] = 0.437333;	inputs[57][5] = 0.589333;	inputs[57][6] = 0.454667;	inputs[57][7] = 0.58;	inputs[57][8] = 0.46;	inputs[57][9] = 0.733333;	inputs[57][10] = 0.553333;	inputs[57][11] = 0.724;	inputs[57][12] = 0.572;	inputs[57][13] = 0.692;	inputs[57][14] = 0.432;	inputs[57][15] = 0.717333;	inputs[57][16] = 0.472;	inputs[57][17] = 0.702667;	inputs[57][18] = 0.406667;	inputs[57][19] = 0.7;	inputs[58][0] = 0.429333;	inputs[58][1] = 0.609333;	inputs[58][2] = 0.38;	inputs[58][3] = 0.682667;	inputs[58][4] = 0.537333;	inputs[58][5] = 0.7;	inputs[58][6] = 0.564;	inputs[58][7] = 0.688;	inputs[58][8] = 0.528;	inputs[58][9] = 0.68;	inputs[58][10] = 0.532;	inputs[58][11] = 0.670667;	inputs[58][12] = 0.530667;	inputs[58][13] = 0.66;	inputs[58][14] = 0.414667;	inputs[58][15] = 0.666667;	inputs[58][16] = 0.373333;	inputs[58][17] = 0.678667;	inputs[58][18] = 0.468;	inputs[58][19] = 0.698667;	inputs[59][0] = 0.493333;	inputs[59][1] = 0.690667;	inputs[59][2] = 0.604;	inputs[59][3] = 0.756;	inputs[59][4] = 0.490667;	inputs[59][5] = 0.662667;	inputs[59][6] = 0.401333;	inputs[59][7] = 0.594667;	inputs[59][8] = 0.428;	inputs[59][9] = 0.592;	inputs[59][10] = 0.445333;	inputs[59][11] = 0.738667;	inputs[59][12] = 0.522667;	inputs[59][13] = 0.717333;	inputs[59][14] = 0.588;	inputs[59][15] = 0.694667;	inputs[59][16] = 0.469333;	inputs[59][17] = 0.694667;	inputs[59][18] = 0.456;	inputs[59][19] = 0.678667;	inputs[60][0] = 0.5;	inputs[60][1] = 0.682667;	inputs[60][2] = 0.592;	inputs[60][3] = 0.738667;	inputs[60][4] = 0.514667;	inputs[60][5] = 0.645333;	inputs[60][6] = 0.386667;	inputs[60][7] = 0.618667;	inputs[60][8] = 0.412;	inputs[60][9] = 0.536;	inputs[60][10] = 0.473333;	inputs[60][11] = 0.753333;	inputs[60][12] = 0.537333;	inputs[60][13] = 0.74;	inputs[60][14] = 0.62;	inputs[60][15] = 0.652;	inputs[60][16] = 0.384;	inputs[60][17] = 0.717333;	inputs[60][18] = 0.470667;	inputs[60][19] = 0.696;	inputs[61][0] = 0.437333;	inputs[61][1] = 0.761333;	inputs[61][2] = 0.428;	inputs[61][3] = 0.512;	inputs[61][4] = 0.542667;	inputs[61][5] = 0.566667;	inputs[61][6] = 0.634667;	inputs[61][7] = 0.753333;	inputs[61][8] = 0.532;	inputs[61][9] = 0.869333;	inputs[61][10] = 0.44;	inputs[61][11] = 0.782667;	inputs[61][12] = 0.425333;	inputs[61][13] = 0.594667;	inputs[61][14] = 0.434667;	inputs[61][15] = 0.554667;	inputs[61][16] = 0.424;	inputs[61][17] = 0.613333;	inputs[61][18] = 0.48;	inputs[61][19] = 0.793333;	inputs[62][0] = 0.574667;	inputs[62][1] = 0.733333;	inputs[62][2] = 0.548;	inputs[62][3] = 0.681333;	inputs[62][4] = 0.437333;	inputs[62][5] = 0.612;	inputs[62][6] = 0.426667;	inputs[62][7] = 0.590667;	inputs[62][8] = 0.428;	inputs[62][9] = 0.674667;	inputs[62][10] = 0.508;	inputs[62][11] = 0.728;	inputs[62][12] = 0.564;	inputs[62][13] = 0.714667;	inputs[62][14] = 0.585333;	inputs[62][15] = 0.693333;	inputs[62][16] = 0.416;	inputs[62][17] = 0.717333;	inputs[62][18] = 0.485333;	inputs[62][19] = 0.689333;	inputs[63][0] = 0.434667;	inputs[63][1] = 0.658667;	inputs[63][2] = 0.372;	inputs[63][3] = 0.68;	inputs[63][4] = 0.505333;	inputs[63][5] = 0.726667;	inputs[63][6] = 0.642667;	inputs[63][7] = 0.689333;	inputs[63][8] = 0.56;	inputs[63][9] = 0.694667;	inputs[63][10] = 0.533333;	inputs[63][11] = 0.708;	inputs[63][12] = 0.557333;	inputs[63][13] = 0.674667;	inputs[63][14] = 0.502667;	inputs[63][15] = 0.641333;	inputs[63][16] = 0.413333;	inputs[63][17] = 0.701333;	inputs[63][18] = 0.452;	inputs[63][19] = 0.645333;	inputs[64][0] = 0.425333;	inputs[64][1] = 0.604;	inputs[64][2] = 0.508;	inputs[64][3] = 0.608;	inputs[64][4] = 0.577333;	inputs[64][5] = 0.68;	inputs[64][6] = 0.558667;	inputs[64][7] = 0.84;	inputs[64][8] = 0.442667;	inputs[64][9] = 0.768;	inputs[64][10] = 0.392;	inputs[64][11] = 0.588;	inputs[64][12] = 0.476;	inputs[64][13] = 0.588;	inputs[64][14] = 0.572;	inputs[64][15] = 0.661333;	inputs[64][16] = 0.561333;	inputs[64][17] = 0.833333;	inputs[64][18] = 0.465333;	inputs[64][19] = 0.862667;	inputs[65][0] = 0.405333;	inputs[65][1] = 0.64;	inputs[65][2] = 0.528;	inputs[65][3] = 0.533333;	inputs[65][4] = 0.62;	inputs[65][5] = 0.678667;	inputs[65][6] = 0.604;	inputs[65][7] = 0.845333;	inputs[65][8] = 0.493333;	inputs[65][9] = 0.888;	inputs[65][10] = 0.416;	inputs[65][11] = 0.692;	inputs[65][12] = 0.434667;	inputs[65][13] = 0.548;	inputs[65][14] = 0.497333;	inputs[65][15] = 0.533333;	inputs[65][16] = 0.486667;	inputs[65][17] = 0.824;	inputs[65][18] = 0.52;	inputs[65][19] = 0.824;	inputs[66][0] = 0.369333;	inputs[66][1] = 0.669333;	inputs[66][2] = 0.317333;	inputs[66][3] = 0.676;	inputs[66][4] = 0.477333;	inputs[66][5] = 0.718667;	inputs[66][6] = 0.549333;	inputs[66][7] = 0.730667;	inputs[66][8] = 0.574667;	inputs[66][9] = 0.690667;	inputs[66][10] = 0.566667;	inputs[66][11] = 0.677333;	inputs[66][12] = 0.552;	inputs[66][13] = 0.688;	inputs[66][14] = 0.425333;	inputs[66][15] = 0.685333;	inputs[66][16] = 0.377333;	inputs[66][17] = 0.694667;	inputs[66][18] = 0.492;	inputs[66][19] = 0.688;	inputs[67][0] = 0.454667;	inputs[67][1] = 0.656;	inputs[67][2] = 0.461333;	inputs[67][3] = 0.553333;	inputs[67][4] = 0.544;	inputs[67][5] = 0.685333;	inputs[67][6] = 0.529333;	inputs[67][7] = 0.792;	inputs[67][8] = 0.397333;	inputs[67][9] = 0.777333;	inputs[67][10] = 0.376;	inputs[67][11] = 0.512;	inputs[67][12] = 0.524;	inputs[67][13] = 0.585333;	inputs[67][14] = 0.62;	inputs[67][15] = 0.709333;	inputs[67][16] = 0.528;	inputs[67][17] = 0.812;	inputs[67][18] = 0.410667;	inputs[67][19] = 0.78;	inputs[68][0] = 0.513333;	inputs[68][1] = 0.682667;	inputs[68][2] = 0.402667;	inputs[68][3] = 0.588;	inputs[68][4] = 0.418667;	inputs[68][5] = 0.692;	inputs[68][6] = 0.468;	inputs[68][7] = 0.696;	inputs[68][8] = 0.646667;	inputs[68][9] = 0.702667;	inputs[68][10] = 0.584;	inputs[68][11] = 0.688;	inputs[68][12] = 0.521333;	inputs[68][13] = 0.650667;	inputs[68][14] = 0.509333;	inputs[68][15] = 0.648;	inputs[68][16] = 0.344;	inputs[68][17] = 0.68;	inputs[68][18] = 0.418667;	inputs[68][19] = 0.657333;	inputs[69][0] = 0.350667;	inputs[69][1] = 0.669333;	inputs[69][2] = 0.268;	inputs[69][3] = 0.657333;	inputs[69][4] = 0.513333;	inputs[69][5] = 0.701333;	inputs[69][6] = 0.614667;	inputs[69][7] = 0.716;	inputs[69][8] = 0.568;	inputs[69][9] = 0.697333;	inputs[69][10] = 0.546667;	inputs[69][11] = 0.669333;	inputs[69][12] = 0.526667;	inputs[69][13] = 0.696;	inputs[69][14] = 0.344;	inputs[69][15] = 0.684;	inputs[69][16] = 0.468;	inputs[69][17] = 0.674667;	inputs[69][18] = 0.492;	inputs[69][19] = 0.661333;	inputs[70][0] = 0.461333;	inputs[70][1] = 0.630667;	inputs[70][2] = 0.494667;	inputs[70][3] = 0.56;	inputs[70][4] = 0.530667;	inputs[70][5] = 0.714667;	inputs[70][6] = 0.509333;	inputs[70][7] = 0.786667;	inputs[70][8] = 0.425333;	inputs[70][9] = 0.774667;	inputs[70][10] = 0.392;	inputs[70][11] = 0.542667;	inputs[70][12] = 0.488;	inputs[70][13] = 0.592;	inputs[70][14] = 0.577333;	inputs[70][15] = 0.690667;	inputs[70][16] = 0.513333;	inputs[70][17] = 0.810667;	inputs[70][18] = 0.432;	inputs[70][19] = 0.792;	inputs[71][0] = 0.573333;	inputs[71][1] = 0.618667;	inputs[71][2] = 0.488;	inputs[71][3] = 0.786667;	inputs[71][4] = 0.368;	inputs[71][5] = 0.765333;	inputs[71][6] = 0.498667;	inputs[71][7] = 0.581333;	inputs[71][8] = 0.536;	inputs[71][9] = 0.502667;	inputs[71][10] = 0.406667;	inputs[71][11] = 0.652;	inputs[71][12] = 0.465333;	inputs[71][13] = 0.697333;	inputs[71][14] = 0.565333;	inputs[71][15] = 0.694667;	inputs[71][16] = 0.630667;	inputs[71][17] = 0.733333;	inputs[71][18] = 0.370667;	inputs[71][19] = 0.717333;	inputs[72][0] = 0.470667;	inputs[72][1] = 0.618667;	inputs[72][2] = 0.481333;	inputs[72][3] = 0.592;	inputs[72][4] = 0.538667;	inputs[72][5] = 0.766667;	inputs[72][6] = 0.498667;	inputs[72][7] = 0.84;	inputs[72][8] = 0.402667;	inputs[72][9] = 0.682667;	inputs[72][10] = 0.434667;	inputs[72][11] = 0.526667;	inputs[72][12] = 0.524;	inputs[72][13] = 0.618667;	inputs[72][14] = 0.598667;	inputs[72][15] = 0.777333;	inputs[72][16] = 0.484;	inputs[72][17] = 0.876;	inputs[72][18] = 0.464;	inputs[72][19] = 0.592;	inputs[73][0] = 0.46;	inputs[73][1] = 0.670667;	inputs[73][2] = 0.474667;	inputs[73][3] = 0.524;	inputs[73][4] = 0.610667;	inputs[73][5] = 0.76;	inputs[73][6] = 0.496;	inputs[73][7] = 0.853333;	inputs[73][8] = 0.369333;	inputs[73][9] = 0.610667;	inputs[73][10] = 0.442667;	inputs[73][11] = 0.537333;	inputs[73][12] = 0.62;	inputs[73][13] = 0.688;	inputs[73][14] = 0.565333;	inputs[73][15] = 0.830667;	inputs[73][16] = 0.444;	inputs[73][17] = 0.801333;	inputs[73][18] = 0.466667;	inputs[73][19] = 0.510667;	inputs[74][0] = 0.488;	inputs[74][1] = 0.628;	inputs[74][2] = 0.513333;	inputs[74][3] = 0.656;	inputs[74][4] = 0.586667;	inputs[74][5] = 0.793333;	inputs[74][6] = 0.545333;	inputs[74][7] = 0.848;	inputs[74][8] = 0.436;	inputs[74][9] = 0.750667;	inputs[74][10] = 0.453333;	inputs[74][11] = 0.569333;	inputs[74][12] = 0.461333;	inputs[74][13] = 0.554667;	inputs[74][14] = 0.466667;	inputs[74][15] = 0.565333;	inputs[74][16] = 0.478667;	inputs[74][17] = 0.828;	inputs[74][18] = 0.498667;	inputs[74][19] = 0.729333;	inputs[75][0] = 0.458667;	inputs[75][1] = 0.632;	inputs[75][2] = 0.485333;	inputs[75][3] = 0.590667;	inputs[75][4] = 0.568;	inputs[75][5] = 0.746667;	inputs[75][6] = 0.481333;	inputs[75][7] = 0.809333;	inputs[75][8] = 0.406667;	inputs[75][9] = 0.688;	inputs[75][10] = 0.421333;	inputs[75][11] = 0.561333;	inputs[75][12] = 0.505333;	inputs[75][13] = 0.552;	inputs[75][14] = 0.569333;	inputs[75][15] = 0.674667;	inputs[75][16] = 0.534667;	inputs[75][17] = 0.764;	inputs[75][18] = 0.394667;	inputs[75][19] = 0.824;	inputs[76][0] = 0.441333;	inputs[76][1] = 0.696;	inputs[76][2] = 0.414667;	inputs[76][3] = 0.536;	inputs[76][4] = 0.52;	inputs[76][5] = 0.62;	inputs[76][6] = 0.573333;	inputs[76][7] = 0.76;	inputs[76][8] = 0.517333;	inputs[76][9] = 0.830667;	inputs[76][10] = 0.445333;	inputs[76][11] = 0.724;	inputs[76][12] = 0.44;	inputs[76][13] = 0.586667;	inputs[76][14] = 0.473333;	inputs[76][15] = 0.554667;	inputs[76][16] = 0.488;	inputs[76][17] = 0.525333;	inputs[76][18] = 0.497333;	inputs[76][19] = 0.770667;	inputs[77][0] = 0.493333;	inputs[77][1] = 0.641333;	inputs[77][2] = 0.545333;	inputs[77][3] = 0.690667;	inputs[77][4] = 0.538667;	inputs[77][5] = 0.709333;	inputs[77][6] = 0.469333;	inputs[77][7] = 0.668;	inputs[77][8] = 0.445333;	inputs[77][9] = 0.541333;	inputs[77][10] = 0.457333;	inputs[77][11] = 0.585333;	inputs[77][12] = 0.449333;	inputs[77][13] = 0.766667;	inputs[77][14] = 0.557333;	inputs[77][15] = 0.706667;	inputs[77][16] = 0.604;	inputs[77][17] = 0.669333;	inputs[77][18] = 0.392;	inputs[77][19] = 0.744;	inputs[78][0] = 0.376;	inputs[78][1] = 0.476;	inputs[78][2] = 0.530667;	inputs[78][3] = 0.588;	inputs[78][4] = 0.568;	inputs[78][5] = 0.76;	inputs[78][6] = 0.494667;	inputs[78][7] = 0.832;	inputs[78][8] = 0.445333;	inputs[78][9] = 0.632;	inputs[78][10] = 0.452;	inputs[78][11] = 0.550667;	inputs[78][12] = 0.458667;	inputs[78][13] = 0.570667;	inputs[78][14] = 0.489333;	inputs[78][15] = 0.676;	inputs[78][16] = 0.497333;	inputs[78][17] = 0.762667;	inputs[78][18] = 0.493333;	inputs[78][19] = 0.686667;	inputs[79][0] = 0.445333;	inputs[79][1] = 0.692;	inputs[79][2] = 0.461333;	inputs[79][3] = 0.548;	inputs[79][4] = 0.537333;	inputs[79][5] = 0.594667;	inputs[79][6] = 0.582667;	inputs[79][7] = 0.738667;	inputs[79][8] = 0.546667;	inputs[79][9] = 0.78;	inputs[79][10] = 0.477333;	inputs[79][11] = 0.769333;	inputs[79][12] = 0.42;	inputs[79][13] = 0.616;	inputs[79][14] = 0.453333;	inputs[79][15] = 0.577333;	inputs[79][16] = 0.477333;	inputs[79][17] = 0.590667;	inputs[79][18] = 0.442667;	inputs[79][19] = 0.504;	inputs[80][0] = 0.424;	inputs[80][1] = 0.586667;	inputs[80][2] = 0.352;	inputs[80][3] = 0.721333;	inputs[80][4] = 0.48;	inputs[80][5] = 0.704;	inputs[80][6] = 0.556;	inputs[80][7] = 0.685333;	inputs[80][8] = 0.548;	inputs[80][9] = 0.666667;	inputs[80][10] = 0.521333;	inputs[80][11] = 0.657333;	inputs[80][12] = 0.536;	inputs[80][13] = 0.633333;	inputs[80][14] = 0.568;	inputs[80][15] = 0.648;	inputs[80][16] = 0.385333;	inputs[80][17] = 0.684;	inputs[80][18] = 0.457333;	inputs[80][19] = 0.688;	inputs[81][0] = 0.546667;	inputs[81][1] = 0.716;	inputs[81][2] = 0.58;	inputs[81][3] = 0.701333;	inputs[81][4] = 0.388;	inputs[81][5] = 0.661333;	inputs[81][6] = 0.402667;	inputs[81][7] = 0.577333;	inputs[81][8] = 0.406667;	inputs[81][9] = 0.650667;	inputs[81][10] = 0.482667;	inputs[81][11] = 0.72;	inputs[81][12] = 0.572;	inputs[81][13] = 0.709333;	inputs[81][14] = 0.584;	inputs[81][15] = 0.688;	inputs[81][16] = 0.42;	inputs[81][17] = 0.744;	inputs[81][18] = 0.446667;	inputs[81][19] = 0.689333;	inputs[82][0] = 0.522667;	inputs[82][1] = 0.728;	inputs[82][2] = 0.54;	inputs[82][3] = 0.694667;	inputs[82][4] = 0.466667;	inputs[82][5] = 0.616;	inputs[82][6] = 0.428;	inputs[82][7] = 0.589333;	inputs[82][8] = 0.441333;	inputs[82][9] = 0.586667;	inputs[82][10] = 0.481333;	inputs[82][11] = 0.736;	inputs[82][12] = 0.554667;	inputs[82][13] = 0.737333;	inputs[82][14] = 0.570667;	inputs[82][15] = 0.674667;	inputs[82][16] = 0.466667;	inputs[82][17] = 0.677333;	inputs[82][18] = 0.494667;	inputs[82][19] = 0.709333;	inputs[83][0] = 0.44;	inputs[83][1] = 0.734667;	inputs[83][2] = 0.454667;	inputs[83][3] = 0.529333;	inputs[83][4] = 0.598667;	inputs[83][5] = 0.661333;	inputs[83][6] = 0.602667;	inputs[83][7] = 0.725333;	inputs[83][8] = 0.550667;	inputs[83][9] = 0.826667;	inputs[83][10] = 0.454667;	inputs[83][11] = 0.757333;	inputs[83][12] = 0.418667;	inputs[83][13] = 0.597333;	inputs[83][14] = 0.457333;	inputs[83][15] = 0.566667;	inputs[83][16] = 0.488;	inputs[83][17] = 0.545333;	inputs[83][18] = 0.481333;	inputs[83][19] = 0.773333;	inputs[84][0] = 0.472;	inputs[84][1] = 0.618667;	inputs[84][2] = 0.502667;	inputs[84][3] = 0.561333;	inputs[84][4] = 0.573333;	inputs[84][5] = 0.796;	inputs[84][6] = 0.46;	inputs[84][7] = 0.868;	inputs[84][8] = 0.410667;	inputs[84][9] = 0.645333;	inputs[84][10] = 0.453333;	inputs[84][11] = 0.509333;	inputs[84][12] = 0.548;	inputs[84][13] = 0.626667;	inputs[84][14] = 0.497333;	inputs[84][15] = 0.857333;	inputs[84][16] = 0.432;	inputs[84][17] = 0.674667;	inputs[84][18] = 0.449333;	inputs[84][19] = 0.578667;	inputs[85][0] = 0.472;	inputs[85][1] = 0.598667;	inputs[85][2] = 0.554667;	inputs[85][3] = 0.612;	inputs[85][4] = 0.616;	inputs[85][5] = 0.866667;	inputs[85][6] = 0.418667;	inputs[85][7] = 0.814667;	inputs[85][8] = 0.36;	inputs[85][9] = 0.597333;	inputs[85][10] = 0.464;	inputs[85][11] = 0.54;	inputs[85][12] = 0.538667;	inputs[85][13] = 0.724;	inputs[85][14] = 0.610667;	inputs[85][15] = 0.777333;	inputs[85][16] = 0.473333;	inputs[85][17] = 0.776;	inputs[85][18] = 0.441333;	inputs[85][19] = 0.694667;	inputs[86][0] = 0.462667;	inputs[86][1] = 0.618667;	inputs[86][2] = 0.365333;	inputs[86][3] = 0.690667;	inputs[86][4] = 0.686667;	inputs[86][5] = 0.746667;	inputs[86][6] = 0.593333;	inputs[86][7] = 0.697333;	inputs[86][8] = 0.537333;	inputs[86][9] = 0.669333;	inputs[86][10] = 0.561333;	inputs[86][11] = 0.649333;	inputs[86][12] = 0.488;	inputs[86][13] = 0.685333;	inputs[86][14] = 0.417333;	inputs[86][15] = 0.682667;	inputs[86][16] = 0.450667;	inputs[86][17] = 0.68;	inputs[86][18] = 0.481333;	inputs[86][19] = 0.684;	inputs[87][0] = 0.534667;	inputs[87][1] = 0.769333;	inputs[87][2] = 0.546667;	inputs[87][3] = 0.725333;	inputs[87][4] = 0.453333;	inputs[87][5] = 0.573333;	inputs[87][6] = 0.389333;	inputs[87][7] = 0.541333;	inputs[87][8] = 0.424;	inputs[87][9] = 0.632;	inputs[87][10] = 0.513333;	inputs[87][11] = 0.744;	inputs[87][12] = 0.562667;	inputs[87][13] = 0.724;	inputs[87][14] = 0.586667;	inputs[87][15] = 0.654667;	inputs[87][16] = 0.44;	inputs[87][17] = 0.689333;	inputs[87][18] = 0.478667;	inputs[87][19] = 0.716;	inputs[88][0] = 0.462667;	inputs[88][1] = 0.630667;	inputs[88][2] = 0.478667;	inputs[88][3] = 0.541333;	inputs[88][4] = 0.586667;	inputs[88][5] = 0.762667;	inputs[88][6] = 0.510667;	inputs[88][7] = 0.876;	inputs[88][8] = 0.389333;	inputs[88][9] = 0.725333;	inputs[88][10] = 0.404;	inputs[88][11] = 0.526667;	inputs[88][12] = 0.578667;	inputs[88][13] = 0.594667;	inputs[88][14] = 0.624;	inputs[88][15] = 0.733333;	inputs[88][16] = 0.489333;	inputs[88][17] = 0.801333;	inputs[88][18] = 0.4;	inputs[88][19] = 0.802667;	inputs[89][0] = 0.493333;	inputs[89][1] = 0.688;	inputs[89][2] = 0.596;	inputs[89][3] = 0.754667;	inputs[89][4] = 0.526667;	inputs[89][5] = 0.674667;	inputs[89][6] = 0.422667;	inputs[89][7] = 0.598667;	inputs[89][8] = 0.416;	inputs[89][9] = 0.554667;	inputs[89][10] = 0.470667;	inputs[89][11] = 0.748;	inputs[89][12] = 0.573333;	inputs[89][13] = 0.730667;	inputs[89][14] = 0.576;	inputs[89][15] = 0.696;	inputs[89][16] = 0.413333;	inputs[89][17] = 0.68;	inputs[89][18] = 0.402667;	inputs[89][19] = 0.713333;	inputs[90][0] = 0.377333;	inputs[90][1] = 0.698667;	inputs[90][2] = 0.552;	inputs[90][3] = 0.753333;	inputs[90][4] = 0.594667;	inputs[90][5] = 0.712;	inputs[90][6] = 0.608;	inputs[90][7] = 0.704;	inputs[90][8] = 0.530667;	inputs[90][9] = 0.68;	inputs[90][10] = 0.574667;	inputs[90][11] = 0.684;	inputs[90][12] = 0.496;	inputs[90][13] = 0.752;	inputs[90][14] = 0.393333;	inputs[90][15] = 0.709333;	inputs[90][16] = 0.494667;	inputs[90][17] = 0.688;	inputs[90][18] = 0.501333;	inputs[90][19] = 0.682667;	inputs[91][0] = 0.441333;	inputs[91][1] = 0.590667;	inputs[91][2] = 0.530667;	inputs[91][3] = 0.632;	inputs[91][4] = 0.588;	inputs[91][5] = 0.717333;	inputs[91][6] = 0.538667;	inputs[91][7] = 0.816;	inputs[91][8] = 0.497333;	inputs[91][9] = 0.798667;	inputs[91][10] = 0.445333;	inputs[91][11] = 0.618667;	inputs[91][12] = 0.422667;	inputs[91][13] = 0.601333;	inputs[91][14] = 0.445333;	inputs[91][15] = 0.589333;	inputs[91][16] = 0.498667;	inputs[91][17] = 0.772;	inputs[91][18] = 0.468;	inputs[91][19] = 0.784;	inputs[92][0] = 0.442667;	inputs[92][1] = 0.638667;	inputs[92][2] = 0.384;	inputs[92][3] = 0.657333;	inputs[92][4] = 0.548;	inputs[92][5] = 0.712;	inputs[92][6] = 0.578667;	inputs[92][7] = 0.688;	inputs[92][8] = 0.578667;	inputs[92][9] = 0.665333;	inputs[92][10] = 0.550667;	inputs[92][11] = 0.682667;	inputs[92][12] = 0.582667;	inputs[92][13] = 0.650667;	inputs[92][14] = 0.5;	inputs[92][15] = 0.697333;	inputs[92][16] = 0.394667;	inputs[92][17] = 0.74;	inputs[92][18] = 0.454667;	inputs[92][19] = 0.66;	inputs[93][0] = 0.501333;	inputs[93][1] = 0.689333;	inputs[93][2] = 0.570667;	inputs[93][3] = 0.716;	inputs[93][4] = 0.498667;	inputs[93][5] = 0.674667;	inputs[93][6] = 0.424;	inputs[93][7] = 0.6;	inputs[93][8] = 0.424;	inputs[93][9] = 0.574667;	inputs[93][10] = 0.445333;	inputs[93][11] = 0.706667;	inputs[93][12] = 0.533333;	inputs[93][13] = 0.742667;	inputs[93][14] = 0.556;	inputs[93][15] = 0.684;	inputs[93][16] = 0.593333;	inputs[93][17] = 0.689333;	inputs[93][18] = 0.44;	inputs[93][19] = 0.674667;	inputs[94][0] = 0.434667;	inputs[94][1] = 0.569333;	inputs[94][2] = 0.521333;	inputs[94][3] = 0.648;	inputs[94][4] = 0.556;	inputs[94][5] = 0.690667;	inputs[94][6] = 0.508;	inputs[94][7] = 0.816;	inputs[94][8] = 0.445333;	inputs[94][9] = 0.790667;	inputs[94][10] = 0.446667;	inputs[94][11] = 0.638667;	inputs[94][12] = 0.449333;	inputs[94][13] = 0.561333;	inputs[94][14] = 0.453333;	inputs[94][15] = 0.557333;	inputs[94][16] = 0.482667;	inputs[94][17] = 0.813333;	in