ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
puts[94][18] = 0.496;	inputs[94][19] = 0.741333;	inputs[95][0] = 0.450667;	inputs[95][1] = 0.749333;	inputs[95][2] = 0.384;	inputs[95][3] = 0.526667;	inputs[95][4] = 0.522667;	inputs[95][5] = 0.590667;	inputs[95][6] = 0.566667;	inputs[95][7] = 0.724;	inputs[95][8] = 0.568;	inputs[95][9] = 0.752;	inputs[95][10] = 0.488;	inputs[95][11] = 0.830667;	inputs[95][12] = 0.410667;	inputs[95][13] = 0.716;	inputs[95][14] = 0.449333;	inputs[95][15] = 0.590667;	inputs[95][16] = 0.485333;	inputs[95][17] = 0.573333;	inputs[95][18] = 0.457333;	inputs[95][19] = 0.557333;	inputs[96][0] = 0.416;	inputs[96][1] = 0.674667;	inputs[96][2] = 0.372;	inputs[96][3] = 0.701333;	inputs[96][4] = 0.464;	inputs[96][5] = 0.682667;	inputs[96][6] = 0.58;	inputs[96][7] = 0.722667;	inputs[96][8] = 0.534667;	inputs[96][9] = 0.684;	inputs[96][10] = 0.564;	inputs[96][11] = 0.662667;	inputs[96][12] = 0.549333;	inputs[96][13] = 0.674667;	inputs[96][14] = 0.290667;	inputs[96][15] = 0.701333;	inputs[96][16] = 0.44;	inputs[96][17] = 0.678667;	inputs[96][18] = 0.513333;	inputs[96][19] = 0.676;	inputs[97][0] = 0.576;	inputs[97][1] = 0.76;	inputs[97][2] = 0.477333;	inputs[97][3] = 0.717333;	inputs[97][4] = 0.526667;	inputs[97][5] = 0.502667;	inputs[97][6] = 0.36;	inputs[97][7] = 0.573333;	inputs[97][8] = 0.397333;	inputs[97][9] = 0.741333;	inputs[97][10] = 0.577333;	inputs[97][11] = 0.706667;	inputs[97][12] = 0.629333;	inputs[97][13] = 0.685333;	inputs[97][14] = 0.408;	inputs[97][15] = 0.681333;	inputs[97][16] = 0.392;	inputs[97][17] = 0.676;	inputs[97][18] = 0.481333;	inputs[97][19] = 0.710667;	inputs[98][0] = 0.481333;	inputs[98][1] = 0.573333;	inputs[98][2] = 0.52;	inputs[98][3] = 0.66;	inputs[98][4] = 0.544;	inputs[98][5] = 0.714667;	inputs[98][6] = 0.498667;	inputs[98][7] = 0.789333;	inputs[98][8] = 0.457333;	inputs[98][9] = 0.757333;	inputs[98][10] = 0.396;	inputs[98][11] = 0.621333;	inputs[98][12] = 0.456;	inputs[98][13] = 0.564;	inputs[98][14] = 0.521333;	inputs[98][15] = 0.646667;	inputs[98][16] = 0.48;	inputs[98][17] = 0.606667;	inputs[98][18] = 0.417333;	inputs[98][19] = 0.824;	inputs[99][0] = 0.453333;	inputs[99][1] = 0.605333;	inputs[99][2] = 0.589333;	inputs[99][3] = 0.577333;	inputs[99][4] = 0.537333;	inputs[99][5] = 0.785333;	inputs[99][6] = 0.426667;	inputs[99][7] = 0.822667;	inputs[99][8] = 0.34;	inputs[99][9] = 0.533333;	inputs[99][10] = 0.508;	inputs[99][11] = 0.553333;	inputs[99][12] = 0.578667;	inputs[99][13] = 0.726667;	inputs[99][14] = 0.486667;	inputs[99][15] = 0.781333;	inputs[99][16] = 0.416;	inputs[99][17] = 0.778667;	inputs[99][18] = 0.470667;	inputs[99][19] = 0.513333;	inputs[100][0] = 0.462667;	inputs[100][1] = 0.648;	inputs[100][2] = 0.474667;	inputs[100][3] = 0.573333;	inputs[100][4] = 0.577333;	inputs[100][5] = 0.686667;	inputs[100][6] = 0.525333;	inputs[100][7] = 0.784;	inputs[100][8] = 0.416;	inputs[100][9] = 0.778667;	inputs[100][10] = 0.386667;	inputs[100][11] = 0.569333;	inputs[100][12] = 0.52;	inputs[100][13] = 0.564;	inputs[100][14] = 0.561333;	inputs[100][15] = 0.705333;	inputs[100][16] = 0.474667;	inputs[100][17] = 0.749333;	inputs[100][18] = 0.402667;	inputs[100][19] = 0.748;	inputs[101][0] = 0.378667;	inputs[101][1] = 0.633333;	inputs[101][2] = 0.353333;	inputs[101][3] = 0.733333;	inputs[101][4] = 0.449333;	inputs[101][5] = 0.718667;	inputs[101][6] = 0.562667;	inputs[101][7] = 0.710667;	inputs[101][8] = 0.585333;	inputs[101][9] = 0.665333;	inputs[101][10] = 0.562667;	inputs[101][11] = 0.670667;	inputs[101][12] = 0.529333;	inputs[101][13] = 0.646667;	inputs[101][14] = 0.24;	inputs[101][15] = 0.632;	inputs[101][16] = 0.369333;	inputs[101][17] = 0.636;	inputs[101][18] = 0.461333;	inputs[101][19] = 0.677333;
  #endif
}
void fill_static_matrix_outputs(){
//(102, 4)
	#ifdef TRAINING
  outputs[0][0] = 0;	outputs[0][1] = 0;	outputs[0][2] = 1;	outputs[0][3] = 0;	outputs[1][0] = 0;	outputs[1][1] = 0;	outputs[1][2] = 0;	outputs[1][3] = 1;	outputs[2][0] = 1;	outputs[2][1] = 0;	outputs[2][2] = 0;	outputs[2][3] = 0;	outputs[3][0] = 0;	outputs[3][1] = 1;	outputs[3][2] = 0;	outputs[3][3] = 0;	outputs[4][0] = 0;	outputs[4][1] = 1;	outputs[4][2] = 0;	outputs[4][3] = 0;	outputs[5][0] = 1;	outputs[5][1] = 0;	outputs[5][2] = 0;	outputs[5][3] = 0;	outputs[6][0] = 0;	outputs[6][1] = 0;	outputs[6][2] = 0;	outputs[6][3] = 1;	outputs[7][0] = 1;	outputs[7][1] = 0;	outputs[7][2] = 0;	outputs[7][3] = 0;	outputs[8][0] = 0;	outputs[8][1] = 1;	outputs[8][2] = 0;	outputs[8][3] = 0;	outputs[9][0] = 0;	outputs[9][1] = 1;	outputs[9][2] = 0;	outputs[9][3] = 0;	outputs[10][0] = 1;	outputs[10][1] = 0;	outputs[10][2] = 0;	outputs[10][3] = 0;	outputs[11][0] = 1;	outputs[11][1] = 0;	outputs[11][2] = 0;	outputs[11][3] = 0;	outputs[12][0] = 0;	outputs[12][1] = 1;	outputs[12][2] = 0;	outputs[12][3] = 0;	outputs[13][0] = 0;	outputs[13][1] = 0;	outputs[13][2] = 0;	outputs[13][3] = 1;	outputs[14][0] = 1;	outputs[14][1] = 0;	outputs[14][2] = 0;	outputs[14][3] = 0;	outputs[15][0] = 1;	outputs[15][1] = 0;	outputs[15][2] = 0;	outputs[15][3] = 0;	outputs[16][0] = 0;	outputs[16][1] = 0;	outputs[16][2] = 0;	outputs[16][3] = 1;	outputs[17][0] = 0;	outputs[17][1] = 1;	outputs[17][2] = 0;	outputs[17][3] = 0;	outputs[18][0] = 0;	outputs[18][1] = 0;	outputs[18][2] = 0;	outputs[18][3] = 1;	outputs[19][0] = 0;	outputs[19][1] = 0;	outputs[19][2] = 1;	outputs[19][3] = 0;	outputs[20][0] = 0;	outputs[20][1] = 1;	outputs[20][2] = 0;	outputs[20][3] = 0;	outputs[21][0] = 1;	outputs[21][1] = 0;	outputs[21][2] = 0;	outputs[21][3] = 0;	outputs[22][0] = 0;	outputs[22][1] = 0;	outputs[22][2] = 1;	outputs[22][3] = 0;	outputs[23][0] = 1;	outputs[23][1] = 0;	outputs[23][2] = 0;	outputs[23][3] = 0;	outputs[24][0] = 0;	outputs[24][1] = 1;	outputs[24][2] = 0;	outputs[24][3] = 0;	outputs[25][0] = 0;	outputs[25][1] = 1;	outputs[25][2] = 0;	outputs[25][3] = 0;	outputs[26][0] = 0;	outputs[26][1] = 0;	outputs[26][2] = 1;	outputs[26][3] = 0;	outputs[27][0] = 0;	outputs[27][1] = 0;	outputs[27][2] = 1;	outputs[27][3] = 0;	outputs[28][0] = 1;	outputs[28][1] = 0;	outputs[28][2] = 0;	outputs[28][3] = 0;	outputs[29][0] = 0;	outputs[29][1] = 0;	outputs[29][2] = 1;	outputs[29][3] = 0;	outputs[30][0] = 1;	outputs[30][1] = 0;	outputs[30][2] = 0;	outputs[30][3] = 0;	outputs[31][0] = 1;	outputs[31][1] = 0;	outputs[31][2] = 0;	outputs[31][3] = 0;	outputs[32][0] = 0;	outputs[32][1] = 0;	outputs[32][2] = 1;	outputs[32][3] = 0;	outputs[33][0] = 0;	outputs[33][1] = 0;	outputs[33][2] = 0;	outputs[33][3] = 1;	outputs[34][0] = 0;	outputs[34][1] = 0;	outputs[34][2] = 1;	outputs[34][3] = 0;	outputs[35][0] = 0;	outputs[35][1] = 0;	outputs[35][2] = 0;	outputs[35][3] = 1;	outputs[36][0] = 0;	outputs[36][1] = 1;	outputs[36][2] = 0;	outputs[36][3] = 0;	outputs[37][0] = 0;	outputs[37][1] = 1;	outputs[37][2] = 0;	outputs[37][3] = 0;	outputs[38][0] = 0;	outputs[38][1] = 0;	outputs[38][2] = 1;	outputs[38][3] = 0;	outputs[39][0] = 0;	outputs[39][1] = 1;	outputs[39][2] = 0;	outputs[39][3] = 0;	outputs[40][0] = 0;	outputs[40][1] = 0;	outputs[40][2] = 1;	outputs[40][3] = 0;	outputs[41][0] = 0;	outputs[41][1] = 0;	outputs[41][2] = 0;	outputs[41][3] = 1;	outputs[42][0] = 0;	outputs[42][1] = 0;	outputs[42][2] = 0;	outputs[42][3] = 1;	outputs[43][0] = 0;	outputs[43][1] = 1;	outputs[43][2] = 0;	outputs[43][3] = 0;	outputs[44][0] = 0;	outputs[44][1] = 1;	outputs[44][2] = 0;	outputs[44][3] = 0;	outputs[45][0] = 0;	outputs[45][1] = 1;	outputs[45][2] = 0;	outputs[45][3] = 0;	outputs[46][0] = 0;	outputs[46][1] = 1;	outputs[46][2] = 0;	outputs[46][3] = 0;	outputs[47][0] = 0;	outputs[47][1] = 0;	outputs[47][2] = 1;	outputs[47][3] = 0;	outputs[48][0] = 0;	outputs[48][1] = 0;	outputs[48][2] = 0;	outputs[48][3] = 1;	outputs[49][0] = 0;	outputs[49][1] = 0;	outputs[49][2] = 1;	outputs[49][3] = 0;	outputs[50][0] = 1;	outputs[50][1] = 0;	outputs[50][2] = 0;	outputs[50][3] = 0;	outputs[51][0] = 1;	outputs[51][1] = 0;	outputs[51][2] = 0;	outputs[51][3] = 0;	outputs[52][0] = 0;	outputs[52][1] = 1;	outputs[52][2] = 0;	outputs[52][3] = 0;	outputs[53][0] = 0;	outputs[53][1] = 1;	outputs[53][2] = 0;	outputs[53][3] = 0;	outputs[54][0] = 1;	outputs[54][1] = 0;	outputs[54][2] = 0;	outputs[54][3] = 0;	outputs[55][0] = 1;	outputs[55][1] = 0;	outputs[55][2] = 0;	outputs[55][3] = 0;	outputs[56][0] = 1;	outputs[56][1] = 0;	outputs[56][2] = 0;	outputs[56][3] = 0;	outputs[57][0] = 1;	outputs[57][1] = 0;	outputs[57][2] = 0;	outputs[57][3] = 0;	outputs[58][0] = 0;	outputs[58][1] = 0;	outputs[58][2] = 0;	outputs[58][3] = 1;	outputs[59][0] = 1;	outputs[59][1] = 0;	outputs[59][2] = 0;	outputs[59][3] = 0;	outputs[60][0] = 1;	outputs[60][1] = 0;	outputs[60][2] = 0;	outputs[60][3] = 0;	outputs[61][0] = 0;	outputs[61][1] = 0;	outputs[61][2] = 1;	outputs[61][3] = 0;	outputs[62][0] = 1;	outputs[62][1] = 0;	outputs[62][2] = 0;	outputs[62][3] = 0;	outputs[63][0] = 0;	outputs[63][1] = 0;	outputs[63][2] = 0;	outputs[63][3] = 1;	outputs[64][0] = 0;	outputs[64][1] = 1;	outputs[64][2] = 0;	outputs[64][3] = 0;	outputs[65][0] = 0;	outputs[65][1] = 0;	outputs[65][2] = 1;	outputs[65][3] = 0;	outputs[66][0] = 0;	outputs[66][1] = 0;	outputs[66][2] = 0;	outputs[66][3] = 1;	outputs[67][0] = 0;	outputs[67][1] = 1;	outputs[67][2] = 0;	outputs[67][3] = 0;	outputs[68][0] = 0;	outputs[68][1] = 0;	outputs[68][2] = 0;	outputs[68][3] = 1;	outputs[69][0] = 0;	outputs[69][1] = 0;	outputs[69][2] = 0;	outputs[69][3] = 1;	outputs[70][0] = 0;	outputs[70][1] = 1;	outputs[70][2] = 0;	outputs[70][3] = 0;	outputs[71][0] = 1;	outputs[71][1] = 0;	outputs[71][2] = 0;	outputs[71][3] = 0;	outputs[72][0] = 0;	outputs[72][1] = 1;	outputs[72][2] = 0;	outputs[72][3] = 0;	outputs[73][0] = 0;	outputs[73][1] = 1;	outputs[73][2] = 0;	outputs[73][3] = 0;	outputs[74][0] = 0;	outputs[74][1] = 0;	outputs[74][2] = 1;	outputs[74][3] = 0;	outputs[75][0] = 0;	outputs[75][1] = 1;	outputs[75][2] = 0;	outputs[75][3] = 0;	outputs[76][0] = 0;	outputs[76][1] = 0;	outputs[76][2] = 1;	outputs[76][3] = 0;	outputs[77][0] = 1;	outputs[77][1] = 0;	outputs[77][2] = 0;	outputs[77][3] = 0;	outputs[78][0] = 0;	outputs[78][1] = 0;	outputs[78][2] = 1;	outputs[78][3] = 0;	outputs[79][0] = 0;	outputs[79][1] = 0;	outputs[79][2] = 1;	outputs[79][3] = 0;	outputs[80][0] = 0;	outputs[80][1] = 0;	outputs[80][2] = 0;	outputs[80][3] = 1;	outputs[81][0] = 1;	outputs[81][1] = 0;	outputs[81][2] = 0;	outputs[81][3] = 0;	outputs[82][0] = 1;	outputs[82][1] = 0;	outputs[82][2] = 0;	outputs[82][3] = 0;	outputs[83][0] = 0;	outputs[83][1] = 0;	outputs[83][2] = 1;	outputs[83][3] = 0;	outputs[84][0] = 0;	outputs[84][1] = 1;	outputs[84][2] = 0;	outputs[84][3] = 0;	outputs[85][0] = 0;	outputs[85][1] = 1;	outputs[85][2] = 0;	outputs[85][3] = 0;	outputs[86][0] = 0;	outputs[86][1] = 0;	outputs[86][2] = 0;	outputs[86][3] = 1;	outputs[87][0] = 1;	outputs[87][1] = 0;	outputs[87][2] = 0;	outputs[87][3] = 0;	outputs[88][0] = 0;	outputs[88][1] = 1;	outputs[88][2] = 0;	outputs[88][3] = 0;	outputs[89][0] = 1;	outputs[89][1] = 0;	outputs[89][2] = 0;	outputs[89][3] = 0;	outputs[90][0] = 0;	outputs[90][1] = 0;	outputs[90][2] = 0;	outputs[90][3] = 1;	outputs[91][0] = 0;	outputs[91][1] = 0;	outputs[91][2] = 1;	outputs[91][3] = 0;	outputs[92][0] = 0;	outputs[92][1] = 0;	outputs[92][2] = 0;	outputs[92][3] = 1;	outputs[93][0] = 1;	outputs[93][1] = 0;	outputs[93][2] = 0;	outputs[93][3] = 0;	outputs[94][0] = 0;	outputs[94][1] = 0;	outputs[94][2] = 1;	outputs[94][3] = 0;	outputs[95][0] = 0;	outputs[95][1] = 0;	outputs[95][2] = 1;	outputs[95][3] = 0;	outputs[96][0] = 0;	outputs[96][1] = 0;	outputs[96][2] = 0;	outputs[96][3] = 1;	outputs[97][0] = 1;	outputs[97][1] = 0;	outputs[97][2] = 0;	outputs[97][3] = 0;	outputs[98][0] = 0;	outputs[98][1] = 0;	outputs[98][2] = 1;	outputs[98][3] = 0;	outputs[99][0] = 0;	outputs[99][1] = 1;	outputs[99][2] = 0;	outputs[99][3] = 0;	outputs[100][0] = 0;	outputs[100][1] = 1;	outputs[100][2] = 0;	outputs[100][3] = 0;	outputs[101][0] = 0;	outputs[101][1] = 0;	outputs[101][2] = 0;	outputs[101][3] = 1;
  #endif
}
void fill_matrix_circle(){
  #ifdef TRAINING
