ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
  circle[0][0]=4.027636;circle[0][1]=20.036720;circle[0][2]=21.374531;circle[0][3]=13.819603;circle[0][4]=-15.183036;circle[0][5]=8.259226;circle[0][6]=-39.628671;circle[0][7]=40.112691;circle[0][8]=-5.257105;circle[0][9]=52.359172;circle[0][10]=7.488636;circle[0][11]=30.522470;circle[0][12]=-10.730234;circle[0][13]=20.895870;circle[0][14]=-11.463509;circle[0][15]=21.379651;circle[0][16]=-10.041735;circle[0][17]=22.435019;circle[0][18]=-9.363231;circle[0][19]=22.803003;circle[0][20]=-8.855651;circle[0][21]=22.931312;circle[0][22]=-8.298347;circle[0][23]=22.976050;circle[0][24]=-8.104027;circle[0][25]=22.991649;circle[0][26]=-8.036272;circle[0][27]=22.997088;circle[0][28]=-8.012647;circle[0][29]=22.998985;circle[1][0]=-6.328865;circle[1][1]=15.940137;circle[1][2]=-6.021133;circle[1][3]=25.318457;circle[1][4]=9.927491;circle[1][5]=16.848542;circle[1][6]=-13.120889;circle[1][7]=4.817339;circle[1][8]=-51.453486;circle[1][9]=10.787010;circle[1][10]=-14.915039;circle[1][11]=23.126648;circle[1][12]=12.838208;circle[1][13]=12.201853;circle[1][14]=-17.743613;circle[1][15]=6.150011;circle[1][16]=-20.085746;circle[1][17]=12.857930;circle[1][18]=-14.191405;circle[1][19]=18.161036;circle[1][20]=-10.810131;circle[1][21]=20.110114;circle[1][22]=-9.631154;circle[1][23]=22.514062;circle[1][24]=-9.220070;circle[1][25]=23.481886;circle[1][26]=-9.076734;circle[1][27]=23.819345;circle[1][28]=-9.026755;circle[1][29]=23.937009;circle[2][0]=-5.526285;circle[2][1]=16.202694;circle[2][2]=-4.216869;circle[2][3]=21.590569;circle[2][4]=2.566133;circle[2][5]=14.520363;circle[2][6]=-12.858424;circle[2][7]=11.685608;circle[2][8]=-38.410094;circle[2][9]=32.895236;circle[2][10]=4.455548;circle[2][11]=50.154204;circle[2][12]=28.453256;circle[2][13]=35.212172;circle[2][14]=1.184816;circle[2][15]=22.678558;circle[2][16]=-5.570279;circle[2][17]=22.116068;circle[2][18]=-6.583276;circle[2][19]=22.384370;circle[2][20]=-6.854697;circle[2][21]=22.785343;circle[2][22]=-6.949336;circle[2][23]=23.493713;circle[2][24]=-6.982335;circle[2][25]=25.738691;circle[2][26]=-6.993840;circle[2][27]=26.560209;circle[2][28]=-6.997852;circle[2][29]=26.846654;circle[3][0]=-5.556262;circle[3][1]=16.539647;circle[3][2]=-3.661766;circle[3][3]=23.182266;circle[3][4]=5.761946;circle[3][5]=16.492908;circle[3][6]=-24.990258;circle[3][7]=10.566300;circle[3][8]=-35.140279;circle[3][9]=31.100845;circle[3][10]=2.890209;circle[3][11]=43.187574;circle[3][12]=12.506159;circle[3][13]=22.430648;circle[3][14]=-11.297348;circle[3][15]=11.239439;circle[3][16]=-11.895824;circle[3][17]=16.641658;circle[3][18]=-10.561033;circle[3][19]=20.600221;circle[3][20]=-8.506207;circle[3][21]=22.684952;circle[3][22]=-7.525182;circle[3][23]=24.010030;circle[3][24]=-7.248730;circle[3][25]=25.064329;circle[3][26]=-7.086727;circle[3][27]=25.673752;circle[3][28]=-7.030240;circle[3][29]=25.886244;circle[4][0]=-5.604092;circle[4][1]=17.152226;circle[4][2]=-6.694217;circle[4][3]=23.025912;circle[4][4]=-1.391431;circle[4][5]=15.060035;circle[4][6]=-5.543960;circle[4][7]=14.457036;circle[4][8]=-46.088140;circle[4][9]=30.098844;circle[4][10]=-32.695980;circle[4][11]=52.668194;circle[4][12]=10.347218;circle[4][13]=40.107831;circle[4][14]=-10.813556;circle[4][15]=19.345209;circle[4][16]=-16.323694;circle[4][17]=19.070971;circle[4][18]=-12.212159;circle[4][19]=21.636481;circle[4][20]=-10.120011;circle[4][21]=23.175892;circle[4][22]=-8.981014;circle[4][23]=23.712651;circle[4][24]=-8.342058;circle[4][25]=23.899808;circle[4][26]=-8.119268;circle[4][27]=23.965065;circle[4][28]=-8.041586;circle[4][29]=23.987819;circle[5][0]=-6.125795;circle[5][1]=17.908826;circle[5][2]=-5.877238;circle[5][3]=24.896137;circle[5][4]=-4.117069;circle[5][5]=23.779356;circle[5][6]=-7.424483;circle[5][7]=24.695916;circle[5][8]=-33.916710;circle[5][9]=27.598101;circle[5][10]=-39.431289;circle[5][11]=38.070930;circle[5][12]=-3.647704;circle[5][13]=37.479316;circle[5][14]=30.515609;circle[5][15]=25.304088;circle[5][16]=1.142607;circle[5][17]=18.205628;circle[5][18]=-7.477280;circle[5][19]=20.249032;circle[5][20]=-8.550849;circle[5][21]=21.389475;circle[5][22]=-8.843391;circle[5][23]=22.308826;circle[5][24]=-8.945394;circle[5][25]=23.227562;circle[5][26]=-8.980960;circle[5][27]=23.730667;circle[5][28]=-8.993361;circle[5][29]=23.906090;circle[6][0]=-6.360692;circle[6][1]=17.947898;circle[6][2]=-6.266351;circle[6][3]=23.788060;circle[6][4]=1.342474;circle[6][5]=21.417450;circle[6][6]=-11.478011;circle[6][7]=16.497520;circle[6][8]=-38.960735;circle[6][9]=35.672790;circle[6][10]=-25.595195;circle[6][11]=41.760546;circle[6][12]=15.605265;circle[6][13]=36.174077;circle[6][14]=6.172327;circle[6][15]=19.667379;circle[6][16]=-11.839213;circle[6][17]=14.766579;circle[6][18]=-11.323576;circle[6][19]=18.017293;circle[6][20]=-9.810181;circle[6][21]=21.223895;circle[6][22]=-9.282493;circle[6][23]=22.380711;circle[6][24]=-9.098499;circle[6][25]=22.784067;circle[6][26]=-9.034345;circle[6][27]=23.195709;circle[6][28]=-9.011975;circle[6][29]=23.719561;circle[7][0]=-6.068842;circle[7][1]=16.742716;circle[7][2]=6.324619;circle[7][3]=22.734196;circle[7][4]=7.340179;circle[7][5]=16.570095;circle[7][6]=-31.375675;circle[7][7]=10.550061;circle[7][8]=-46.471250;circle[7][9]=25.463722;circle[7][10]=-24.549322;circle[7][11]=43.953733;circle[7][12]=12.645399;circle[7][13]=40.189865;circle[7][14]=-0.467867;circle[7][15]=26.920795;circle[7][16]=-11.173786;circle[7][17]=23.736626;circle[7][18]=-10.430681;circle[7][19]=23.256846;circle[7][20]=-9.498848;circle[7][21]=23.558115;circle[7][22]=-9.073937;circle[7][23]=24.255434;circle[7][24]=-7.723137;circle[7][25]=24.610768;circle[7][26]=-7.523142;circle[7][27]=24.864283;circle[7][28]=-7.833730;circle[7][29]=24.952678;circle[8][0]=-5.935795;circle[8][1]=19.133985;circle[8][2]=4.240080;circle[8][3]=22.412809;circle[8][4]=10.798227;circle[8][5]=7.736704;circle[8][6]=-28.848318;circle[8][7]=11.005264;circle[8][8]=-36.887794;circle[8][9]=32.964020;circle[8][10]=3.414709;circle[8][11]=42.071616;circle[8][12]=29.949059;circle[8][13]=40.774288;circle[8][14]=-3.429257;circle[8][15]=29.289619;circle[8][16]=-9.173478;circle[8][17]=27.147019;circle[8][18]=-9.142277;circle[8][19]=26.399941;circle[8][20]=-9.049609;circle[8][21]=26.139451;circle[8][22]=-8.746298;circle[8][23]=26.048623;circle[8][24]=-8.260218;circle[8][25]=26.016954;circle[8][26]=-8.090732;circle[8][27]=26.005911;circle[8][28]=-8.031636;circle[8][29]=26.002061;circle[9][0]=-4.943683;circle[9][1]=17.195273;circle[9][2]=-4.304058;circle[9][3]=22.393993;circle[9][4]=3.414681;circle[9][5]=18.604565;circle[9][6]=-13.027430;circle[9][7]=16.187313;circle[9][8]=-45.793402;circle[9][9]=23.762427;circle[9][10]=-28.123725;circle[9][11]=37.318709;circle[9][12]=8.850592;circle[9][13]=36.405216;circle[9][14]=12.113966;circle[9][15]=19.395903;circle[9][16]=-8.002843;circle[9][17]=18.275872;circle[9][18]=-10.192908;circle[9][19]=21.029198;circle[9][20]=-9.454683;circle[9][21]=22.312824;circle[9][22]=-9.058538;circle[9][23]=23.169907;circle[9][24]=-8.369089;circle[9][25]=24.332267;circle[9][26]=-8.128694;circle[9][27]=25.418498;circle[9][28]=-8.044873;circle[9][29]=25.797243;circle[10][0]=-5.945672;circle[10][1]=18.140308;circle[10][2]=-3.313622;circle[10][3]=23.828238;circle[10][4]=7.348186;circle[10][5]=15.669094;circle[10][6]=-16.473175;circle[10][7]=8.592889;circle[10][8]=-41.210830;circle[10][9]=24.227604;circle[10][10]=-29.759446;circle[10][11]=46.899570;circle[10][12]=10.638665;circle[10][13]=38.191351;circle[10][14]=1.073089;circle[10][15]=17.869720;circle[10][16]=-12.020919;circle[10][17]=18.046009;circle[10][18]=-11.416122;circle[10][19]=20.762710;circle[10][20]=-10.493771;circle[10][21]=22.563805;circle[10][22]=-9.650464;circle[10][23]=24.150551;circle[10][24]=-9.226803;circle[10][25]=25.694078;circle[10][26]=-9.079081;circle[10][27]=27.157233;circle[10][28]=-9.027574;circle[10][29]=27.706145;circle[11][0]=-5.716285;circle[11][1]=18.106385;circle[11][2]=-3.569939;circle[11][3]=25.057431;circle[11][4]=13.703711;circle[11][5]=21.931843;circle[11][6]=-16.014211;circle[11][7]=11.851596;circle[11][8]=-34.598435;circle[11][9]=29.049495;circle[11][10]=-18.495143;circle[11][11]=44.176871;circle[11][12]=15.348453;circle[11][13]=33.797911;circle[11][14]=0.937417;circle[11][15]=13.951890;circle[11][16]=-13.182863;circle[11][17]=15.251493;circle[11][18]=-11.923029;circle[11][19]=20.051223;circle[11][20]=-10.399519;circle[11][21]=22.623147;circle[11][22]=-9.487982;circle[11][23]=23.519921;circle[11][24]=-9.170149;circle[11][25]=23.932607;circle[11][26]=-8.590768;circle[11][27]=24.627823;circle[11][28]=-8.205988;circle[11][29]=24.970230;circle[12][0]=-6.025795;circle[12][1]=18.001798;circle[12][2]=0.429450;circle[12][3]=20.989611;circle[12][4]=6.702070;circle[12][5]=9.009264;circle[12][6]=-25.728640;circle[12][7]=19.583427;circle[12][8]=-25.158489;circle[12][9]=37.557534;circle[12][10]=5.623676;circle[12][11]=48.061208;circle[12][12]=14.382011;circle[12][13]=34.426441;circle[12][14]=-10.196320;circle[12][15]=22.227413;circle[12][16]=-16.374893;circle[12][17]=23.650617;circle[12][18]=-12.780359;circle[12][19]=23.878178;circle[12][20]=-10.869451;circle[12][21]=23.957523;circle[12][22]=-9.651837;circle[12][23]=24.975451;circle[12][24]=-8.956282;circle[12][25]=25.642762;circle[12][26]=-8.333435;circle[12][27]=25.875439;circle[12][28]=-7.847703;circle[12][29]=26.056568;circle[13][0]=-6.259718;circle[13][1]=17.908826;circle[13][2]=-3.692965;circle[13][3]=24.769037;circle[13][4]=10.307888;circle[13][5]=15.383659;circle[13][6]=-18.228026;circle[13][7]=5.602600;circle[13][8]=-55.616656;circle[13][9]=17.825499;circle[13][10]=-27.228831;circle[13][11]=30.290511;circle[13][12]=14.804710;circle[13][13]=24.210142;circle[13][14]=0.356212;circle[13][15]=9.745106;circle[13][16]=-12.414899;circle[13][17]=14.167640;circle[13][18]=-11.062984;circle[13][19]=18.535915;circle[13][20]=-9.719318;circle[13][21]=21.178918;circle[13][22]=-9.250811;circle[13][23]=22.833587;circle[13][24]=-8.565749;circle[13][25]=24.061856;circle[13][26]=-7.675561;circle[13][27]=25.141448;circle[13][28]=-7.316554;circle[13][29]=25.700642;circle[14][0]=-5.681895;circle[14][1]=18.889965;circle[14][2]=-2.474207;circle[14][3]=25.265549;circle[14][4]=18.367301;circle[14][5]=19.044242;circle[14][6]=-12.423253;circle[14][7]=4.528720;circle[14][8]=-51.866426;circle[14][9]=10.937965;circle[14][10]=-33.422750;circle[14][11]=32.482148;circle[14][12]=12.502758;circle[14][13]=29.079906;circle[14][14]=7.316450;circle[14][15]=15.606872;circle[14][16]=-6.852700;circle[14][17]=15.663943;circle[14][18]=-8.941346;circle[14][19]=20.449313;circle[14][20]=-9.061337;circle[14][21]=23.383655;circle[14][22]=-9.021387;circle[14][23]=25.087737;circle[14][24]=-9.007457;circle[14][25]=25.681914;circle[14][26]=-8.534041;circle[14][27]=25.889090;circle[14][28]=-8.186209;circle[14][29]=25.961328;circle[15][0]=-5.513216;circle[15][1]=19.023888;circle[15][2]=-1.946670;circle[15][3]=24.737898;circle[15][4]=13.047926;circle[15][5]=16.242110;circle[15][6]=-14.533608;circle[15][7]=7.074474;circle[15][8]=-39.873934;circle[15][9]=37.949981;circle[15][10]=-28.383863;circle[15][11]=56.382115;circle[15][12]=0.574816;circle[15][13]=43.774201;circle[15][14]=2.396342;circle[15][15]=21.060095;circle[15][16]=-9.371024;circle[15][17]=20.419884;circle[15][18]=-9.819432;circle[15][19]=22.100369;circle[15][20]=-9.324460;circle[15][21]=22.686318;circle[15][22]=-9.113132;circle[15][23]=22.890626;circle[15][24]=-9.039447;circle[15][25]=22.961864;circle[15][26]=-8.669854;circle[15][27]=22.986703;circle[15][28]=-8.233564;circle[15][29]=23.517067;circle[16][0]=-5.604092;circle[16][1]=17.867875;circle[16][2]=-5.876932;circle[16][3]=24.867009;circle[16][4]=8.152522;circle[16][5]=22.975477;circle[16][6]=-11.725002;circle[16][7]=13.251904;circle[16][8]=-57.549063;circle[16][9]=13.608882;circle[16][10]=-47.500197;circle[16][11]=25.809478;circle[16][12]=5.616211;circle[16][13]=35.017541;circle[16][14]=30.932355;circle[16][15]=15.435379;circle[16][16]=-1.009473;circle[16][17]=7.637663;circle[16][18]=-8.808173;circle[16][19]=13.214410;circle[16][20]=-9.053645;circle[16][21]=17.551248;circle[16][22]=-9.018705;circle[16][23]=20.141395;circle[16][24]=-9.006522;circle[16][25]=21.351944;circle[16][26]=-9.002274;circle[16][27]=21.774037;circle[16][28]=-9.000793;circle[16][29]=21.921212;circle[17][0]=-4.900636;circle[17][1]=16.452716;circle[17][2]=1.137374;circle[17][3]=16.690686;circle[17][4]=0.044908;circle[17][5]=3.156810;circle[17][6]=-28.483892;circle[17][7]=13.841306;circle[17][8]=-30.564018;circle[17][9]=33.773561;circle[17][10]=-3.142695;circle[17][11]=48.706758;circle[17][12]=21.508471;circle[17][13]=24.736292;circle[17][14]=-7.710006;circle[17][15]=11.121519;circle[17][16]=-12.879281;circle[17][17]=14.680735;circle[17][18]=-11.393154;circle[17][19]=18.063498;circle[17][20]=-9.964060;circle[17][21]=19.976105;circle[17][22]=-9.336147;circle[17][23]=20.642990;circle[17][24]=-8.927207;circle[17][25]=21.344077;circle[17][26]=-8.323297;circle[17][27]=21.771294;circle[17][28]=-8.112727;circle[17][29]=21.920255;circle[18][0]=-6.259718;circle[18][1]=16.962226;circle[18][2]=-2.000735;circle[18][3]=22.980667;circle[18][4]=5.950324;circle[18][5]=14.468366;circle[18][6]=-29.923647;circle[18][7]=10.567709;circle[18][8]=-46.910289;circle[18][9]=22.891110;circle[18][10]=-11.968282;circle[18][11]=52.478503;circle[18][12]=17.989967;circle[18][13]=39.280745;circle[18][14]=-3.620522;circle[18][15]=20.800291;circle[18][16]=-8.208525;circle[18][17]=19.832451;circle[18][18]=-9.104351;circle[18][19]=20.592901;circle[18][20]=-9.036385;circle[18][21]=21.267563;circle[18][22]=-9.012687;circle[18][23]=21.744615;circle[18][24]=-8.594914;circle[18][25]=21.910953;circle[18][26]=-8.207434;circle[18][27]=22.437510;circle[18][28]=-8.072328;circle[18][29]=22.803872;circle[19][0]=-5.137142;circle[19][1]=15.157139;circle[19][2]=1.491597;circle[19][3]=16.927583;circle[19][4]=6.969112;circle[19][5]=9.699807;circle[19][6]=-20.979334;circle[19][7]=9.004338;circle[19][8]=-41.270240;circle[19][9]=17.706420;circle[19][10]=-15.049223;circle[19][11]=29.375143;circle[19][12]=23.723933;circle[19][13]=28.643525;circle[19][14]=4.274510;circle[19][15]=13.090229;circle[19][16]=-8.739281;circle[19][17]=13.874217;circle[19][18]=-9.458326;circle[19][19]=18.564889;circle[19][20]=-9.159808;circle[19][21]=20.802251;circle[19][22]=-9.055722;circle[19][23]=21.582371;circle[19][24]=-9.019429;circle[19][25]=22.315382;circle[19][26]=-8.735774;circle[19][27]=23.412610;circle[19][28]=-8.256549;circle[19][29]=23.795190;circle[20][0]=-5.367236;circle[20][1]=16.925247;circle[20][2]=-2.334780;circle[20][3]=22.208786;circle[20][4]=10.998557;circle[20][5]=9.415882;circle[20][6]=-34.403450;circle[20][7]=8.176886;circle[20][8]=-66.954545;circle[20][9]=26.458513;circle[20][10]=-23.677979;circle[20][11]=46.060586;circle[20][12]=19.490953;circle[20][13]=30.451708;circle[20][14]=-2.767573;circle[20][15]=14.436383;circle[20][16]=-14.194160;circle[20][17]=14.933655;circle[20][18]=-12.605695;circle[20][19]=17.499391;circle[20][20]=-10.619339;circle[20][21]=20.219327;circle[20][22]=-7.852475;circle[20][23]=21.948651;circle[20][24]=-6.645918;circle[20][25]=22.942927;circle[20][26]=-6.225218;circle[20][27]=22.980100;circle[20][28]=-6.078529;circle[20][29]=23.644383;circle[21][0]=-6.328865;circle[21][1]=15.827067;circle[21][2]=2.305176;circle[21][3]=20.943062;circle[21][4]=1.118178;circle[21][5]=12.579829;circle[21][6]=-48.614725;circle[21][7]=17.340883;circle[21][8]=-57.110227;circle[21][9]=36.432406;circle[21][10]=-5.992612;circle[21][11]=44.959199;circle[21][12]=9.503842;circle[21][13]=18.067162;circle[21][14]=-16.976799;circle[21][15]=13.615654;circle[21][16]=-16.800476;circle[21][17]=18.121945;circle[21][18]=-12.582586;circle[21][19]=20.609064;circle[21][20]=-10.287913;circle[21][21]=21.515010;circle[21][22]=-8.980508;circle[21][23]=21.830895;circle[21][24]=-8.341882;circle[21][25]=21.941037;circle[21][26]=-8.119207;circle[21][27]=21.979441;circle[21][28]=-8.041565;circle[21][29]=21.992831;circle[22][0]=-6.838375;circle[22][1]=17.355296;circle[22][2]=3.759553;circle[22][3]=19.726715;circle[22][4]=-5.993542;circle[22][5]=7.371820;circle[22][6]=-44.444555;circle[22][7]=8.441140;circle[22][8]=-45.996857;circle[22][9]=26.380409;circle[22][10]=9.852748;circle[22][11]=36.014442;circle[22][12]=27.471235;circle[22][13]=13.688277;circle[22][14]=2.403081;circle[22][15]=11.101410;circle[22][16]=-5.023992;circle[22][17]=17.509833;circle[22][18]=-7.613652;circle[22][19]=19.783054;circle[22][20]=-8.516610;circle[22][21]=20.575677;circle[22][22]=-8.831452;circle[22][23]=20.852048;circle[22][24]=-8.941231;circle[22][25]=20.948412;circle[22][26]=-8.979509;circle[22][27]=22.042844;circle[22][28]=-8.992855;circle[22][29]=22.666260;circle[23][0]=-5.513216;circle[23][1]=16.017944;circle[23][2]=-5.151320;circle[23][3]=23.564830;circle[23][4]=6.216232;circle[23][5]=19.613816;circle[23][6]=-10.883112;circle[23][7]=9.728204;circle[23][8]=-43.080559;circle[23][9]=14.199273;circle[23][10]=-51.878348;circle[23][11]=40.025526;circle[23][12]=-24.023987;circle[23][13]=51.363840;circle[23][14]=10.713489;circle[23][15]=41.186020;circle[23][16]=21.061141;circle[23][17]=17.221349;circle[23][18]=-10.302955;circle[23][19]=13.796360;circle[23][20]=-13.783386;circle[23][21]=17.524543;circle[23][22]=-11.540690;circle[23][23]=19.788183;circle[23][24]=-9.797646;circle[23][25]=20.577466;circle[23][26]=-8.626801;circle[23][27]=20.852671;circle[23][28]=-8.218552;circle[23][29]=20.948630;circle[24][0]=-6.026672;circle[24][1]=17.143103;circle[24][2]=-1.162129;circle[24][3]=21.834317;circle[24][4]=4.963143;circle[24][5]=9.006103;circle[24][6]=-24.277065;circle[24][7]=2.086339;circle[24][8]=-56.084860;circle[24][9]=12.234892;circle[24][10]=-50.200913;circle[24][11]=40.710887;circle[24][12]=-10.855595;circle[24][13]=56.920473;circle[24][14]=15.740566;circle[24][15]=26.245446;circle[24][16]=-22.827530;circle[24][17]=15.665305;circle[24][18]=-25.305327;circle[24][19]=17.375154;circle[24][20]=-18.155647;circle[24][21]=19.084773;circle[24][22]=-13.736831;circle[24][23]=20.024780;circle[24][24]=-11.683274;circle[24][25]=20.659962;circle[24][26]=-10.177411;circle[24][27]=20.881436;circle[24][28]=-8.888835;circle[24][29]=20.958659;circle[25][0]=-6.125795;circle[25][1]=16.702204;circle[25][2]=-4.714899;circle[25][3]=20.760059;circle[25][4]=-0.786781;circle[25][5]=10.187999;circle[25][6]=-21.914355;circle[25][7]=4.207716;circle[25][8]=-38.439450;circle[25][9]=23.782365;circle[25][10]=-9.024719;circle[25][11]=50.884524;circle[25][12]=23.822126;circle[25][13]=56.931268;circle[25][14]=17.165485;circle[25][15]=26.981909;circle[25][16]=-15.857078;circle[25][17]=15.967471;circle[25][18]=-17.022633;circle[25][19]=17.803450;circle[25][20]=-14.340126;circle[25][21]=19.153111;circle[25][22]=-12.376037;circle[25][23]=20.226411;circle[25][24]=-11.070284;circle[25][25]=20.730266;circle[25][26]=-10.373185;circle[25][27]=20.905950;circle[25][28]=-10.130122;circle[25][29]=20.967207;circle[26][0]=-5.925795;circle[26][1]=14.333349;circle[26][2]=2.386492;circle[26][3]=15.190041;circle[26][4]=3.868996;circle[26][5]=-0.505528;circle[26][6]=-41.302016;circle[26][7]=-3.527341;circle[26][8]=-37.850749;circle[26][9]=26.310323;circle[26][10]=-2.617193;circle[26][11]=47.109290;circle[26][12]=27.504508;circle[26][13]=35.661410;circle[26][14]=-1.190319;circle[26][15]=18.091638;circle[26][16]=-13.511712;circle[26][17]=18.499521;circle[26][18]=-11.445419;circle[26][19]=19.476815;circle[26][20]=-9.852665;circle[26][21]=20.007577;circle[26][22]=-9.297306;circle[26][23]=21.266543;circle[26][24]=-9.103664;circle[26][25]=21.744259;circle[26][26]=-9.036145;circle[26][27]=21.910829;circle[26][28]=-9.012603;circle[26][29]=21.968908;circle[27][0]=-5.773916;circle[27][1]=17.253394;circle[27][2]=5.202808;circle[27][3]=19.475082;circle[27][4]=6.619545;circle[27][5]=4.857966;circle[27][6]=-40.204322;circle[27][7]=11.677673;circle[27][8]=-43.310248;circle[27][9]=43.814044;circle[27][10]=4.431896;circle[27][11]=51.352378;circle[27][12]=35.505871;circle[27][13]=39.304720;circle[27][14]=1.924934;circle[27][15]=18.901407;circle[27][16]=-7.004069;circle[27][17]=19.343393;circle[27][18]=-8.955383;circle[27][19]=20.422377;circle[27][20]=-9.114062;circle[27][21]=21.639128;circle[27][22]=-9.039771;circle[27][23]=22.935003;circle[27][24]=-9.013867;circle[27][25]=23.628659;circle[27][26]=-9.004835;circle[27][27]=23.870521;circle[27][28]=-9.001686;circle[27][29]=24.606175;circle[28][0]=-6.125795;circle[28][1]=16.195747;circle[28][2]=-2.650446;circle[28][3]=22.266927;circle[28][4]=16.500683;circle[28][5]=11.824925;circle[28][6]=-29.331431;circle[28][7]=14.624514;circle[28][8]=-45.000082;circle[28][9]=38.088263;circle[28][10]=-8.062265;circle[28][11]=51.109593;circle[28][12]=38.718738;circle[28][13]=39.734441;circle[28][14]=10.337771;circle[28][15]=22.513680;circle[28][16]=-7.912455;circle[28][17]=20.368390;circle[28][18]=-9.609570;circle[28][19]=22.601854;circle[28][20]=-9.863865;circle[28][21]=24.163818;circle[28][22]=-8.770420;circle[28][23]=25.277974;circle[28][24]=-8.268629;circle[28][25]=25.748245;circle[28][26]=-8.093665;circle[28][27]=25.912219;circle[28][28]=-8.032659;circle[28][29]=25.969392;circle[29][0]=-4.432077;circle[29][1]=16.071088;circle[29][2]=-5.104721;circle[29][3]=23.013002;circle[29][4]=11.180601;circle[29][5]=15.858398;circle[29][6]=-1.893438;circle[29][7]=4.054432;circle[29][8]=-36.751999;circle[29][9]=12.806616;circle[29][10]=-38.570754;circle[29][11]=32.771898;circle[29][12]=-11.096312;circle[29][13]=37.056832;circle[29][14]=22.804876;circle[29][15]=19.466124;circle[29][16]=-10.606156;circle[29][17]=6.025530;circle[29][18]=-17.207858;circle[29][19]=11.898653;circle[29][20]=-13.187948;circle[29][21]=17.407493;circle[29][22]=-11.011569;circle[29][23]=20.398692;circle[29][24]=-10.495391;circle[29][25]=21.902658;circle[29][26]=-9.651029;circle[29][27]=23.268702;circle[29][28]=-9.227000;circle[29][29]=23.745012;circle[30][0]=-6.639251;circle[30][1]=16.130137;circle[30][2]=-2.644545;circle[30][3]=22.773467;circle[30][4]=17.906735;circle[30][5]=8.441285;circle[30][6]=-23.700376;circle[30][7]=6.968075;circle[30][8]=-37.121978;circle[30][9]=43.021734;circle[30][10]=5.613776;circle[30][11]=52.011481;circle[30][12]=36.236062;circle[30][13]=32.803742;circle[30][14]=6.973673;circle[30][15]=13.135347;circle[30][16]=-5.405371;circle[30][17]=15.709990;circle[30][18]=-8.126952;circle[30][19]=20.608600;circle[30][20]=-8.695587;circle[30][21]=22.817492;circle[30][22]=-8.793858;circle[30][23]=23.858685;circle[30][24]=-8.276801;circle[30][25]=24.602048;circle[30][26]=-8.096515;circle[30][27]=24.861243;circle[30][28]=-8.033653;circle[30][29]=24.951618;circle[31][0]=-8.252226;circle[31][1]=14.003235;circle[31][2]=-4.577198;circle[31][3]=21.103847;circle[31][4]=11.673376;circle[31][5]=17.510753;circle[31][6]=-11.636405;circle[31][7]=9.383439;circle[31][8]=-50.035683;circle[31][9]=14.129203;circle[31][10]=-37.674861;circle[31][11]=31.062394;circle[31][12]=12.449903;circle[31][13]=29.750361;circle[31][14]=15.447297;circle[31][15]=10.927214;circle[31][16]=-5.351846;circle[31][17]=9.012703;circle[31][18]=-9.220932;circle[31][19]=15.647821;circle[31][20]=-9.728356;circle[31][21]=20.436454;circle[31][22]=-9.634284;circle[31][23]=22.675680;circle[31][24]=-8.877261;circle[31][25]=24.635548;circle[31][26]=-8.305882;circle[31][27]=26.175567;circle[31][28]=-8.106654;circle[31][29]=26.712538;circle[32][0]=-6.125795;circle[32][1]=17.807853;circle[32][2]=-1.866312;circle[32][3]=24.985129;circle[32][4]=9.092125;circle[32][5]=13.375155;circle[32][6]=-29.281405;circle[32][7]=3.767664;circle[32][8]=-45.270046;circle[32][9]=25.057679;circle[32][10]=-8.148035;circle[32][11]=42.975650;circle[32][12]=26.527042;circle[32][13]=30.508197;circle[32][14]=4.040852;circle[32][15]=10.783962;circle[32][16]=-14.172937;circle[32][17]=14.181838;circle[32][18]=-13.142380;circle[32][19]=17.932590;circle[32][20]=-10.526147;circle[32][21]=20.461251;circle[32]