ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
[22]=-9.532135;circle[32][23]=21.463471;circle[32][24]=-8.841644;circle[32][25]=21.740024;circle[32][26]=-8.103463;circle[32][27]=22.560674;circle[32][28]=-7.384754;circle[32][29]=23.190716;circle[33][0]=-5.513216;circle[33][1]=18.411308;circle[33][2]=-7.169333;circle[33][3]=24.565952;circle[33][4]=-0.976770;circle[33][5]=20.581283;circle[33][6]=-10.759418;circle[33][7]=8.365274;circle[33][8]=-44.864367;circle[33][9]=15.451300;circle[33][10]=-34.794273;circle[33][11]=34.523043;circle[33][12]=-0.202896;circle[33][13]=43.814455;circle[33][14]=14.153329;circle[33][15]=25.979972;circle[33][16]=-23.974462;circle[33][17]=13.589285;circle[33][18]=-25.183535;circle[33][19]=16.653513;circle[33][20]=-17.117959;circle[33][21]=20.135795;circle[33][22]=-12.137979;circle[33][23]=22.108551;circle[33][24]=-10.094146;circle[33][25]=24.643136;circle[33][26]=-9.110505;circle[33][27]=25.255891;circle[33][28]=-8.387209;circle[33][29]=25.089224;circle[34][0]=-6.177375;circle[34][1]=17.807853;circle[34][2]=10.417276;circle[34][3]=16.355644;circle[34][4]=6.015266;circle[34][5]=8.401979;circle[34][6]=-34.833282;circle[34][7]=30.152853;circle[34][8]=-29.000979;circle[34][9]=55.098923;circle[34][10]=10.094275;circle[34][11]=65.227560;circle[34][12]=17.137835;circle[34][13]=37.684045;circle[34][14]=-10.924459;circle[34][15]=26.188011;circle[34][16]=-12.490027;circle[34][17]=23.050759;circle[34][18]=-10.868219;circle[34][19]=21.815055;circle[34][20]=-9.378077;circle[34][21]=22.345024;circle[34][22]=-8.480506;circle[34][23]=22.771624;circle[34][24]=-8.511442;circle[34][25]=23.952070;circle[34][26]=-8.829650;circle[34][27]=25.285931;circle[34][28]=-8.596703;circle[34][29]=25.751020;circle[35][0]=-5.897842;circle[35][1]=16.924273;circle[35][2]=-0.667219;circle[35][3]=23.669728;circle[35][4]=19.434919;circle[35][5]=12.383894;circle[35][6]=-33.829118;circle[35][7]=8.426259;circle[35][8]=-77.955219;circle[35][9]=44.812272;circle[35][10]=-5.324335;circle[35][11]=66.916307;circle[35][12]=17.771131;circle[35][13]=21.177364;circle[35][14]=-10.341950;circle[35][15]=13.553733;circle[35][16]=-11.601207;circle[35][17]=17.421502;circle[35][18]=-9.906985;circle[35][19]=19.752255;circle[35][20]=-8.746713;circle[35][21]=20.607985;circle[35][22]=-8.260363;circle[35][23]=21.514634;circle[35][24]=-8.090783;circle[35][25]=21.830763;circle[35][26]=-8.031654;circle[35][27]=21.940991;circle[35][28]=-8.011037;circle[35][29]=21.979425;circle[36][0]=-6.125795;circle[36][1]=17.152226;circle[36][2]=-5.796062;circle[36][3]=22.634529;circle[36][4]=2.022267;circle[36][5]=16.615649;circle[36][6]=-23.619356;circle[36][7]=6.883505;circle[36][8]=-67.058297;circle[36][9]=24.726881;circle[36][10]=-32.667794;circle[36][11]=37.366911;circle[36][12]=16.965621;circle[36][13]=26.316347;circle[36][14]=11.219294;circle[36][15]=7.880148;circle[36][16]=-13.502294;circle[36][17]=10.617818;circle[36][18]=-13.038160;circle[36][19]=16.898860;circle[36][20]=-11.059341;circle[36][21]=20.933922;circle[36][22]=-9.947666;circle[36][23]=23.030925;circle[36][24]=-9.330431;circle[36][25]=24.313426;circle[36][26]=-8.771314;circle[36][27]=24.760606;circle[36][28]=-8.268941;circle[36][29]=24.916529;circle[37][0]=-6.542618;circle[37][1]=18.944643;circle[37][2]=0.288360;circle[37][3]=18.844577;circle[37][4]=5.172988;circle[37][5]=4.236609;circle[37][6]=-25.443193;circle[37][7]=13.146635;circle[37][8]=-34.684824;circle[37][9]=31.864850;circle[37][10]=-7.501911;circle[37][11]=43.852519;circle[37][12]=10.160883;circle[37][13]=50.160287;circle[37][14]=14.237482;circle[37][15]=15.352787;circle[37][16]=-15.765881;circle[37][17]=2.658212;circle[37][18]=-18.765131;circle[37][19]=11.328464;circle[37][20]=-14.425127;circle[37][21]=16.955891;circle[37][22]=-12.004268;circle[37][23]=20.621607;circle[37][24]=-10.698845;circle[37][25]=22.822027;circle[37][26]=-10.243672;circle[37][27]=23.589266;circle[37][28]=-9.472384;circle[37][29]=23.388227;circle[38][0]=-6.738375;circle[38][1]=16.539647;circle[38][2]=-4.484105;circle[38][3]=22.299108;circle[38][4]=2.398585;circle[38][5]=17.922399;circle[38][6]=-17.615634;circle[38][7]=5.202812;circle[38][8]=-48.718889;circle[38][9]=13.421044;circle[38][10]=-42.013951;circle[38][11]=36.787348;circle[38][12]=-29.237336;circle[38][13]=62.344442;circle[38][14]=0.323327;circle[38][15]=41.053560;circle[38][16]=-12.553887;circle[38][17]=19.482052;circle[38][18]=-25.602290;circle[38][19]=18.225233;circle[38][20]=-19.199724;circle[38][21]=20.222499;circle[38][22]=-13.146487;circle[38][23]=21.180224;circle[38][24]=-10.445791;circle[38][25]=21.324951;circle[38][26]=-8.934583;circle[38][27]=21.764625;circle[38][28]=-8.325869;circle[38][29]=21.917930;circle[39][0]=-6.467375;circle[39][1]=16.972103;circle[39][2]=-5.418288;circle[39][3]=23.032246;circle[39][4]=0.269751;circle[39][5]=20.576452;circle[39][6]=-1.292333;circle[39][7]=1.307062;circle[39][8]=-31.554320;circle[39][9]=4.452800;circle[39][10]=-59.179276;circle[39][11]=20.278335;circle[39][12]=-39.863571;circle[39][13]=35.335412;circle[39][14]=11.942583;circle[39][15]=28.302512;circle[39][16]=-9.561393;circle[39][17]=7.699709;circle[39][18]=-18.596141;circle[39][19]=10.197508;circle[39][20]=-14.513655;circle[39][21]=16.983255;circle[39][22]=-11.473814;circle[39][23]=20.465051;circle[39][24]=-9.862566;circle[39][25]=22.525628;circle[39][26]=-9.300758;circle[39][27]=23.485918;circle[39][28]=-9.104868;circle[39][29]=23.820751;
  #endif
}
void fill_matrix_square(){
  #ifdef TRAINING
