ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
  square[0][0]=-6.360692;square[0][1]=12.864170;square[0][2]=-8.270052;square[0][3]=17.892211;square[0][4]=37.437548;square[0][5]=13.055435;square[0][6]=-4.027858;square[0][7]=-1.363185;square[0][8]=-17.938258;square[0][9]=-2.722960;square[0][10]=-3.310085;square[0][11]=1.251742;square[0][12]=-10.558362;square[0][13]=35.939898;square[0][14]=-41.693429;square[0][15]=25.638275;square[0][16]=3.672102;square[0][17]=25.398355;square[0][18]=7.512275;square[0][19]=47.704226;square[0][20]=-1.770535;square[0][21]=12.894786;square[0][22]=-5.909709;square[0][23]=6.416047;square[0][24]=-7.271160;square[0][25]=12.354559;square[0][26]=-7.745869;square[0][27]=16.646456;square[0][28]=-7.911390;square[0][29]=18.830692;square[1][0]=-6.125795;square[1][1]=14.692785;square[1][2]=-8.015248;square[1][3]=20.103453;square[1][4]=5.261540;square[1][5]=26.153799;square[1][6]=11.543213;square[1][7]=16.974955;square[1][8]=-21.971124;square[1][9]=14.274578;square[1][10]=-16.940598;square[1][11]=6.985455;square[1][12]=-17.593109;square[1][13]=3.578225;square[1][14]=-16.884234;square[1][15]=29.468048;square[1][16]=-39.692189;square[1][17]=30.796603;square[1][18]=-42.470919;square[1][19]=31.163580;square[1][20]=-10.581676;square[1][21]=37.493583;square[1][22]=-9.934750;square[1][23]=54.003133;square[1][24]=-9.666668;square[1][25]=25.483951;square[1][26]=-9.271195;square[1][27]=17.530471;square[1][28]=-8.572857;square[1][29]=18.487177;square[2][0]=-6.125795;square[2][1]=14.701908;square[2][2]=-8.205248;square[2][3]=20.757956;square[2][4]=18.453896;square[2][5]=23.477417;square[2][6]=-1.594159;square[2][7]=20.970169;square[2][8]=-17.782832;square[2][9]=12.718093;square[2][10]=-9.565392;square[2][11]=4.293337;square[2][12]=-8.823260;square[2][13]=28.841910;square[2][14]=-22.202750;square[2][15]=31.415608;square[2][16]=-36.070199;square[2][17]=21.334920;square[2][18]=-6.691649;square[2][19]=23.008418;square[2][20]=-3.971457;square[2][21]=32.820284;square[2][22]=-4.593986;square[2][23]=15.999263;square[2][24]=-8.115040;square[2][25]=8.301647;square[2][26]=-8.821052;square[2][27]=12.931027;square[2][28]=-8.937605;square[2][29]=17.366841;square[3][0]=-6.168842;square[3][1]=16.060990;square[3][2]=-8.616328;square[3][3]=21.781072;square[3][4]=5.046191;square[3][5]=23.479080;square[3][6]=-13.838799;square[3][7]=22.957726;square[3][8]=-23.907046;square[3][9]=18.176418;square[3][10]=-15.197988;square[3][11]=5.253320;square[3][12]=-6.985420;square[3][13]=31.987631;square[3][14]=-32.818041;square[3][15]=29.621648;square[3][16]=-3.427235;square[3][17]=26.045457;square[3][18]=0.746023;square[3][19]=48.887082;square[3][20]=-4.952352;square[3][21]=23.050394;square[3][22]=-6.937351;square[3][23]=15.986962;square[3][24]=-7.629477;square[3][25]=17.400185;square[3][26]=-7.870807;square[3][27]=18.442179;square[3][28]=-7.954953;square[3][29]=19.418079;square[4][0]=-6.394475;square[4][1]=16.673570;square[4][2]=2.768431;square[4][3]=22.055183;square[4][4]=5.702412;square[4][5]=27.280593;square[4][6]=-24.267741;square[4][7]=22.831520;square[4][8]=-17.290233;square[4][9]=12.223409;square[4][10]=-13.560574;square[4][11]=27.923630;square[4][12]=-16.353069;square[4][13]=37.739472;square[4][14]=-29.364455;square[4][15]=32.332051;square[4][16]=-4.928847;square[4][17]=30.711056;square[4][18]=-1.604318;square[4][19]=39.858658;square[4][20]=-8.373093;square[4][21]=14.621977;square[4][22]=-10.173066;square[4][23]=9.536760;square[4][24]=-10.060344;square[4][25]=13.726311;square[4][26]=-10.021041;square[4][27]=16.978416;square[4][28]=-10.007336;square[4][29]=18.295117;square[5][0]=-5.604092;square[5][1]=15.927067;square[5][2]=3.363105;square[5][3]=23.198376;square[5][4]=10.933597;square[5][5]=21.691894;square[5][6]=-27.226054;square[5][7]=18.365459;square[5][8]=-27.134207;square[5][9]=3.834024;square[5][10]=-20.971315;square[5][11]=21.439166;square[5][12]=-26.368339;square[5][13]=35.216680;square[5][14]=-36.182034;square[5][15]=24.541751;square[5][16]=-3.270314;square[5][17]=20.614466;square[5][18]=-1.638289;square[5][19]=36.620438;square[5][20]=-1.076662;square[5][21]=11.317177;square[5][22]=-2.738883;square[5][23]=9.060109;square[5][24]=-4.229809;square[5][25]=13.973703;square[5][26]=-5.952305;square[5][27]=18.117170;square[5][28]=-6.634691;square[5][29]=20.646141;square[6][0]=-6.259718;square[6][1]=15.405364;square[6][2]=-7.983265;square[6][3]=21.429898;square[6][4]=13.913460;square[6][5]=20.146586;square[6][6]=-26.782443;square[6][7]=21.476651;square[6][8]=-27.999253;square[6][9]=8.883136;square[6][10]=-17.355227;square[6][11]=6.956781;square[6][12]=-17.176190;square[6][13]=32.768104;square[6][14]=-42.327033;square[6][15]=28.769324;square[6][16]=2.070125;square[6][17]=31.524303;square[6][18]=7.508875;square[6][19]=49.044073;square[6][20]=-3.418599;square[6][21]=34.080276;square[6][22]=-9.718996;square[6][23]=13.172184;square[6][24]=-9.384299;square[6][25]=15.261600;square[6][26]=-8.482675;square[6][27]=17.928758;square[6][28]=-8.168298;square[6][29]=19.729124;square[7][0]=-6.542595;square[7][1]=15.927067;square[7][2]=6.414268;square[7][3]=22.253765;square[7][4]=11.065982;square[7][5]=22.383182;square[7][6]=-25.447651;square[7][7]=19.080541;square[7][8]=-20.136827;square[7][9]=2.300517;square[7][10]=-17.228219;square[7][11]=22.102821;square[7][12]=-31.408470;square[7][13]=28.887430;square[7][14]=-13.877806;square[7][15]=28.018397;square[7][16]=19.776894;square[7][17]=44.229821;square[7][18]=5.890340;square[7][19]=54.341858;square[7][20]=-6.089459;square[7][21]=21.025631;square[7][22]=-7.985157;square[7][23]=16.531674;square[7][24]=-8.033567;square[7][25]=17.376619;square[7][26]=-8.011704;square[7][27]=18.955665;square[7][28]=-8.004081;square[7][29]=19.635863;square[8][0]=-6.984491;square[8][1]=15.214488;square[8][2]=9.850844;square[8][3]=20.434678;square[8][4]=8.697607;square[8][5]=19.852248;square[8][6]=-18.267172;square[8][7]=17.499380;square[8][8]=-13.408141;square[8][9]=2.532033;square[8][10]=-13.495381;square[8][11]=26.489781;square[8][12]=-36.548728;square[8][13]=29.377307;square[8][14]=-24.372005;square[8][15]=19.208160;square[8][16]=-0.670543;square[8][17]=43.680873;square[8][18]=-2.190663;square[8][19]=37.950098;square[8][20]=-6.104028;square[8][21]=17.192970;square[8][22]=-7.338915;square[8][23]=16.906161;square[8][24]=-7.769494;square[8][25]=19.110456;square[8][26]=-7.919628;square[8][27]=20.341157;square[8][28]=-7.971976;square[8][29]=20.770276;square[9][0]=-5.146752;square[9][1]=13.989329;square[9][2]=11.237966;square[9][3]=17.445619;square[9][4]=-0.698409;square[9][5]=13.834908;square[9][6]=-25.567701;square[9][7]=14.907302;square[9][8]=-15.752022;square[9][9]=8.966150;square[9][10]=-10.477048;square[9][11]=32.462732;square[9][12]=-26.848622;square[9][13]=37.405813;square[9][14]=-7.175406;square[9][15]=36.779064;square[9][16]=3.470299;square[9][17]=48.219726;square[9][18]=-8.716744;square[9][19]=23.396656;square[9][20]=-10.996023;square[9][21]=8.248977;square[9][22]=-10.003392;square[9][23]=12.876240;square[9][24]=-9.659371;square[9][25]=17.274287;square[9][26]=-8.886008;square[9][27]=19.049603;square[9][28]=-8.308932;square[9][29]=20.190320;square[10][0]=-5.557236;square[10][1]=14.233349;square[10][2]=6.419494;square[10][3]=22.343768;square[10][4]=-15.114310;square[10][5]=33.515233;square[10][6]=-27.047004;square[10][7]=24.348939;square[10][8]=-14.274090;square[10][9]=19.931265;square[10][10]=-22.875790;square[10][11]=41.136577;square[10][12]=-42.992377;square[10][13]=32.977218;square[10][14]=-7.405207;square[10][15]=27.449115;square[10][16]=10.385520;square[10][17]=42.617914;square[10][18]=10.408610;square[10][19]=39.353959;square[10][20]=2.979503;square[10][21]=19.570669;square[10][22]=-1.324586;square[10][23]=18.653875;square[10][24]=-3.067141;square[10][25]=19.530635;square[10][26]=-3.674732;square[10][27]=20.358046;square[10][28]=-3.696586;square[10][29]=20.776164;square[11][0]=-5.604092;square[11][1]=15.870114;square[11][2]=7.447753;square[11][3]=20.900105;square[11][4]=-3.876405;square[11][5]=15.836084;square[11][6]=-31.996863;square[11][7]=7.195996;square[11][8]=-21.254667;square[11][9]=-4.211828;square[11][10]=-20.918037;square[11][11]=20.500600;square[11][12]=-51.508022;square[11][13]=20.219323;square[11][14]=-15.651956;square[11][15]=21.725090;square[11][16]=1.130838;square[11][17]=45.503477;square[11][18]=-0.546788;square[11][19]=35.023025;square[11][20]=-4.098583;square[11][21]=20.198775;square[11][22]=-5.337017;square[11][23]=19.559368;square[11][24]=-5.768832;square[11][25]=20.036361;square[11][26]=-5.919397;square[11][27]=20.664000;square[11][28]=-5.971895;square[11][29]=20.882844;square[12][0]=-6.670444;square[12][1]=15.756067;square[12][2]=9.196508;square[12][3]=22.690793;square[12][4]=7.080215;square[12][5]=13.902951;square[12][6]=-9.296126;square[12][7]=7.376008;square[12][8]=-9.704990;square[12][9]=-3.965473;square[12][10]=-14.617641;square[12][11]=18.096518;square[12][12]=-33.170072;square[12][13]=14.440512;square[12][14]=-6.413942;square[12][15]=20.349715;square[12][16]=-1.196345;square[12][17]=42.210367;square[12][18]=0.656654;square[12][19]=16.877963;square[12][20]=-3.027647;square[12][21]=9.321584;square[12][22]=-4.312283;square[12][23]=14.181879;square[12][24]=-5.228767;square[12][25]=17.788584;square[12][26]=-5.731088;square[12][27]=19.228927;square[12][28]=-5.906236;square[12][29]=19.731143;square[13][0]=-6.025795;square[13][1]=14.360329;square[13][2]=6.190560;square[13][3]=18.183920;square[13][4]=6.603373;square[13][5]=15.921291;square[13][6]=-26.757672;square[13][7]=9.179909;square[13][8]=-21.157152;square[13][9]=4.357832;square[13][10]=-20.205341;square[13][11]=23.383156;square[13][12]=-45.530680;square[13][13]=24.745748;square[13][14]=-8.686974;square[13][15]=27.576973;square[13][16]=-0.936302;square[13][17]=35.661463;square[13][18]=-1.820180;square[13][19]=11.723290;square[13][20]=-3.891265;square[13][21]=12.042361;square[13][22]=-4.613408;square[13][23]=16.797391;square[13][24]=-4.865204;square[13][25]=18.883319;square[13][26]=-4.952999;square[13][27]=19.610637;square[13][28]=-4.983612;square[13][29]=19.864238;square[14][0]=-6.025795;square[14][1]=15.370604;square[14][2]=-6.954990;square[14][3]=19.636116;square[14][4]=6.141072;square[14][5]=22.633463;square[14][6]=-13.628948;square[14][7]=22.274630;square[14][8]=-28.898389;square[14][9]=9.639888;square[14][10]=-20.199476;square[14][11]=11.399186;square[14][12]=-16.482239;square[14][13]=35.520369;square[14][14]=-32.604244;square[14][15]=29.433482;square[14][16]=-3.767682;square[14][17]=28.080860;square[14][18]=-3.189818;square[14][19]=44.056157;square[14][20]=-5.167305;square[14][21]=26.156332;square[14][22]=-7.012300;square[14][23]=14.885524;square[14][24]=-7.655610;square[14][25]=16.546479;square[14][26]=-7.879919;square[14][27]=18.897920;square[14][28]=-7.958130;square[14][29]=20.267050;square[15][0]=-4.624942;square[15][1]=14.873657;square[15][2]=10.211795;square[15][3]=23.936194;square[15][4]=6.439155;square[15][5]=27.456716;square[15][6]=-14.742159;square[15][7]=19.787349;square[15][8]=-11.693525;square[15][9]=13.756177;square[15][10]=-12.932325;square[15][11]=31.961927;square[15][12]=-23.418734;square[15][13]=30.329965;square[15][14]=3.963749;square[15][15]=28.059129;square[15][16]=4.195697;square[15][17]=49.915086;square[15][18]=-0.303823;square[15][19]=34.079383;square[15][20]=-6.458015;square[15][21]=17.483971;square[15][22]=-8.113665;square[15][23]=17.141220;square[15][24]=-8.690954;square[15][25]=18.578631;square[15][26]=-8.892242;square[15][27]=19.504399;square[15][28]=-8.962427;square[15][29]=20.236705;square[16][0]=-6.125795;square[16][1]=16.805394;square[16][2]=-1.899336;square[16][3]=21.864336;square[16][4]=12.758089;square[16][5]=17.294404;square[16][6]=-22.203957;square[16][7]=14.196032;square[16][8]=-14.935947;square[16][9]=8.991488;square[16][10]=-13.790260;square[16][11]=36.485532;square[16][12]=-48.797809;square[16][13]=28.208053;square[16][14]=-10.790495;square[16][15]=24.841565;square[16][16]=-1.099038;square[16][17]=37.969034;square[16][18]=-5.564536;square[16][19]=31.389080;square[16][20]=-8.601510;square[16][21]=16.066175;square[16][22]=-8.861055;square[16][23]=16.633014;square[16][24]=-8.982533;square[16][25]=18.035793;square[16][26]=-9.123528;square[16][27]=17.899187;square[16][28]=-8.521368;square[16][29]=18.616170;square[17][0]=-5.824942;square[17][1]=15.357534;square[17][2]=2.604402;square[17][3]=19.702771;square[17][4]=-2.354115;square[17][5]=22.963109;square[17][6]=-22.839531;square[17][7]=18.800881;square[17][8]=-15.459121;square[17][9]=1.652962;square[17][10]=-14.318728;square[17][11]=33.272229;square[17][12]=-31.772073;square[17][13]=33.443191;square[17][14]=-10.514785;square[17][15]=25.137448;square[17][16]=-1.600811;square[17][17]=35.309510;square[17][18]=-1.216411;square[17][19]=28.103540;square[17][20]=-6.286030;square[17][21]=13.263039;square[17][22]=-8.053697;square[17][23]=15.718968;square[17][24]=-8.018723;square[17][25]=18.126975;square[17][26]=-8.006528;square[17][27]=19.690816;square[17][28]=-8.002276;square[17][29]=20.543516;square[18][0]=-6.548375;square[18][1]=15.061464;square[18][2]=-8.272593;square[18][3]=20.363815;square[18][4]=17.937460;square[18][5]=20.123309;square[18][6]=-11.712936;square[18][7]=18.873151;square[18][8]=-11.746699;square[18][9]=6.145194;square[18][10]=-15.914329;square[18][11]=36.726125;square[18][12]=-35.902774;square[18][13]=35.030242;square[18][14]=-19.615876;square[18][15]=23.118125;square[18][16]=-4.277537;square[18][17]=36.040723;square[18][18]=-13.616250;square[18][19]=37.746528;square[18][20]=-13.699596;square[18][21]=16.936574;square[18][22]=-10.888797;square[18][23]=16.424247;square[18][24]=-9.658583;square[18][25]=19.024212;square[18][26]=-9.229634;square[18][27]=20.311085;square[18][28]=-8.558365;square[18][29]=20.759790;square[19][0]=-6.168842;square[19][1]=15.264534;square[19][2]=-7.704625;square[19][3]=20.954131;square[19][4]=22.356386;square[19][5]=21.932779;square[19][6]=-15.064042;square[19][7]=16.315090;square[19][8]=-13.252086;square[19][9]=2.691504;square[19][10]=-6.396028;square[19][11]=24.892937;square[19][12]=-26.389481;square[19][13]=32.620213;square[19][14]=-17.346747;square[19][15]=28.777373;square[19][16]=7.679436;square[19][17]=37.860341;square[19][18]=0.399240;square[19][19]=26.131098;square[19][20]=-6.141947;square[19][21]=2.032877;square[19][22]=-8.003459;square[19][23]=7.413470;square[19][24]=-8.381528;square[19][25]=14.717115;square[19][26]=-8.133030;square[19][27]=18.157972;square[19][28]=-8.046385;square[19][29]=19.826284;square[20][0]=-5.513216;square[20][1]=15.626214;square[20][2]=-5.545164;square[20][3]=21.741563;square[20][4]=2.071441;square[20][5]=29.716235;square[20][6]=-36.314015;square[20][7]=27.850007;square[20][8]=-29.720317;square[20][9]=8.384884;square[20][10]=-20.638459;square[20][11]=27.265713;square[20][12]=-36.544555;square[20][13]=31.964320;square[20][14]=1.857413;square[20][15]=32.573997;square[20][16]=10.056682;square[20][17]=54.642572;square[20][18]=3.162822;square[20][19]=31.264712;square[20][20]=-1.280974;square[20][21]=15.824079;square[20][22]=-3.051934;square[20][23]=17.462033;square[20][24]=-2.982390;square[20][25]=19.345119;square[20][26]=-3.563392;square[20][27]=21.074300;square[20][28]=-3.847764;square[20][29]=21.677228;square[21][0]=-6.028011;square[21][1]=15.405364;square[21][2]=-7.863732;square[21][3]=21.554557;square[21][4]=15.015254;square[21][5]=27.805668;square[21][6]=-12.780094;square[21][7]=21.712768;square[21][8]=-12.878692;square[21][9]=8.088662;square[21][10]=-13.837791;square[21][11]=36.010794;square[21][12]=-28.521289;square[21][13]=35.701695;square[21][14]=-26.021683;square[21][15]=29.789749;square[21][16]=-1.852978;square[21][17]=34.564486;square[21][18]=-1.807021;square[21][19]=37.057344;square[21][20]=-5.941616;square[21][21]=18.847036;square[21][22]=-6.902286;square[21][23]=17.702962;square[21][24]=-6.314608;square[21][25]=18.340329;square[21][26]=-6.109697;square[21][27]=19.421309;square[21][28]=-6.038249;square[21][29]=19.798223;square[22][0]=-5.915818;square[22][1]=16.339767;square[22][2]=-3.768253;square[22][3]=25.009864;square[22][4]=33.225282;square[22][5]=27.147443;square[22][6]=-2.793381;square[22][7]=18.710643;square[22][8]=-10.117406;square[22][9]=7.011134;square[22][10]=-7.935013;square[22][11]=18.397073;square[22][12]=-19.764493;square[22][13]=28.734363;square[22][14]=-40.219156;square[22][15]=26.003159;square[22][16]=-5.775697;square[22][17]=35.160335;square[22][18]=-2.333008;square[22][19]=47.804145;square[22][20]=-5.936022;square[22][21]=19.018391;square[22][22]=-7.924419;square[22][23]=18.375942;square[22][24]=-7.973647;square[22][25]=20.433076;square[22][26]=-7.990811;square[22][27]=21.453647;square[22][28]=-7.996796;square[22][29]=21.538499;square[23][0]=-6.125795;square[23][1]=16.017944;square[23][2]=-6.035738;square[23][3]=22.329472;square[23][4]=12.003096;square[23][5]=23.207701;square[23][6]=-20.377076;square[23][7]=23.583897;square[23][8]=-12.819495;square[23][9]=10.719730;square[23][10]=-15.249198;square[23][11]=36.130924;square[23][12]=-36.903051;square[23][13]=35.648307;square[23][14]=-4.408436;square[23][15]=34.574676;square[23][16]=0.225769;square[23][17]=40.107292;square[23][18]=-1.213439;square[23][19]=30.658861;square[23][20]=-5.997692;square[23][21]=16.185275;square[23][22]=-6.689259;square[23][23]=17.175163;square[23][24]=-6.891651;square[23][25]=19.293599;square[23][26]=-6.962221;square[23][27]=20.405015;square[23][28]=-6.986827;square[23][29]=20.892542;square[24][0]=-6.026672;square[24][1]=17.195273;square[24][2]=5.252078;square[24][3]=22.482043;square[24][4]=4.709883;square[24][5]=22.752198;square[24][6]=-23.474722;square[24][7]=18.842920;square[24][8]=-15.322345;square[24][9]=8.252677;square[24][10]=-14.266545;square[24][11]=32.157551;square[24][12]=-41.637050;square[24][13]=26.367089;square[24][14]=-23.909042;square[24][15]=24.405953;square[24][16]=-8.421252;square[24][17]=44.009343;square[24][18]=-3.880048;square[24][19]=32.491094;square[24][20]=-3.958175;square[24][21]=18.561195;square[24][22]=-3.985417;square[24][23]=18.878517;square[24][24]=-3.994915;square[24][25]=20.223863;square[24][26]=-3.998227;square[24][27]=21.950232;square[24][28]=-3.999382;square[24][29]=22.633969;square[25][0]=-5.513216;square[25][1]=16.071088;square[25][2]=5.797388;square[25][3]=22.438982;square[25][4]=3.478405;square[25][5]=18.944902;square[25][6]=-24.253729;square[25][7]=13.224373;square[25][8]=-16.800882;square[25][9]=2.638394;square[25][10]=-15.347292;square[25][11]=22.425928;square[25][12]=-41.235642;square[25][13]=20.406152;square[25][14]=-9.882230;square[25][15]=23.845723;square[25][16]=0.171937;square[25][17]=43.527453;square[25][18]=-1.468670;square[25][19]=25.703167;square[25][20]=-3.850490;square[25][21]=16.480506;square[25][22]=-5.008701;square[25][23]=18.407847;square[25][24]=-5.654355;square[25][25]=19.444851;square[25][26]=-5.879481;square[25][27]=20.457753;square[25][28]=-5.957978;square[25][29]=21.332633;square[26][0]=-6.371911;square[26][1]=16.929784;square[26][2]=-7.892384;square[26][3]=21.826153;square[26][4]=19.707428;square[26][5]=13.170448;square[26][6]=-17.454750;square[26][7]=13.348289;square[26][8]=-19.012177;square[26][9]=4.161823;square[26][10]=-18.200879;square[26][11]=23.116122;square[26][12]=-31.675151;square[26][13]=31.472923;square[26][14]=-4.163167;square[26][15]=27.941576;square[26][16]=11.849203;square[26][17]=38.166483;square[26][18]=5.337519;square[26][19]=31.524669;square[26][20]=-2.249921;square[26][21]=13.278584;square[26][22]=-4.692428;square[26][23]=16.266941;square[26][24]=-5.544078;square[26][25]=19.962264;square[26][26]=-5.841030;square[26][27]=21.289485;square[26][28]=-5.944571;square[26][29]=21.752259;square[27][0]=-6.125795;square[27][1]=15.927067;square[27][2]=9.992640;square[27][3]=25.068403;square[27][4]=18.737458;square[27][5]=24.043794;square[27][6]=-21.444421;square[27][7]=17.274604;square[27][8]=-15.190346;square[27][9]=8.576170;square[27][10]=-11.817271;square[27][11]=29.719383;square[27][12]=-35.042750;square[27][13]=26.489452;square[27][14]=-14.490626;square[27][15]=23.427385;square[27][16]=3.307411;square[27][17]=33.793080;square[27][18]=-3.142733;square[27][19]=40.841344;square[27][20]=-5.957892;square[27][21]=21.187147;square[27][22]=-6.636639;square[27][23]=19.823869;square[27][24]=-6.873304;square[27][25]=19.938587;square[27][26]=-6.955824;square[27][27]=20.078587;square[27][28]=-6.984597;square[27][29]=20.778723;square[28][0]=-5.513216;square[28][1]=16.552716;square[28][2]=2.764588;square[28][3]=31.275132;square[28][4]=26.125636;square[28][5]=35.671119;square[28][6]=-15.385820;square[28][7]=25.761944;square[28][8]=-14.866240;square[28][9]=7.540824;square[28][10]=-15.877806;square[28][11]=28.989253;square[28][12]=-34.473044;square[28][13]=31.192963;square[28][14]=-31.476721;square[28][15]=33.961078;square[28][16]=-0.485698;square[28][17]=37.865837;square[28][18]=1.297608;square[28][19]=41.736913;square[28][20]=-5.069815;square[28][21]=15.793478;square[28][22]=-6.978308;square[28][23]=14.816782;square[28][24]=-7.643758;square[28][25]=18.520445;square[28][26]=-7.354083;square[28][27]=20.135433;square[28][28]=-7.123461;square[28][29]=20.698544;square[29][0]=-5.604092;square[29][1]=16.942249;square[29][2]=-0.468130;square[29][3]=20.731360;square[29][4]=10.877102;square[29][5]=17.065961;square[29][6]=-16.303906;square[29][7]=14.878435;square[29][8]=-10.103425;square[29][9]=10.831196;square[29][10]=-16.820782;square[29][11]=32.188574;square[29][12]=-43.566724;square[29][13]=31.724332;square[29][14]=-3.135653;square[29][15]=26.614838;square[29][16]=6.561848;square[29][17]=36.747806;square[29][18]=-0.996579;square[29][19]=14.376099;square[29][20]=-5.678589;square[29][21]=11.785426;square[29][22]=-7.190574;square[29][23]=16.797373;square[29][24]=-7.717771;square[29][25]=20.185956;square[29][26]=-7.901593;square[29][27]=21.367482;square[29][28]=-7.965687;square[29][29]=21.779455;square[30][0]=-6.068842;square[30][1]=16.808326;square[30][2]=-5.975999;square[30][3]=23.256383;square[30][4]=8.421963;square[30][5]=25.639670;square[30][6]=-20.146650;square[30][7]=19.621512;square[30][8]=-11.569360;square[30][9]=7.881931;square[30][10]=-18.126861;square[30][11]=21.632271;square[30][12]=-27.201829;square[30][13]=29.950241;square[30][14]=-29.691684;square[30][15]=33.126492;square[30][16]=-4.282480;square[30][17]=35.475960;square[30][18]=-6.604371;square[30][19]=46.828025;square[30][20]=-9.299535;square[30][21]=17.464158;square[30][22]=-9.234060;square[30][23]=14.778394;square[30][24]=-9.081612;square[30][25]=17.489275;square[30][26]=-9.028456;square[30][27]=20.002633;square[30][28]=-8.087601;square[30][29]=21.303561;square[31][0]=-5.716285;square[31][1]=16.371716;square[31][2]=2.579728;square[31][3]=18.432529;square[31][4]=11.500830;square[31][5]=18.537276;square[31][6]=-20.434665;square[31][7]=15.495865;square[31][8]=-17.657059;square[31][9]=-0.396364;square[31][10]=-13.635556;square[31][11]=13.992823;square[31][12]=-30.797647;square[31][13]=20.420294;square[31][14]=-29.214477;square[31][15]=20.239028;square[31][16]=4.153313;square[31][17]=30.134345;square[31][18]=0.977133;square[31][19]=45.347636;square[31][20]=-4.011820;square[31][21]=18.555528;square[31][22]=-5.958086;square[31][23]=17.195377;square[31][24]=-6.636707;square[31][25]=18.839326;square[31][26]=-6.873328;square[31][27]=19.695298;square[31][28]=-6.955832;square[31][29]=20.545079;square[32][0]=-6.218113;square[32][1]=16.311694;square[32][2]=11.775181;square[32][3]=22.308013;square[32][4]=-1.802207;square[32][5]=10.726769;square[32][6]=-25.382013;square[32][7]=10.502145;square[32][8]=-17.104755;square[32][9]=6.976997;square[32][10]=-15.000672;square[32][11]=28.774581;square[32][12]=-43.014944;square[32][13]=25.410637;square[32][14]=-11.682322;square[32][15]=31.174152;square[32][16]=5.002471;square[32][17]=40.027747;square[32][18]=0.612967;square[32][19]=27.691070;square[32][20]=-3.194138;square[32][21]=10.956031;square[32][