ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
22]=-5.021656;square[32][23]=14.371453;square[32][24]=-5.658873;square[32][25]=18.568238;square[32][26]=-5.881056;square[32][27]=20.152097;square[32][28]=-5.958527;square[32][29]=20.704354;square[33][0]=-5.616285;square[33][1]=16.430644;square[33][2]=1.248868;square[33][3]=21.331772;square[33][4]=0.392223;square[33][5]=14.790994;square[33][6]=-26.010779;square[33][7]=13.889283;square[33][8]=-16.052832;square[33][9]=2.562319;square[33][10]=-10.974903;square[33][11]=26.393984;square[33][12]=-27.471539;square[33][13]=27.247448;square[33][14]=-10.880535;square[33][15]=25.555378;square[33][16]=1.397377;square[33][17]=39.627120;square[33][18]=-1.494969;square[33][19]=25.787143;square[33][20]=-7.693024;square[33][21]=12.230605;square[33][22]=-9.095607;square[33][23]=15.714231;square[33][24]=-9.033336;square[33][25]=19.000803;square[33][26]=-9.011624;square[33][27]=20.954245;square[33][28]=-8.482350;square[33][29]=21.635368;square[34][0]=-6.269816;square[34][1]=16.240644;square[34][2]=-1.137639;square[34][3]=22.755801;square[34][4]=12.662878;square[34][5]=23.992333;square[34][6]=-20.597087;square[34][7]=18.490078;square[34][8]=-17.940216;square[34][9]=5.345192;square[34][10]=-17.066855;square[34][11]=28.069845;square[34][12]=-40.116598;square[34][13]=24.753204;square[34][14]=-32.909885;square[34][15]=25.389235;square[34][16]=-6.355645;square[34][17]=32.998189;square[34][18]=-4.796740;square[34][19]=35.673738;square[34][20]=-6.059855;square[34][21]=12.947615;square[34][22]=-6.572192;square[34][23]=14.031912;square[34][24]=-6.199511;square[34][25]=17.750696;square[34][26]=-6.682145;square[34][27]=19.828296;square[34][28]=-6.889171;square[34][29]=20.591452;square[35][0]=-5.935795;square[35][1]=15.737067;square[35][2]=16.886006;square[35][3]=25.290347;square[35][4]=-0.218538;square[35][5]=25.646236;square[35][6]=-18.558127;square[35][7]=16.474229;square[35][8]=-18.759563;square[35][9]=5.990094;square[35][10]=-16.853996;square[35][11]=27.918046;square[35][12]=-45.857131;square[35][13]=27.538038;square[35][14]=-21.783547;square[35][15]=22.108255;square[35][16]=-6.129062;square[35][17]=45.253914;square[35][18]=-3.836638;square[35][19]=33.967692;square[35][20]=-4.214039;square[35][21]=19.805178;square[35][22]=-4.725952;square[35][23]=19.377877;square[35][24]=-4.904445;square[35][25]=20.352612;square[35][26]=-4.966682;square[35][27]=20.774270;square[35][28]=-4.988383;square[35][29]=20.921293;square[36][0]=-7.294877;square[36][1]=16.286623;square[36][2]=2.683316;square[36][3]=22.523155;square[36][4]=25.216383;square[36][5]=26.980154;square[36][6]=-18.134148;square[36][7]=24.039196;square[36][8]=-15.519315;square[36][9]=12.840864;square[36][10]=-13.348512;square[36][11]=26.685123;square[36][12]=-24.865259;square[36][13]=27.219442;square[36][14]=-19.985131;square[36][15]=23.887085;square[36][16]=7.399614;square[36][17]=31.730432;square[36][18]=4.770162;square[36][19]=36.718457;square[36][20]=-3.353610;square[36][21]=14.620163;square[36][22]=-6.379904;square[36][23]=13.846904;square[36][24]=-7.435107;square[36][25]=17.421636;square[36][26]=-7.803034;square[36][27]=19.100980;square[36][28]=-7.931322;square[36][29]=19.686531;square[37][0]=-5.513216;square[37][1]=15.314488;square[37][2]=13.366702;square[37][3]=19.796058;square[37][4]=12.111718;square[37][5]=20.336178;square[37][6]=-28.796848;square[37][7]=18.013187;square[37][8]=-25.541188;square[37][9]=-2.066947;square[37][10]=-22.973967;square[37][11]=13.373361;square[37][12]=-23.461156;square[37][13]=20.981894;square[37][14]=-40.875075;square[37][15]=19.290208;square[37][16]=8.842752;square[37][17]=25.747899;square[37][18]=9.413734;square[37][19]=45.299728;square[37][20]=4.234265;square[37][21]=18.565780;square[37][22]=-1.780211;square[37][23]=12.745226;square[37][24]=-3.877329;square[37][25]=15.816650;square[37][26]=-4.608549;square[37][27]=18.092123;square[37][28]=-4.863509;square[37][29]=19.986086;square[38][0]=-5.657236;square[38][1]=15.401555;square[38][2]=9.582529;square[38][3]=17.094327;square[38][4]=-11.058439;square[38][5]=11.591671;square[38][6]=-29.048934;square[38][7]=8.629664;square[38][8]=-20.776279;square[38][9]=2.071091;square[38][10]=-18.014570;square[38][11]=29.653338;square[38][12]=-38.837076;square[38][13]=34.878993;square[38][14]=-20.952893;square[38][15]=34.321177;square[38][16]=4.797399;square[38][17]=38.134162;square[38][18]=-6.065566;square[38][19]=33.345262;square[38][20]=-11.029680;square[38][21]=14.463069;square[38][22]=-10.015127;square[38][23]=15.057792;square[38][24]=-9.353953;square[38][25]=17.586695;square[38][26]=-8.510836;square[38][27]=18.507211;square[38][28]=-5.727800;square[38][29]=17.569093;square[39][0]=-6.289402;square[39][1]=14.016811;square[39][2]=-5.859973;square[39][3]=18.726434;square[39][4]=16.057697;square[39][5]=21.051865;square[39][6]=-18.844027;square[39][7]=19.080841;square[39][8]=-17.044384;square[39][9]=5.575983;square[39][10]=-16.739592;square[39][11]=24.693056;square[39][12]=-25.433819;square[39][13]=32.045466;square[39][14]=-37.076794;square[39][15]=26.930377;square[39][16]=3.282509;square[39][17]=33.227901;square[39][18]=6.658231;square[39][19]=50.516633;square[39][20]=0.390743;square[39][21]=27.113261;square[39][22]=-3.771686;square[39][23]=20.846774;square[39][24]=-5.223035;square[39][25]=20.213463;square[39][26]=-5.729089;square[39][27]=20.074430;square[39][28]=-5.905539;square[39][29]=20.025952;
  #endif
}
void fill_matrix_triangle(){
  #ifdef TRAINING
