ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
  triangle[0][0]=-5.556262;triangle[0][1]=15.357534;triangle[0][2]=-2.604831;triangle[0][3]=17.173349;triangle[0][4]=13.465347;triangle[0][5]=-5.780742;triangle[0][6]=-14.620628;triangle[0][7]=19.983417;triangle[0][8]=-27.713552;triangle[0][9]=31.258031;triangle[0][10]=-31.530247;triangle[0][11]=30.708467;triangle[0][12]=8.009335;triangle[0][13]=30.844769;triangle[0][14]=12.872251;triangle[0][15]=48.161278;triangle[0][16]=-5.777360;triangle[0][17]=35.958423;triangle[0][18]=-20.657010;triangle[0][19]=11.110685;triangle[0][20]=-15.539658;triangle[0][21]=13.183993;triangle[0][22]=-10.710705;triangle[0][23]=17.251975;triangle[0][24]=-8.945164;triangle[0][25]=19.451333;triangle[0][26]=-8.329558;triangle[0][27]=20.460013;triangle[0][28]=-8.114910;triangle[0][29]=21.463040;triangle[1][0]=-4.900636;triangle[1][1]=15.405364;triangle[1][2]=-5.590789;triangle[1][3]=20.326027;triangle[1][4]=5.699889;triangle[1][5]=11.095366;triangle[1][6]=8.424461;triangle[1][7]=8.112746;triangle[1][8]=-13.836118;triangle[1][9]=33.407908;triangle[1][10]=-38.259015;triangle[1][11]=36.642663;triangle[1][12]=-43.255325;triangle[1][13]=34.990533;triangle[1][14]=4.484899;triangle[1][15]=37.074601;triangle[1][16]=15.112454;triangle[1][17]=48.386792;triangle[1][18]=-2.974680;triangle[1][19]=33.617313;triangle[1][20]=-16.142383;triangle[1][21]=12.719436;triangle[1][22]=-12.852862;triangle[1][23]=15.940706;triangle[1][24]=-9.465341;triangle[1][25]=19.679833;triangle[1][26]=-7.859611;triangle[1][27]=22.454909;triangle[1][28]=-7.299728;triangle[1][29]=23.805160;triangle[2][0]=-5.716285;triangle[2][1]=17.755682;triangle[2][2]=-5.125238;triangle[2][3]=19.436989;triangle[2][4]=6.159397;triangle[2][5]=7.819762;triangle[2][6]=-7.489072;triangle[2][7]=16.042860;triangle[2][8]=-26.097588;triangle[2][9]=39.803884;triangle[2][10]=-45.332161;triangle[2][11]=32.731247;triangle[2][12]=-7.942079;triangle[2][13]=19.711734;triangle[2][14]=18.620422;triangle[2][15]=28.138591;triangle[2][16]=17.069574;triangle[2][17]=43.840280;triangle[2][18]=-2.774680;triangle[2][19]=17.979959;triangle[2][20]=-10.727649;triangle[2][21]=12.218477;triangle[2][22]=-9.469901;triangle[2][23]=16.883816;triangle[2][24]=-8.512523;triangle[2][25]=19.908675;triangle[2][26]=-8.178706;triangle[2][27]=22.184233;triangle[2][28]=-7.449731;triangle[2][29]=23.637881;triangle[3][0]=-5.323216;triangle[3][1]=17.149294;triangle[3][2]=-3.471694;triangle[3][3]=23.432961;triangle[3][4]=2.247782;triangle[3][5]=15.047677;triangle[3][6]=-16.908743;triangle[3][7]=25.228693;triangle[3][8]=-26.978230;triangle[3][9]=31.723113;triangle[3][10]=-36.816301;triangle[3][11]=31.683999;triangle[3][12]=4.437212;triangle[3][13]=35.917675;triangle[3][14]=16.814801;triangle[3][15]=47.856370;triangle[3][16]=10.503519;triangle[3][17]=38.907766;triangle[3][18]=-2.810175;triangle[3][19]=17.935916;triangle[3][20]=-6.570741;triangle[3][21]=18.298154;triangle[3][22]=-7.501648;triangle[3][23]=20.730885;triangle[3][24]=-7.826236;triangle[3][25]=22.398809;triangle[3][26]=-7.939412;triangle[3][27]=23.441699;triangle[3][28]=-7.978874;triangle[3][29]=23.805333;triangle[4][0]=-6.216672;triangle[4][1]=19.123888;triangle[4][2]=-3.054120;triangle[4][3]=25.707904;triangle[4][4]=16.955304;triangle[4][5]=10.810616;triangle[4][6]=-6.288007;triangle[4][7]=28.108890;triangle[4][8]=-27.591434;triangle[4][9]=38.860552;triangle[4][10]=-20.512064;triangle[4][11]=31.754452;triangle[4][12]=13.291632;triangle[4][13]=31.903362;triangle[4][14]=20.288386;triangle[4][15]=46.921391;triangle[4][16]=11.475575;triangle[4][17]=37.674003;triangle[4][18]=-2.599512;triangle[4][19]=16.106753;triangle[4][20]=-6.116966;triangle[4][21]=16.487659;triangle[4][22]=-7.243427;triangle[4][23]=20.039224;triangle[4][24]=-7.084878;triangle[4][25]=21.784879;triangle[4][26]=-7.029595;triangle[4][27]=22.576313;triangle[4][28]=-7.010319;triangle[4][29]=22.852270;triangle[5][0]=-5.445285;triangle[5][1]=18.453475;triangle[5][2]=-3.779907;triangle[5][3]=13.477156;triangle[5][4]=5.893466;triangle[5][5]=8.112871;triangle[5][6]=-14.661351;triangle[5][7]=25.420242;triangle[5][8]=-40.497905;triangle[5][9]=37.257967;triangle[5][10]=-39.119215;triangle[5][11]=31.419992;triangle[5][12]=3.270520;triangle[5][13]=25.923420;triangle[5][14]=11.918876;triangle[5][15]=38.484827;triangle[5][16]=0.618249;triangle[5][17]=26.920270;triangle[5][18]=-13.330855;triangle[5][19]=10.949926;triangle[5][20]=-11.546121;triangle[5][21]=15.120646;triangle[5][22]=-8.767897;triangle[5][23]=20.062318;triangle[5][24]=-7.616428;triangle[5][25]=22.627015;triangle[5][26]=-7.214935;triangle[5][27]=23.521270;triangle[5][28]=-7.074943;triangle[5][29]=23.833077;triangle[6][0]=-5.647139;triangle[6][1]=17.554829;triangle[6][2]=-1.390705;triangle[6][3]=18.395210;triangle[6][4]=6.391166;triangle[6][5]=4.794507;triangle[6][6]=-12.532568;triangle[6][7]=29.400451;triangle[6][8]=-29.720461;triangle[6][9]=39.385511;triangle[6][10]=-38.194775;triangle[6][11]=28.213354;triangle[6][12]=1.577520;triangle[6][13]=32.084885;triangle[6][14]=12.798482;triangle[6][15]=44.562282;triangle[6][16]=1.487403;triangle[6][17]=29.774587;triangle[6][18]=-10.380103;triangle[6][19]=14.383584;triangle[6][20]=-9.784506;triangle[6][21]=17.981853;triangle[6][22]=-9.273540;triangle[6][23]=21.637051;triangle[6][24]=-8.573674;triangle[6][25]=23.176091;triangle[6][26]=-8.200028;triangle[6][27]=23.712721;triangle[6][28]=-8.069745;triangle[6][29]=23.899832;triangle[7][0]=-5.513216;triangle[7][1]=17.152226;triangle[7][2]=-4.270910;triangle[7][3]=16.229762;triangle[7][4]=-0.139888;triangle[7][5]=9.965607;triangle[7][6]=-13.885663;triangle[7][7]=29.596009;triangle[7][8]=-40.302090;triangle[7][9]=38.746378;triangle[7][10]=-46.894604;triangle[7][11]=30.777384;triangle[7][12]=-3.841999;triangle[7][13]=27.026881;triangle[7][14]=8.373731;triangle[7][15]=40.508574;triangle[7][16]=3.861042;triangle[7][17]=31.927527;triangle[7][18]=-15.068394;triangle[7][19]=13.592688;triangle[7][20]=-13.591028;triangle[7][21]=15.821590;triangle[7][22]=-10.368535;triangle[7][23]=19.763933;triangle[7][24]=-8.825857;triangle[7][25]=21.220332;triangle[7][26]=-8.287959;triangle[7][27]=22.249850;triangle[7][28]=-8.000405;triangle[7][29]=23.260142;triangle[8][0]=-5.513216;triangle[8][1]=17.095273;triangle[8][2]=-0.657803;triangle[8][3]=26.150457;triangle[8][4]=9.884485;triangle[8][5]=15.859338;triangle[8][6]=-4.353103;triangle[8][7]=14.456414;triangle[8][8]=-37.815428;triangle[8][9]=27.752227;triangle[8][10]=-43.070426;triangle[8][11]=32.212349;triangle[8][12]=4.456406;triangle[8][13]=31.652965;triangle[8][14]=13.350580;triangle[8][15]=44.823279;triangle[8][16]=5.336666;triangle[8][17]=32.139846;triangle[8][18]=-8.833367;triangle[8][19]=13.217752;triangle[8][20]=-9.577880;triangle[8][21]=16.152968;triangle[8][22]=-9.148350;triangle[8][23]=19.739761;triangle[8][24]=-9.051727;triangle[8][25]=21.924483;triangle[8][26]=-8.918036;triangle[8][27]=23.276312;triangle[8][28]=-8.320099;triangle[8][29]=23.747666;triangle[9][0]=-5.659332;triangle[9][1]=17.187123;triangle[9][2]=3.034028;triangle[9][3]=14.933127;triangle[9][4]=6.072108;triangle[9][5]=6.076274;triangle[9][6]=-29.117978;triangle[9][7]=26.931995;triangle[9][8]=-53.713699;triangle[9][9]=27.912483;triangle[9][10]=-40.497520;triangle[9][11]=22.620969;triangle[9][12]=-1.213568;triangle[9][13]=38.261355;triangle[9][14]=13.097083;triangle[9][15]=43.440079;triangle[9][16]=-6.656111;triangle[9][17]=17.250398;triangle[9][18]=-11.247910;triangle[9][19]=13.078732;triangle[9][20]=-9.594586;triangle[9][21]=17.336554;triangle[9][22]=-8.555998;triangle[9][23]=20.109406;triangle[9][24]=-8.193864;triangle[9][25]=21.611790;triangle[9][26]=-8.067596;triangle[9][27]=22.705961;triangle[9][28]=-8.023569;triangle[9][29]=23.548797;triangle[10][0]=-4.900636;triangle[10][1]=15.927067;triangle[10][2]=-1.487491;triangle[10][3]=18.242312;triangle[10][4]=-0.025679;triangle[10][5]=10.245109;triangle[10][6]=-9.777235;triangle[10][7]=24.073462;triangle[10][8]=-23.535617;triangle[10][9]=35.184709;triangle[10][10]=-44.772387;triangle[10][11]=26.966014;triangle[10][12]=-7.849391;triangle[10][13]=26.694545;triangle[10][14]=8.909931;triangle[10][15]=43.909012;triangle[10][16]=-3.794672;triangle[10][17]=49.141998;triangle[10][18]=-23.932554;triangle[10][19]=13.633314;triangle[10][20]=-19.490349;triangle[10][21]=13.200850;triangle[10][22]=-12.907908;triangle[10][23]=17.460923;triangle[10][24]=-10.362603;triangle[10][25]=19.766000;triangle[10][26]=-9.285110;triangle[10][27]=21.091434;triangle[10][28]=-7.835511;triangle[10][29]=21.683203;triangle[11][0]=-4.900636;triangle[11][1]=17.195273;triangle[11][2]=1.290657;triangle[11][3]=16.674708;triangle[11][4]=6.510212;triangle[11][5]=5.062271;triangle[11][6]=-18.690788;triangle[11][7]=25.785603;triangle[11][8]=-39.995565;triangle[11][9]=31.283187;triangle[11][10]=-35.753604;triangle[11][11]=25.246374;triangle[11][12]=5.273072;triangle[11][13]=28.455183;triangle[11][14]=14.898918;triangle[11][15]=48.355861;triangle[11][16]=-4.122759;triangle[11][17]=35.905222;triangle[11][18]=-16.226008;triangle[11][19]=17.554410;triangle[11][20]=-13.225920;triangle[11][21]=18.258001;triangle[11][22]=-10.312350;triangle[11][23]=20.526885;triangle[11][24]=-8.806266;triangle[11][25]=21.486357;triangle[11][26]=-8.010128;triangle[11][27]=22.010904;triangle[11][28]=-6.700888;triangle[11][29]=22.655123;triangle[12][0]=-5.103706;triangle[12][1]=16.876639;triangle[12][2]=1.381717;triangle[12][3]=18.615460;triangle[12][4]=3.533240;triangle[12][5]=8.072603;triangle[12][6]=-16.416085;triangle[12][7]=29.152317;triangle[12][8]=-41.642683;triangle[12][9]=34.508701;triangle[12][10]=-17.454611;triangle[12][11]=35.560314;triangle[12][12]=18.352244;triangle[12][13]=34.638036;triangle[12][14]=22.303764;triangle[12][15]=43.831600;triangle[12][16]=0.394652;triangle[12][17]=24.744451;triangle[12][18]=-7.840164;triangle[12][19]=18.055222;triangle[12][20]=-8.907971;triangle[12][21]=20.468377;triangle[12][22]=-8.967912;triangle[12][23]=22.526788;triangle[12][24]=-8.988811;triangle[12][25]=23.486323;triangle[12][26]=-8.896099;triangle[12][27]=23.820892;triangle[12][28]=-7.902940;triangle[12][29]=23.937549;triangle[13][0]=-4.900636;triangle[13][1]=17.152226;triangle[13][2]=-6.919319;triangle[13][3]=24.217615;triangle[13][4]=-7.623190;triangle[13][5]=26.029842;triangle[13][6]=-7.868614;triangle[13][7]=26.661727;triangle[13][8]=-0.587446;triangle[13][9]=16.631138;triangle[13][10]=0.687483;triangle[13][11]=14.675872;triangle[13][12]=-14.425487;triangle[13][13]=42.294403;triangle[13][14]=-34.986744;triangle[13][15]=35.514774;triangle[13][16]=-5.093524;triangle[13][17]=29.432934;triangle[13][18]=10.821889;triangle[13][19]=42.854681;triangle[13][20]=2.880151;triangle[13][21]=42.235174;triangle[13][22]=-9.722391;triangle[13][23]=17.178788;triangle[13][24]=-9.555175;triangle[13][25]=17.253774;triangle[13][26]=-8.624045;triangle[13][27]=20.814985;triangle[13][28]=-8.217591;triangle[13][29]=22.889454;triangle[14][0]=-4.900636;triangle[14][1]=17.764806;triangle[14][2]=-2.834333;triangle[14][3]=20.622334;triangle[14][4]=7.503402;triangle[14][5]=8.260943;triangle[14][6]=-7.116313;triangle[14][7]=18.799152;triangle[14][8]=-26.930273;triangle[14][9]=29.007228;triangle[14][10]=-25.357140;triangle[14][11]=23.121488;triangle[14][12]=-2.336912;triangle[14][13]=26.704013;triangle[14][14]=2.510724;triangle[14][15]=44.856853;triangle[14][16]=-5.636662;triangle[14][17]=29.268546;triangle[14][18]=-10.693917;triangle[14][19]=17.804753;triangle[14][20]=-10.223743;triangle[14][21]=20.857706;triangle[14][22]=-8.904990;triangle[14][23]=22.904350;triangle[14][24]=-7.664229;triangle[14][25]=23.617970;triangle[14][26]=-7.231602;triangle[14][27]=23.866795;triangle[14][28]=-7.080755;triangle[14][29]=24.297454;triangle[15][0]=-5.935795;triangle[15][1]=16.536714;triangle[15][2]=-0.780567;triangle[15][3]=12.873898;triangle[15][4]=3.992125;triangle[15][5]=6.107852;triangle[15][6]=-15.303996;triangle[15][7]=28.267839;triangle[15][8]=-41.799519;triangle[15][9]=32.621963;triangle[15][10]=-27.004861;triangle[15][11]=30.340899;triangle[15][12]=5.053357;triangle[15][13]=40.731740;triangle[15][14]=10.417920;triangle[15][15]=49.346951;triangle[15][16]=-5.285886;triangle[15][17]=15.228756;triangle[15][18]=-8.388583;triangle[15][19]=13.574384;triangle[15][20]=-8.377302;triangle[15][21]=18.629258;triangle[15][22]=-8.131557;triangle[15][23]=21.814957;triangle[15][24]=-7.394550;triangle[15][25]=23.238123;triangle[15][26]=-7.137571;triangle[15][27]=23.734350;triangle[15][28]=-7.569671;triangle[15][29]=25.602101;triangle[16][0]=-5.212362;triangle[16][1]=17.617853;triangle[16][2]=-5.904111;triangle[16][3]=22.945559;triangle[16][4]=12.922350;triangle[16][5]=14.294840;triangle[16][6]=-5.813218;triangle[16][7]=33.616509;triangle[16][8]=-26.023503;triangle[16][9]=40.112631;triangle[16][10]=-29.995478;triangle[16][11]=27.856805;triangle[16][12]=6.430310;triangle[16][13]=30.678426;triangle[16][14]=11.979848;triangle[16][15]=45.963146;triangle[16][16]=2.700537;triangle[16][17]=30.130133;triangle[16][18]=-9.685043;triangle[16][19]=12.627240;triangle[16][20]=-9.702176;triangle[16][21]=16.128069;triangle[16][22]=-8.900934;triangle[16][23]=19.952584;triangle[16][24]=-8.314136;triangle[16][25]=21.630010;triangle[16][26]=-8.109532;triangle[16][27]=23.234894;triangle[16][28]=-8.038192;triangle[16][29]=24.384545;triangle[17][0]=-5.824942;triangle[17][1]=17.430170;triangle[17][2]=-2.612646;triangle[17][3]=27.069392;triangle[17][4]=8.992442;triangle[17][5]=14.477960;triangle[17][6]=-14.829769;triangle[17][7]=23.932561;triangle[17][8]=-37.132020;triangle[17][9]=30.792426;triangle[17][10]=-36.405774;triangle[17][11]=32.502126;triangle[17][12]=3.368719;triangle[17][13]=39.122820;triangle[17][14]=7.041241;triangle[17][15]=45.682089;triangle[17][16]=-7.517656;triangle[17][17]=27.021507;triangle[17][18]=-18.024310;triangle[17][19]=11.480192;triangle[17][20]=-14.060370;triangle[17][21]=15.666860;triangle[17][22]=-10.664442;triangle[17][23]=18.957687;triangle[17][24]=-8.277712;triangle[17][25]=20.387889;triangle[17][26]=-7.445511;triangle[17][27]=22.007425;triangle[17][28]=-7.155340;triangle[17][29]=23.122469;triangle[18][0]=-5.897842;triangle[18][1]=17.446172;triangle[18][2]=-5.473912;triangle[18][3]=21.944946;triangle[18][4]=7.936118;triangle[18][5]=7.724650;triangle[18][6]=-11.229940;triangle[18][7]=19.242841;triangle[18][8]=-31.200398;triangle[18][9]=35.312697;triangle[18][10]=-48.974169;triangle[18][11]=28.721128;triangle[18][12]=-5.107145;triangle[18][13]=23.422344;triangle[18][14]=7.491142;triangle[18][15]=32.077530;triangle[18][16]=3.221562;triangle[18][17]=38.061621;triangle[18][18]=-11.958617;triangle[18][19]=15.447095;triangle[18][20]=-13.899359;triangle[18][21]=16.429439;triangle[18][22]=-10.360273;triangle[18][23]=20.396606;triangle[18][24]=-8.822976;triangle[18][25]=22.092253;triangle[18][26]=-8.286954;triangle[18][27]=22.683488;triangle[18][28]=-8.100055;triangle[18][29]=22.889639;triangle[19][0]=-4.900636;triangle[19][1]=17.764806;triangle[19][2]=-4.216117;triangle[19][3]=9.388961;triangle[19][4]=8.369251;triangle[19][5]=-10.738762;triangle[19][6]=-13.110785;triangle[19][7]=17.804140;triangle[19][8]=-36.407384;triangle[19][9]=32.385901;triangle[19][10]=-24.555031;triangle[19][11]=28.399772;triangle[19][12]=17.085887;triangle[19][13]=32.210592;triangle[19][14]=23.564877;triangle[19][15]=46.033349;triangle[19][16]=2.424182;triangle[19][17]=27.450139;triangle[19][18]=-15.402099;triangle[19][19]=11.957972;triangle[19][20]=-13.707383;triangle[19][21]=15.472130;triangle[19][22]=-11.192685;triangle[19][23]=19.482061;triangle[19][24]=-9.113220;triangle[19][25]=21.122049;triangle[19][26]=-8.388156;triangle[19][27]=22.215580;triangle[19][28]=-7.791442;triangle[19][29]=23.296023;triangle[20][0]=-4.900636;triangle[20][1]=17.420906;triangle[20][2]=-4.977997;triangle[20][3]=24.840788;triangle[20][4]=5.223910;triangle[20][5]=15.032287;triangle[20][6]=-16.956918;triangle[20][7]=26.932292;triangle[20][8]=-36.183347;triangle[20][9]=35.272336;triangle[20][10]=-45.172983;triangle[20][11]=25.004440;triangle[20][12]=-5.649666;triangle[20][13]=26.604624;triangle[20][14]=2.396716;triangle[20][15]=35.998769;triangle[20][16]=-4.341360;triangle[20][17]=20.700194;triangle[20][18]=-13.940578;triangle[20][19]=6.798626;triangle[20][20]=-12.517277;triangle[20][21]=12.575037;triangle[20][22]=-10.012117;triangle[20][23]=18.030893;triangle[20][24]=-8.701582;triangle[20][25]=20.806058;triangle[20][26]=-8.244626;triangle[20][27]=22.235020;triangle[20][28]=-8.085296;triangle[20][29]=23.254971;triangle[21][0]=-5.513216;triangle[21][1]=17.196247;triangle[21][2]=-2.131425;triangle[21][3]=12.349633;triangle[21][4]=6.248511;triangle[21][5]=5.752436;triangle[21][6]=-19.348438;triangle[21][7]=40.876763;triangle[21][8]=-43.618927;triangle[21][9]=39.768082;triangle[21][10]=-37.243259;triangle[21][11]=28.601528;triangle[21][12]=-1.137708;triangle[21][13]=30.533930;triangle[21][14]=17.068878;triangle[21][15]=46.145465;triangle[21][16]=1.440493;triangle[21][17]=22.579043;triangle[21][18]=-9.884854;triangle[21][19]=9.703209;triangle[21][20]=-9.519937;triangle[21][21]=14.685943;triangle[21][22]=-9.181291;triangle[21][23]=19.449746;triangle[21][24]=-9.063212;triangle[21][25]=21.210781;triangle[21][26]=-8.612531;triangle[21][27]=22.376138;triangle[21][28]=-8.213576;triangle[21][29]=22.782473;triangle[22][0]=-4.900636;triangle[22][1]=16.808326;triangle[22][2]=-6.919319;triangle[22][3]=23.446383;triangle[22][4]=-7.623190;triangle[22][5]=25.570930;triangle[22][6]=-7.868614;triangle[22][7]=25.850393;triangle[22][8]=-3.794617;triangle[22][9]=18.562050;triangle[22][10]=0.102065;triangle[22][11]=11.209945;triangle[22][12]=-15.322680;triangle[22][13]=29.432609;triangle[22][14]=-31.634315;triangle[22][15]=26.397309;triangle[22][16]=-1.171754;triangle[22][17]=30.290016;triangle[22][18]=12.597279;triangle[22][19]=47.758800;triangle[22][20]=0.259907;triangle[22][21]=32.061559;triangle[22][22]=-11.521658;triangle[22][23]=15.087383;triangle[22][24]=-10.212160;triangle[22][25]=17.846606;triangle[22][26]=-8.771332;triangle[22][27]=20.470012;triangle[22][28]=-8.268947;triangle[22][29]=21.466526;triangle[23][0]=-5.556262;triangle[23][1]=18.033485;triangle[23][2]=-6.940684;triangle[23][3]=23.919733;triangle[23][4]=4.054707;triangle[23][5]=7.260134;triangle[23][6]=0.004444;triangle[23][7]=11.362452;triangle[23][8]=-18.883910;triangle[23][9]=27.263815;triangle[23][10]=-34.205640;triangle[23][11]=25.267186;triangle[23][12]=-4.850126;triangle[23][13]=16.528584;triangle[23][14]=12.486379;triangle[23][15]=33.277253;triangle[23][16]=13.949563;triangle[23][17]=41.838463;triangle[23][18]=-8.303883;triangle[23][19]=16.947150;triangle[23][20]=-9.161002;triangle[23][21]=15.984357;triangle[23][22]=-8.404817;triangle[23][23]=20.303647;triangle[23][24]=-8.141151;triangle[23][25]=22.059840;triangle[23][26]=-8.049216;triangle[23][27]=23.241719;triangle[23][28]=-8.017161;triangle[23][29]=23.735604;triangle[24][0]=-5.700283;triangle[24][1]=16.952347;triangle[24][2]=-7.849460;triangle[24][3]=23.496600;triangle[24][4]=-1.575224;triangle[24][5]=19.879198;triangle[24][6]=3.101893;triangle[24][7]=9.737546;triangle[24][8]=-15.759203;triangle[24][9]=38.146761;triangle[24][10]=-35.260347;triangle[24][11]=36.714578;triangle[24][12]=-16.472144;triangle[24][13]=25.474505;triangle[24][14]=9.167181;triangle[24][15]=25.060312;triangle[24][16]=11.409354;triangle[24][17]=41.624262;triangle[24][18]=-5.587972;triangle[24][19]=32.698326;triangle[24][20]=-13.322714;triangle[24][21]=18.024510;triangle[24][22]=-10.927952;triangle[24][23]=19.154237;triangle[24][24]=-9.020914;triangle[24][25]=20.878125;triangle[24][26]=-8.355971;triangle[24][27]=22.221406;triangle[24][28]=-8.124119;triangle[24][29]=22.728521;triangle[25][0]=-6.168842;triangle[25][1]=17.243103;triangle[25][2]=-8.051578;triangle[25][3]=24.249302;triangle[25][4]=4.090709;triangle[25][5]=13.230980;triangle[25][6]=-5.028477;triangle[25][7]=19.799385;triangle[25][8]=-33.219010;triangle[25][9]=41.887787;triangle[25][10]=-50.603603;triangle[25][11]=35.535771;triangle[25][12]=-8.777358;triangle[25][13]=29.473123;triangle[25][14]=3.343928;triangle[25][15]=35.492343;triangle[25][16]=-2.138574;triangle[25][17]=41.577840;triangle[25][18]=-17.703390;triangle[25][19]=16.170156;triangle[25][20]=-17.135611;triangle[25][21]=14.200374;triangle[25][22]=-12.086862;triangle[25][23]=17.927526;triangle[25][24]=-10.076322;triangle[25][25]=19.928694;triangle[25][26]=-8.965780;triangle[25][27]=21.277780;triangle[25][28]=-8.146747;triangle[25][29]=21.748178;triangle[26][0]=-4.900636;triangle[26][1]=17.243103;triangle[26][2]=0.981109;triangle[26][3]=5.343951;triangle[26][4]=-1.125669;triangle[26][5]=3.836630;triangle[26][6]=-24.818587;triangle[26][7]=35.184937;triangle[26][8]=-50.397390;triangle[26][9]=31.757721;triangle[26][10]=-9.585741;triangle[26][11]=23.471310;triangle[26][12]=13.242527;triangle[26][13]=40.124947;triangle[26][14]=3.141045;triangle[26][15]=29.630873;triangle[26][16]=-11.833098;triangle[26][17]=13.105896;triangle[26][18]=-10.597223;triangle[26][19]=16.062708;triangle[26][20]=-8.905596;triangle[26][21]=19.891052;triangle[26][22]=-8.315762;triangle[26][23]=21.915977;triangle[26][24]=-8.110099;triangle[26][25]=22.622025;triangle[26][26]=-8.038389;triangle[26][27]=23.519530;triangle[26][28]=-8.013386;triangle[26][29]=23.832470;triangle[27][0]=-6.125795;triangle[27][1]=17.152226;triangle[27][2]=-5.312136;triangle[27][3]=20.101012;triangle[27][4]=10.355836;triangle[27][5]=1.673467;triangle[27][6]=-13.798050;triangle[27][7]=21.301809;triangle[27][8]=-43.402216;triangle[27][9]=35.031163;triangle[27][10]=-27.407235;triangle[27][11]=24.474892;triangle[27][12]=8.028668;triangle[27][13]=37.280463;triangle[27][14]=12.181677;triangle[27][15]=48.425871;triangle[27][16]=-6.850810;triangle[27][17]=23.954341;triangle[27][18]=-9.956990;triangle[27][19]=19.917436;triangle[27][20]=-8.151570;triangle[27][21]=21.488136;triangle[27][22]=-8.052849;triangle[27][23]=23.124167;triangle[27][24]=-8.018427;triangle[27][25]=23.694616;triangle[27][26]=-8.006425;triangle[27][27]=23.893519;triangle[27][28]=-7.480537;triangle[27][29]=24.484576;triangle[28][0]=-4.900636;triangle[28][1]=16.808326;triangle[28][2]=-6.919319;triangle[28][3]=23.446383;triangle[28][4]=2.235962;triangle[28][5]=15.597694;triangle[28][6]=2.292142;triangle[28][7]=12.558368;triangle[28][8]=-26.133279;triangle[28][9]=44.371277;triangle[28][10]=-43.132893;triangle[28][11]=40.449009;triangle[28][12]=-5.586719;triangle[28][13]=31.550042;triangle[28][14]=11.198894;triangle[28][15]=37.208328;triangle[28][16]=1.942374;triangle[28][17]=29.820824;triangle[28][18]=-9.093588;triangle[28][19]=15.748808;triangle[28][20]=-9.442804;triangle[28][21]=17.989319;triangle[28][22]=-9.154396;triangle[28][23]=20.418799;triangle[28][24]=-9.053835;triangle[28][25]=21.448669;triangle[28][26]=-9.018771;triangle[28][27]=21.807763;triangle[28][28]=-8.537986;triangle[28][29]=21.932971;triangle[29][0]=-5.604092;triangle[29][1]=18.865081;triangle[29][2]=-6.975387;triangle[29][3]=25.556172;triangle[29][4]=8.043245;triangle[29][5]=11.623890;triangle[29][6]=-2.073450;triangle[29][7]=5.165438;triangle[29][8]=-23.734616;triangle[29][9]=30.096044;triangle[29][10]=-41.765061;triangle[29][11]=27.055436;triangle[29][12]=-0.406804;triangle[29][13]=26.192145;triangle[29][14]=21.842633;triangle[29][15]=40.648388;triangle[29][16]=18.518320;triangle[29][17]=51.261923;triangle[29][18]=-3.935946;triangle[29][19]=17.037088;triangle[29][20]=-9.599830;triangle[29][21]=14.305884;triangle[29][22]=-9.247890;triangle[29][23]=17.993177;triangle[29][24]=-9.086434;triangle[29][25]=20.521119;triangle[29][26]=-9.030138;triangle[29][27]=21.484346;triangle[29][28]=-9.010508;triangle[29][29]=22.091203;triangle[30][0]=-5.647139;triangle[30][1]=16.268647;triangle[30][2]=0.658903;triangle[30][3]=15.449871;triangle[30][4]=10.484359;triangle[30][5]=7.370741;triangle[30][6]=-22.684475;triangle[30][7]=32.846873;triangle[30][8]=-56.481777;triangle[30][9]=32.553086