ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
;triangle[30][10]=-9.944996;triangle[30][11]=26.851695;triangle[30][12]=14.257856;triangle[30][13]=37.098550;triangle[30][14]=2.461775;triangle[30][15]=31.276948;triangle[30][16]=-13.305916;triangle[30][17]=6.330921;triangle[30][18]=-12.539450;triangle[30][19]=11.435603;triangle[30][20]=-10.885451;triangle[30][21]=17.543596;triangle[30][22]=-9.899228;triangle[30][23]=20.446148;triangle[30][24]=-9.313541;triangle[30][25]=21.458205;triangle[30][26]=-9.109325;triangle[30][27]=21.811088;triangle[30][28]=-9.038119;triangle[30][29]=22.034130;triangle[31][0]=-5.824942;triangle[31][1]=17.336973;triangle[31][2]=-6.012367;triangle[31][3]=18.484301;triangle[31][4]=7.051802;triangle[31][5]=0.691029;triangle[31][6]=-19.130282;triangle[31][7]=37.636716;triangle[31][8]=-54.244169;triangle[31][9]=44.010710;triangle[31][10]=-29.775108;triangle[31][11]=35.372668;triangle[31][12]=11.592882;triangle[31][13]=39.132147;triangle[31][14]=9.043044;triangle[31][15]=33.788074;triangle[31][16]=-10.501693;triangle[31][17]=7.574724;triangle[31][18]=-11.518396;triangle[31][19]=11.830549;triangle[31][20]=-9.878110;triangle[31][21]=17.451687;triangle[31][22]=-9.035178;triangle[31][23]=20.332313;triangle[31][24]=-8.360944;triangle[31][25]=21.418513;triangle[31][26]=-8.125854;triangle[31][27]=22.206758;triangle[31][28]=-8.043882;triangle[31][29]=22.723414;triangle[32][0]=-5.657236;triangle[32][1]=17.355296;triangle[32][2]=5.143314;triangle[32][3]=12.659142;triangle[32][4]=2.706452;triangle[32][5]=8.292370;triangle[32][6]=-22.224507;triangle[32][7]=31.718424;triangle[32][8]=-50.028390;triangle[32][9]=32.163381;triangle[32][10]=-11.313337;triangle[32][11]=30.028618;triangle[32][12]=7.497914;triangle[32][13]=35.368302;triangle[32][14]=13.888021;triangle[32][15]=41.527133;triangle[32][16]=-3.012361;triangle[32][17]=17.617931;triangle[32][18]=-9.577349;triangle[32][19]=11.523918;triangle[32][20]=-9.240051;triangle[32][21]=16.421340;triangle[32][22]=-9.083701;triangle[32][23]=20.016099;triangle[32][24]=-8.377863;triangle[32][25]=21.308257;triangle[32][26]=-8.131753;triangle[32][27]=21.758804;triangle[32][28]=-8.045939;triangle[32][29]=22.567222;triangle[33][0]=-6.168842;triangle[33][1]=17.677875;triangle[33][2]=0.362515;triangle[33][3]=15.779509;triangle[33][4]=6.292453;triangle[33][5]=5.718600;triangle[33][6]=-19.953692;triangle[33][7]=30.169784;triangle[33][8]=-48.249014;triangle[33][9]=27.664719;triangle[33][10]=-18.349187;triangle[33][11]=24.613647;triangle[33][12]=11.633966;triangle[33][13]=35.722454;triangle[33][14]=10.262205;triangle[33][15]=36.646664;triangle[33][16]=-8.704972;triangle[33][17]=13.611795;triangle[33][18]=-10.782056;triangle[33][19]=14.625609;triangle[33][20]=-9.008785;triangle[33][21]=18.922346;triangle[33][22]=-8.351742;triangle[33][23]=20.926888;triangle[33][24]=-8.122645;triangle[33][25]=21.625829;triangle[33][26]=-8.042764;triangle[33][27]=21.969535;triangle[33][28]=-8.014911;triangle[33][29]=22.640699;triangle[34][0]=-5.513216;triangle[34][1]=18.197262;triangle[34][2]=-7.973623;triangle[34][3]=14.699949;triangle[34][4]=2.915599;triangle[34][5]=2.342350;triangle[34][6]=-19.664814;triangle[34][7]=25.906923;triangle[34][8]=-41.795746;triangle[34][9]=36.703126;triangle[34][10]=-32.088002;triangle[34][11]=33.309582;triangle[34][12]=11.608300;triangle[34][13]=35.120962;triangle[34][14]=21.630309;triangle[34][15]=45.340070;triangle[34][16]=-6.977222;triangle[34][17]=12.519579;triangle[34][18]=-14.359330;triangle[34][19]=9.714493;triangle[34][20]=-11.692347;triangle[34][21]=16.265605;triangle[34][22]=-9.938763;triangle[34][23]=20.000540;triangle[34][24]=-8.676005;triangle[34][25]=21.302831;triangle[34][26]=-8.235708;triangle[34][27]=21.756912;triangle[34][28]=-8.082186;triangle[34][29]=22.259141;triangle[35][0]=-5.103706;triangle[35][1]=16.881226;triangle[35][2]=-4.234620;triangle[35][3]=19.325278;triangle[35][4]=1.828061;triangle[35][5]=11.098527;triangle[35][6]=-21.567750;triangle[35][7]=43.600338;triangle[35][8]=-44.993898;triangle[35][9]=48.229359;triangle[35][10]=-25.396158;triangle[35][11]=33.591013;triangle[35][12]=9.036038;triangle[35][13]=31.655585;triangle[35][14]=21.901438;triangle[35][15]=45.260959;triangle[35][16]=2.836230;triangle[35][17]=20.032328;triangle[35][18]=-8.779456;triangle[35][19]=11.700131;triangle[35][20]=-9.036395;triangle[35][21]=16.431291;triangle[35][22]=-8.171368;triangle[35][23]=20.589102;triangle[35][24]=-7.408431;triangle[35][25]=22.159372;triangle[35][26]=-7.142411;triangle[35][27]=22.706891;triangle[35][28]=-7.049656;triangle[35][29]=22.897799;triangle[36][0]=-6.125795;triangle[36][1]=15.314488;triangle[36][2]=-7.580285;triangle[36][3]=9.347812;triangle[36][4]=6.316851;triangle[36][5]=-5.120009;triangle[36][6]=-16.899042;triangle[36][7]=26.047158;triangle[36][8]=-38.899216;triangle[36][9]=33.589728;triangle[36][10]=-29.394502;triangle[36][11]=12.986768;triangle[36][12]=8.611930;triangle[36][13]=17.139560;triangle[36][14]=17.148095;triangle[36][15]=35.461440;triangle[36][16]=-1.083499;triangle[36][17]=12.637950;triangle[36][18]=-8.714797;triangle[36][19]=8.033509;triangle[36][20]=-8.982344;triangle[36][21]=14.996888;triangle[36][22]=-8.425285;triangle[36][23]=19.658166;triangle[36][24]=-6.453560;triangle[36][25]=22.878181;triangle[36][26]=-5.194245;triangle[36][27]=24.772747;triangle[36][28]=-5.949877;triangle[36][29]=24.920762;triangle[37][0]=-4.900636;triangle[37][1]=15.314488;triangle[37][2]=-0.874709;triangle[37][3]=14.353215;triangle[37][4]=5.545542;triangle[37][5]=-1.705166;triangle[37][6]=-17.002365;triangle[37][7]=26.459912;triangle[37][8]=-39.388356;triangle[37][9]=33.127189;triangle[37][10]=-32.442079;triangle[37][11]=26.385665;triangle[37][12]=8.680918;triangle[37][13]=30.233664;triangle[37][14]=20.262845;triangle[37][15]=48.028580;triangle[37][16]=0.606484;triangle[37][17]=22.259526;triangle[37][18]=-8.336067;triangle[37][19]=13.480964;triangle[37][20]=-8.898119;triangle[37][21]=17.298027;triangle[37][22]=-8.964476;triangle[37][23]=20.177761;triangle[37][24]=-8.987614;triangle[37][25]=21.364624;triangle[37][26]=-8.995681;triangle[37][27]=21.778458;triangle[37][28]=-8.998494;triangle[37][29]=21.922753;triangle[38][0]=-6.025795;triangle[38][1]=17.243103;triangle[38][2]=-7.772959;triangle[38][3]=24.339302;triangle[38][4]=6.620269;triangle[38][5]=10.280003;triangle[38][6]=2.210333;triangle[38][7]=17.400081;triangle[38][8]=-14.779512;triangle[38][9]=41.057854;triangle[38][10]=-44.068505;triangle[38][11]=37.139906;triangle[38][12]=-17.539489;triangle[38][13]=35.395661;triangle[38][14]=10.809800;triangle[38][15]=48.248311;triangle[38][16]=7.581216;triangle[38][17]=43.701396;triangle[38][18]=-8.027125;triangle[38][19]=14.712689;triangle[38][20]=-9.152740;triangle[38][21]=15.713708;triangle[38][22]=-8.863257;triangle[38][23]=18.988423;triangle[38][24]=-8.300999;triangle[38][25]=20.911186;triangle[38][26]=-8.104952;triangle[38][27]=22.232934;triangle[38][28]=-7.536594;triangle[38][29]=22.732540;triangle[39][0]=-5.513216;triangle[39][1]=15.927067;triangle[39][2]=-3.661632;triangle[39][3]=19.156377;triangle[39][4]=8.286520;triangle[39][5]=5.238058;triangle[39][6]=-12.213496;triangle[39][7]=29.758420;triangle[39][8]=-37.589150;triangle[39][9]=37.940978;triangle[39][10]=-39.465568;triangle[39][11]=31.365022;triangle[39][12]=0.363238;triangle[39][13]=26.365948;triangle[39][14]=16.839965;triangle[39][15]=42.163198;triangle[39][16]=2.226142;triangle[39][17]=27.769386;triangle[39][18]=-10.262237;triangle[39][19]=16.194970;triangle[39][20]=-10.214606;triangle[39][21]=18.410926;triangle[39][22]=-9.079607;triangle[39][23]=20.097246;triangle[39][24]=-8.376436;triangle[39][25]=21.396932;triangle[39][26]=-8.131255;triangle[39][27]=22.441045;triangle[39][28]=-8.045766;triangle[39][29]=22.805104;
  #endif
}
void fill_matrix_S(){
  #ifdef TRAINING
