ROC5COR/STM32_NeuralNet_MovementDetection/Src/main.c
  S[0][0]=-6.168842;S[0][1]=14.701908;S[0][2]=-8.064158;S[0][3]=21.357956;S[0][4]=-0.257741;S[0][5]=24.322259;S[0][6]=3.148116;S[0][7]=11.218286;S[0][8]=-43.495832;S[0][9]=5.337127;S[0][10]=-64.811608;S[0][11]=11.870177;S[0][12]=-16.373139;S[0][13]=16.877263;S[0][14]=21.037481;S[0][15]=37.645031;S[0][16]=-14.281195;S[0][17]=37.384306;S[0][18]=-17.596132;S[0][19]=34.184813;S[0][20]=-12.447619;S[0][21]=32.761797;S[0][22]=-8.899467;S[0][23]=32.265622;S[0][24]=-7.662303;S[0][25]=32.092617;S[0][26]=-7.230931;S[0][27]=32.032293;S[0][28]=-7.080521;S[0][29]=32.011260;S[1][0]=-6.394475;S[1][1]=15.043488;S[1][2]=-8.081831;S[1][3]=19.993478;S[1][4]=6.707369;S[1][5]=18.312180;S[1][6]=-2.452676;S[1][7]=4.057403;S[1][8]=-44.025148;S[1][9]=7.894515;S[1][10]=-21.957460;S[1][11]=14.128371;S[1][12]=9.793456;S[1][13]=21.593542;S[1][14]=-6.391489;S[1][15]=36.471412;S[1][16]=-17.389740;S[1][17]=37.275580;S[1][18]=-13.631688;S[1][19]=32.757799;S[1][20]=-11.076291;S[1][21]=30.210263;S[1][22]=-9.723958;S[1][23]=28.770671;S[1][24]=-9.252429;S[1][25]=28.078716;S[1][26]=-9.088016;S[1][27]=26.854422;S[1][28]=-9.030689;S[1][29]=26.297919;S[2][0]=-6.581542;S[2][1]=15.549385;S[2][2]=-7.625945;S[2][3]=20.821195;S[2][4]=11.378887;S[2][5]=22.274970;S[2][6]=5.237573;S[2][7]=14.756511;S[2][8]=-46.636590;S[2][9]=10.138426;S[2][10]=-34.851399;S[2][11]=19.457817;S[2][12]=8.167642;S[2][13]=29.426732;S[2][14]=16.999262;S[2][15]=41.230923;S[2][16]=-13.471598;S[2][17]=37.805141;S[2][18]=-14.426903;S[2][19]=32.190694;S[2][20]=-11.113749;S[2][21]=29.542993;S[2][22]=-9.737019;S[2][23]=27.925429;S[2][24]=-8.788423;S[2][25]=27.322677;S[2][26]=-8.274906;S[2][27]=27.112511;S[2][28]=-8.095854;S[2][29]=27.039230;S[3][0]=-4.900636;S[3][1]=14.701908;S[3][2]=-6.919319;S[3][3]=20.096956;S[3][4]=7.470432;S[3][5]=20.938991;S[3][6]=-6.152394;S[3][7]=12.150068;S[3][8]=-45.339775;S[3][9]=7.476408;S[3][10]=-49.473183;S[3][11]=7.175373;S[3][12]=-1.025976;S[3][13]=8.893289;S[3][14]=4.273299;S[3][15]=19.312006;S[3][16]=-22.968943;S[3][17]=27.670596;S[3][18]=-19.154358;S[3][19]=28.346466;S[3][20]=-13.070288;S[3][21]=27.930805;S[3][22]=-9.767900;S[3][23]=27.224552;S[3][24]=-8.616429;S[3][25]=25.965653;S[3][26]=-8.214935;S[3][27]=25.988024;S[3][28]=-8.074943;S[3][29]=25.995824;S[4][0]=-5.784216;S[4][1]=15.143488;S[4][2]=-2.717663;S[4][3]=22.691969;S[4][4]=10.685139;S[4][5]=15.084989;S[4][6]=-16.713988;S[4][7]=7.313026;S[4][8]=-50.528016;S[4][9]=7.549546;S[4][10]=-14.094658;S[4][11]=7.994666;S[4][12]=18.982063;S[4][13]=10.482112;S[4][14]=-8.132900;S[4][15]=24.562839;S[4][16]=-15.785042;S[4][17]=29.216496;S[4][18]=-12.384690;S[4][19]=29.726809;S[4][20]=-9.528847;S[4][21]=29.904744;S[4][22]=-8.533076;S[4][23]=29.966786;S[4][24]=-8.185872;S[4][25]=29.988419;S[4][26]=-8.064810;S[4][27]=29.995962;S[4][28]=-8.022598;S[4][29]=29.727592;S[5][0]=-6.448375;S[5][1]=15.612047;S[5][2]=-1.207141;S[5][3]=18.685945;S[5][4]=8.543267;S[5][5]=10.650023;S[5][6]=-30.871032;S[5][7]=2.826727;S[5][8]=-31.572845;S[5][9]=9.603037;S[5][10]=1.148558;S[5][11]=22.830545;S[5][12]=6.998812;S[5][13]=35.496124;S[5][14]=-14.402540;S[5][15]=32.916960;S[5][16]=-13.548859;S[5][17]=29.882798;S[5][18]=-10.909689;S[5][19]=28.656491;S[5][20]=-9.665868;S[5][21]=28.228904;S[5][22]=-8.710471;S[5][23]=28.079814;S[5][24]=-7.779167;S[5][25]=28.027829;S[5][26]=-7.271679;S[5][27]=28.009704;S[5][28]=-7.094728;S[5][29]=28.003383;S[6][0]=-5.657236;S[6][1]=18.528965;S[6][2]=-7.834450;S[6][3]=25.348976;S[6][4]=-7.715529;S[6][5]=25.895383;S[6][6]=11.258469;S[6][7]=28.663756;S[6][8]=7.458394;S[6][9]=22.056245;S[6][10]=-27.568431;S[6][11]=18.463500;S[6][12]=-36.502264;S[6][13]=11.200306;S[6][14]=3.877572;S[6][15]=18.649073;S[6][16]=5.570414;S[6][17]=36.514511;S[6][18]=-11.626085;S[6][19]=36.359753;S[6][20]=-13.042091;S[6][21]=31.496392;S[6][22]=-8.125886;S[6][23]=27.295002;S[6][24]=-7.392572;S[6][25]=25.800218;S[6][26]=-7.136881;S[6][27]=25.279019;S[6][28]=-7.047728;S[6][29]=25.097288;S[7][0]=-7.079954;S[7][1]=14.358008;S[7][2]=-8.781843;S[7][3]=19.927917;S[7][4]=12.679995;S[7][5]=22.593944;S[7][6]=-0.804401;S[7][7]=13.829366;S[7][8]=-42.352355;S[7][9]=8.561852;S[7][10]=-32.016220;S[7][11]=8.118603;S[7][12]=15.003138;S[7][13]=16.230126;S[7][14]=9.174422;S[7][15]=27.099791;S[7][16]=-4.715501;S[7][17]=28.697460;S[7][18]=-7.542509;S[7][19]=28.243189;S[7][20]=-7.840483;S[7][21]=28.084795;S[7][22]=-7.944380;S[7][23]=28.029566;S[7][24]=-7.980606;S[7][25]=27.358988;S[7][26]=-7.993238;S[7][27]=27.125171;S[7][28]=-7.997642;S[7][29]=27.043645;S[8][0]=-5.754795;S[8][1]=19.033012;S[8][2]=-6.556145;S[8][3]=26.095048;S[8][4]=4.751014;S[8][5]=25.518063;S[8][6]=-7.613534;S[8][7]=11.648798;S[8][8]=-56.632331;S[8][9]=17.133995;S[8][10]=-26.784454;S[8][11]=20.387221;S[8][12]=16.342691;S[8][13]=20.380992;S[8][14]=-0.334864;S[8][15]=21.658583;S[8][16]=-16.174613;S[8][17]=22.461476;S[8][18]=-13.940321;S[8][19]=24.114871;S[8][20]=-11.068747;S[8][21]=24.691375;S[8][22]=-9.531327;S[8][23]=24.892389;S[8][24]=-8.533941;S[8][25]=24.962478;S[8][26]=-6.621064;S[8][27]=25.508620;S[8][28]=-5.565230;S[8][29]=25.828666;S[9][0]=-6.841444;S[9][1]=14.192398;S[9][2]=-8.898680;S[9][3]=19.006658;S[9][4]=-6.124168;S[9][5]=19.410451;S[9][6]=8.502895;S[9][7]=9.777021;S[9][8]=-32.995417;S[9][9]=9.281031;S[9][10]=-34.110881;S[9][11]=9.291921;S[9][12]=4.798964;S[9][13]=14.914387;S[9][14]=-1.315242;S[9][15]=20.644173;S[9][16]=-15.750492;S[9][17]=23.647457;S[9][18]=-13.099178;S[9][19]=24.528397;S[9][20]=-10.329295;S[9][21]=24.835562;S[9][22]=-8.812175;S[9][23]=24.942664;S[9][24]=-8.283188;S[9][25]=24.980008;S[9][26]=-8.098742;S[9][27]=24.993029;S[9][28]=-8.034429;S[9][29]=24.997569;S[10][0]=-6.394475;S[10][1]=15.167534;S[10][2]=-7.385498;S[10][3]=21.264210;S[10][4]=-0.533143;S[10][5]=22.101395;S[10][6]=0.534006;S[10][7]=9.184789;S[10][8]=-49.872153;S[10][9]=7.593643;S[10][10]=-38.317859;S[10][11]=2.205548;S[10][12]=8.976506;S[10][13]=16.128936;S[10][14]=3.400439;S[10][15]=36.008790;S[10][16]=-13.021067;S[10][17]=35.000286;S[10][18]=-12.541806;S[10][19]=31.130912;S[10][20]=-9.622372;S[10][21]=28.479102;S[10][22]=-8.565686;S[10][23]=27.515731;S[10][24]=-8.197243;S[10][25]=26.658121;S[10][26]=-8.068774;S[10][27]=26.229473;S[10][28]=-8.023980;S[10][29]=26.080012;S[11][0]=-6.738375;S[11][1]=14.744955;S[11][2]=-8.844530;S[11][3]=19.599941;S[11][4]=9.838362;S[11][5]=22.640374;S[11][6]=7.900943;S[11][7]=4.786289;S[11][8]=-35.533005;S[11][9]=3.598784;S[11][10]=-22.995261;S[11][11]=19.184995;S[11][12]=26.329981;S[11][13]=28.141431;S[11][14]=-1.498131;S[11][15]=30.746576;S[11][16]=-12.304869;S[11][17]=28.306350;S[11][18]=-12.220025;S[11][19]=24.850210;S[11][20]=-9.851753;S[11][21]=23.645128;S[11][22]=-8.455666;S[11][23]=23.224942;S[11][24]=-7.851459;S[11][25]=23.422333;S[11][26]=-7.948207;S[11][27]=23.798580;S[11][28]=-7.981941;S[11][29]=24.339279;S[12][0]=-4.943683;S[12][1]=15.970114;S[12][2]=-6.934328;S[12][3]=22.502795;S[12][4]=-6.750354;S[12][5]=25.149159;S[12][6]=12.176315;S[12][7]=26.727969;S[12][8]=-1.370203;S[12][9]=19.534734;S[12][10]=-49.044247;S[12][11]=17.508740;S[12][12]=-25.308919;S[12][13]=26.441868;S[12][14]=19.642537;S[12][15]=38.310763;S[12][16]=-10.505057;S[12][17]=37.109875;S[12][18]=-21.722212;S[12][19]=31.725650;S[12][20]=-16.652392;S[12][21]=29.299054;S[12][22]=-11.836585;S[12][23]=27.984393;S[12][24]=-9.989056;S[12][25]=27.072237;S[12][26]=-9.344862;S[12][27]=26.373866;S[12][28]=-9.120246;S[12][29]=26.130359;S[13][0]=-7.635580;S[13][1]=13.842375;S[13][2]=-9.826899;S[13][3]=18.694291;S[13][4]=-2.438864;S[13][5]=24.240822;S[13][6]=6.151631;S[13][7]=16.114494;S[13][8]=-32.593930;S[13][9]=11.592699;S[13][10]=-42.377662;S[13][11]=13.944602;S[13][12]=0.203174;S[13][13]=13.259326;S[13][14]=22.575090;S[13][15]=27.310767;S[13][16]=-14.611133;S[13][17]=24.236334;S[13][18]=-16.057408;S[13][19]=23.922382;S[13][20]=-11.764059;S[13][21]=23.972936;S[13][22]=-9.619868;S[13][23]=23.990563;S[13][24]=-8.564813;S[13][25]=23.996710;S[13][26]=-7.675235;S[13][27]=24.520556;S[13][28]=-7.235440;S[13][29]=24.832828;S[14][0]=-5.657236;S[14][1]=16.539647;S[14][2]=-7.183129;S[14][3]=22.701379;S[14][4]=-7.715175;S[14][5]=24.578842;S[14][6]=-7.341155;S[14][7]=24.378784;S[14][8]=1.885210;S[14][9]=19.795983;S[14][10]=-17.085820;S[14][11]=10.179673;S[14][12]=-48.162975;S[14][13]=16.852674;S[14][14]=-23.393558;S[14][15]=14.196137;S[14][16]=12.863390;S[14][17]=27.748945;S[14][18]=-13.754838;S[14][19]=29.408985;S[14][20]=-17.412602;S[14][21]=27.188640;S[14][22]=-13.268230;S[14][23]=26.414453;S[14][24]=-10.949561;S[14][25]=25.531931;S[14][26]=-9.158067;S[14][27]=25.185473;S[14][28]=-8.403793;S[14][29]=25.474180;S[15][0]=-7.350954;S[15][1]=14.223252;S[15][2]=-8.905519;S[15][3]=19.639737;S[15][4]=6.965286;S[15][5]=18.537566;S[15][6]=-6.929651;S[15][7]=13.458271;S[15][8]=-41.681385;S[15][9]=18.695493;S[15][10]=0.852816;S[15][11]=20.946876;S[15][12]=17.070395;S[15][13]=24.166151;S[15][14]=-3.671511;S[15][15]=24.562140;S[15][16]=-8.073946;S[15][17]=25.498649;S[15][18]=-9.228426;S[15][19]=25.825190;S[15][20]=-9.079647;S[15][21]=25.939047;S[15][22]=-8.683871;S[15][23]=25.978747;S[15][24]=-8.138451;S[15][25]=25.992590;S[15][26]=-7.396953;S[15][27]=25.427883;S[15][28]=-7.138409;S[15][29]=25.149194;S[16][0]=-6.169816;S[16][1]=17.197123;S[16][2]=-8.013176;S[16][3]=21.974147;S[16][4]=0.796520;S[16][5]=23.666764;S[16][6]=12.717217;S[16][7]=13.002665;S[16][8]=-32.101313;S[16][9]=10.777720;S[16][10]=-52.398515;S[16][11]=7.209379;S[16][12]=-5.826432;S[16][13]=12.608470;S[16][14]=2.064998;S[16][15]=24.824120;S[16][16]=-18.633202;S[16][17]=25.043080;S[16][18]=-16.036643;S[16][19]=24.709863;S[16][20]=-12.287610;S[16][21]=24.247514;S[16][22]=-10.329081;S[16][23]=24.086303;S[16][24]=-9.463422;S[16][25]=24.030092;S[16][26]=-9.161585;S[16][27]=24.010492;S[16][28]=-8.587782;S[16][29]=24.003658;S[17][0]=-7.350954;S[17][1]=12.294637;S[17][2]=-8.496656;S[17][3]=16.700727;S[17][4]=6.750710;S[17][5]=12.004181;S[17][6]=-18.011671;S[17][7]=1.564422;S[17][8]=-46.387994;S[17][9]=7.440053;S[17][10]=-17.874257;S[17][11]=11.079415;S[17][12]=1.711893;S[17][13]=20.751457;S[17][14]=-17.153462;S[17][15]=22.218302;S[17][16]=-14.489046;S[17][17]=23.378760;S[17][18]=-10.913912;S[17][19]=23.783387;S[17][20]=-9.323440;S[17][21]=23.924472;S[17][22]=-8.461455;S[17][23]=23.973665;S[17][24]=-8.160899;S[17][25]=23.990818;S[17][26]=-8.056102;S[17][27]=23.996798;S[17][28]=-8.019562;S[17][29]=23.998884;S[18][0]=-6.168842;S[18][1]=16.673570;S[18][2]=-8.094625;S[18][3]=22.217284;S[18][4]=-8.069415;S[18][5]=24.029727;S[18][6]=-1.153018;S[18][7]=13.091711;S[18][8]=-2.116338;S[18][9]=4.832065;S[18][10]=-55.605715;S[18][11]=10.667157;S[18][12]=-28.810869;S[18][13]=13.014047;S[18][14]=13.697517;S[18][15]=27.457582;S[18][16]=-17.991825;S[18][17]=29.429795;S[18][18]=-23.110490;S[18][19]=27.765428;S[18][20]=-16.395133;S[18][21]=27.076888;S[18][22]=-11.958845;S[18][23]=26.375488;S[18][24]=-9.419106;S[18][25]=25.518345;S[18][26]=-8.494812;S[18][27]=25.180736;S[18][28]=-8.172530;S[18][29]=25.063019;S[19][0]=-6.738375;S[19][1]=14.324226;S[19][2]=-8.711360;S[19][3]=18.368971;S[19][4]=5.799864;S[19][5]=13.732829;S[19][6]=-33.905465;S[19][7]=-1.494516;S[19][8]=-59.411196;S[19][9]=1.039216;S[19][10]=-9.900385;S[19][11]=10.043066;S[19][12]=-0.790949;S[19][13]=21.136366;S[19][14]=-20.183745;S[19][15]=22.401576;S[19][16]=-16.577284;S[19][17]=22.791342;S[19][18]=-12.191269;S[19][19]=22.927246;S[19][20]=-10.112727;S[19][21]=22.974632;S[19][22]=-9.387984;S[19][23]=22.991155;S[19][24]=-8.483960;S[19][25]=22.996916;S[19][26]=-8.168746;S[19][27]=22.998925;S[19][28]=-8.058838;S[19][29]=22.999625;S[20][0]=-5.513216;S[20][1]=16.530523;S[20][2]=-7.024701;S[20][3]=22.598198;S[20][4]=-4.268423;S[20][5]=23.396816;S[20][6]=1.710162;S[20][7]=16.745246;S[20][8]=-28.377465;S[20][9]=16.869450;S[20][10]=-32.792848;S[20][11]=20.720794;S[20][12]=4.444507;S[20][13]=21.804527;S[20][14]=30.351622;S[20][15]=26.286690;S[20][16]=6.241662;S[20][17]=28.965535;S[20][18]=-3.034240;S[20][19]=27.405448;S[20][20]=-6.268546;S[20][21]=26.490049;S[20][22]=-7.396279;S[20][23]=26.170870;S[20][24]=-7.789496;S[20][25]=25.490046;S[20][26]=-7.926602;S[20][27]=25.170868;S[20][28]=-7.974408;S[20][29]=25.059578;S[21][0]=-6.548375;S[21][1]=12.907216;S[21][2]=-5.697948;S[21][3]=17.783298;S[21][4]=12.174907;S[21][5]=10.825996;S[21][6]=-7.757584;S[21][7]=1.952846;S[21][8]=-40.519589;S[21][9]=2.716143;S[21][10]=-7.345090;S[21][11]=6.408501;S[21][12]=9.165359;S[21][13]=18.989624;S[21][14]=-17.958335;S[21][15]=24.723662;S[21][16]=-17.103974;S[21][17]=25.413587;S[21][18]=-12.597533;S[21][19]=25.144209;S[21][20]=-10.496194;S[21][21]=25.050283;S[21][22]=-9.521691;S[21][23]=25.017532;S[21][24]=-8.569323;S[21][25]=25.006113;S[21][26]=-8.198511;S[21][27]=25.002132;S[21][28]=-8.069216;S[21][29]=25.000743;S[22][0]=-5.925916;S[22][1]=16.785763;S[22][2]=-7.467133;S[22][3]=23.194616;S[22][4]=3.091917;S[22][5]=20.685292;S[22][6]=-6.847353;S[22][7]=5.561283;S[22][8]=-54.399744;S[22][9]=0.869478;S[22][10]=-25.387759;S[22][11]=5.156023;S[22][12]=8.946003;S[22][13]=20.235392;S[22][14]=-18.274655;S[22][15]=23.434854;S[22][16]=-19.537798;S[22][17]=23.031093;S[22][18]=-13.414636;S[22][19]=23.010842;S[22][20]=-10.539289;S[22][21]=23.003780;S[22][22]=-9.536717;S[22][23]=23.001318;S[22][24]=-9.187142;S[22][25]=23.000460;S[22][26]=-9.065252;S[22][27]=23.000160;S[22][28]=-9.022752;S[22][29]=23.000056;S[23][0]=-6.781421;S[23][1]=14.592905;S[23][2]=-8.143851;S[23][3]=17.997773;S[23][4]=16.528760;S[23][5]=16.505677;S[23][6]=-16.978092;S[23][7]=10.626549;S[23][8]=-48.820841;S[23][9]=15.259149;S[23][10]=-9.893382;S[23][11]=21.557014;S[23][12]=1.315598;S[23][13]=28.116111;S[23][14]=-16.047346;S[23][15]=28.251570;S[23][16]=-13.452046;S[23][17]=27.336395;S[23][18]=-10.552332;S[23][19]=26.465972;S[23][20]=-9.541265;S[23][21]=26.162474;S[23][22]=-9.188727;S[23][23]=26.436184;S[23][24]=-9.065805;S[23][25]=26.052088;S[23][26]=-8.679045;S[23][27]=25.366840;S[23][28]=-8.236768;S[23][29]=25.127909;S[24][0]=-6.467375;S[24][1]=17.777875;S[24][2]=-7.737717;S[24][3]=23.594911;S[24][4]=5.242625;S[24][5]=24.029726;S[24][6]=4.667043;S[24][7]=5.021547;S[24][8]=-54.456491;S[24][9]=-1.419619;S[24][10]=-22.289531;S[24][11]=1.653161;S[24][12]=23.307259;S[24][13]=22.274873;S[24][14]=2.628621;S[24][15]=30.023184;S[24][16]=-12.192004;S[24][17]=28.174650;S[24][18]=-11.131875;S[24][19]=27.000065;S[24][20]=-9.743339;S[24][21]=26.004801;S[24][22]=-9.259186;S[24][23]=25.350352;S[24][24]=-8.819373;S[24][25]=25.393160;S[24][26]=-8.285698;S[24][27]=25.788408;S[24][28]=-8.099617;S[24][29]=25.926222;S[25][0]=-6.312862;S[25][1]=14.748145;S[25][2]=-8.614375;S[25][3]=19.778856;S[25][4]=0.073111;S[25][5]=18.023887;S[25][6]=-10.825173;S[25][7]=4.903065;S[25][8]=-49.140758;S[25][9]=8.071065;S[25][10]=-18.008790;S[25][11]=13.855048;S[25][12]=8.265521;S[25][13]=18.789634;S[25][14]=-13.871449;S[25][15]=25.660591;S[25][16]=-15.717707;S[25][17]=27.184299;S[25][18]=-12.115146;S[25][19]=27.193879;S[25][20]=-9.986184;S[25][21]=26.398069;S[25][22]=-8.692540;S[25][23]=25.487476;S[25][24]=-8.241474;S[25][25]=25.169973;S[25][26]=-8.084197;S[25][27]=25.439587;S[25][28]=-8.029358;S[25][29]=25.153275;S[26][0]=-5.513216;S[26][1]=15.927067;S[26][2]=-7.684233;S[26][3]=21.834376;S[26][4]=0.140371;S[26][5]=17.852372;S[26][6]=-8.357909;S[26][7]=7.305087;S[26][8]=-48.680313;S[26][9]=16.413736;S[26][10]=-2.535522;S[26][11]=30.157272;S[26][12]=14.531539;S[26][13]=39.221462;S[26][14]=-18.249603;S[26][15]=38.526049;S[26][16]=-18.198890;S[26][17]=33.465784;S[26][18]=-12.652560;S[26][19]=29.293222;S[26][20]=-9.622247;S[26][21]=27.508623;S[26][22]=-8.565643;S[26][23]=26.987024;S[26][24]=-8.197227;S[26][25]=25.942982;S[26][26]=-8.068769;S[26][27]=25.328797;S[26][28]=-8.023978;S[26][29]=25.114645;S[27][0]=-6.125795;S[27][1]=14.089329;S[27][2]=-6.194205;S[27][3]=19.150621;S[27][4]=9.570552;S[27][5]=16.347066;S[27][6]=-22.459052;S[27][7]=7.043369;S[27][8]=-50.346671;S[27][9]=7.755423;S[27][10]=-4.603330;S[27][11]=15.182116;S[27][12]=9.346622;S[27][13]=28.101745;S[27][14]=-11.072642;S[27][15]=28.079178;S[27][16]=-11.114340;S[27][17]=27.458075;S[27][18]=-10.388546;S[27][19]=27.159721;S[27][20]=-9.512801;S[27][21]=26.587132;S[27][22]=-9.178803;S[27][23]=26.014720;S[27][24]=-9.062345;S[27][25]=25.353811;S[27][26]=-9.021738;S[27][27]=25.123366;S[27][28]=-9.007580;S[27][29]=25.043015;S[28][0]=-5.044657;S[28][1]=16.630523;S[28][2]=-6.969535;S[28][3]=23.194387;S[28][4]=2.934750;S[28][5]=31.321578;S[28][6]=7.999336;S[28][7]=24.872870;S[28][8]=-37.868132;S[28][9]=22.054521;S[28][10]=-40.389429;S[28][11]=28.179119;S[28][12]=1.138134;S[28][13]=29.810131;S[28][14]=7.018705;S[28][15]=39.399585;S[28][16]=-21.665473;S[28][17]=34.628918;S[28][18]=-19.168426;S[28][19]=29.553823;S[28][20]=-14.016514;S[28][21]=27.239141;S[28][22]=-10.830939;S[28][23]=26.432062;S[28][24]=-9.448409;S[28][25]=26.150651;S[28][26]=-8.095519;S[28][27]=28.423709;S[28][28]=-7.381984;S[28][29]=27.345947;S[29][0]=-6.872298;S[29][1]=13.899329;S[29][2]=-7.369059;S[29][3]=19.077371;S[29][4]=7.828066;S[29][5]=12.090275;S[29][6]=-27.456858;S[29][7]=4.379763;S[29][8]=-52.183384;S[29][9]=8.398527;S[29][10]=-7.581638;S[29][11]=7.198495;S[29][12]=21.573785;S[29][13]=15.615637;S[29][14]=-8.279698;S[29][15]=18.480714;S[29][16]=-11.262698;S[29][17]=21.424222;S[29][18]=-9.918572;S[29][19]=22.450560;S[29][20]=-8.910776;S[29][21]=22.498912;S[29][22]=-8.317568;S[29][23]=22.825281;S[29][24]=-8.110729;S[29][25]=23.210079;S[29][26]=-8.038609;S[29][27]=23.724572;S[29][28]=-8.013462;S[29][29]=23.903964;S[30][0]=-6.125795;S[30][1]=16.274157;S[30][2]=-8.359148;S[30][3]=22.979808;S[30][4]=-2.348071;S[30][5]=27.947001;S[30][6]=0.005246;S[30][7]=20.126738;S[30][8]=-14.162087;S[30][9]=13.932343;S[30][10]=-45.690994;S[30][11]=13.429605;S[30][12]=-7.681582;S[30][13]=17.298740;S[30][14]=18.850094;S[30][15]=26.922531;S[30][16]=-10.347230;S[30][17]=33.632397;S[30][18]=-16.041680;S[30][19]=30.518088;S[30][20]=-12.130005;S[30][21]=27.657149;S[30][22]=-10.091365;S[30][23]=26.577812;S[30][24]=-8.811003;S[30][25]=26.201471;S[30][26]=-8.282779;S[30][27]=25.970248;S[30][28]=-8.098599;S[30][29]=25.338305;S[31][0]=-7.394001;S[31][1]=13.711646;S[31][2]=-9.824455;S[31][3]=18.666130;S[31][4]=-1.041883;S[31][5]=21.835218;S[31][6]=4.871371;S[31][7]=18.848053;S[31][8]=-39.084985;S[31][9]=15.567270;S[31][10]=-41.806225;S[31][11]=14.183397;S[31][12]=5.063007;S[31][13]=20.764928;S[31][14]=11.683158;S[31][15]=22.236010;S[31][16]=-14.930596;S[31][17]=20.448825;S[31][18]=-14.194302;S[31][19]=21.217327;S[31][20]=-10.940760;S[31][21]=21.727099;S[31][22]=-9.676701;S[31][23]=21.904845;S[31][24]=-9.235951;S[31][25]=21.966822;S[31][26]=-9.082271;S[31][27]=22.557964;S[31][28]=-9.028686;S[31][29]=22.845872;S[32][0]=-6.068842;S[32][1]=16.238794;S[32][2]=-4.391314;S[32][3]=18.597973;S[32][4]=7.615827;S[32][5]=9.316941;S[32][6]=-30.874291;S[32][7]=5.545856;S[32][8]=-37.287451;S[32][9]=8.358338;S[32][10]=1.443154;S[32][11]=20.906613;S[32][12]=1.573467;S[32][13]=34.619401;S[32][14]=-18.706515;S[32][15]=29.722898;S[32][16]=-15.510884;S[32][17]=26.927094;S[32][18]=-11.960268;S[32][19]=25.020615;S[32][20]=-10.683503;S[32][21]=24.355866;S[32][22]=-9.616620;S[32][23]=24.124083;S[32][24]=-8.563680;S[32][25]=24.043265;S[32][26]=-8.196543;S[32][27]=24.015086;S[32][28]=-8.068530;S[32][29]=24.005260;S[33][0]=-6.681421;S[33][1]=14.042375;S[33][2]=6.647645;S[33][3]=20.335342;S[33][4]=-2.395453;S[33][5]=7.355125;S[33][6]=-55.133742;S[33][7]=3.484297;S[33][8]=-29.509322;S[33][9]=10.138961;S[33][10]=14.734435;S[33][11]=24.583373;S[33][12]=-11.306005;S[33][13]=25.359698;S[33][14]=-16.520005;S[33][15]=24.474097;S[33][16]=-12.362397;S[33][17]=23.755798;S[33][18]=-10.172395;S[33][19]=23.263530;S[33][20]=-9.408789;S[33][21]=23.091887;S[33][22]=-9.142536;S[33][23]=23.032039;S[33][24]=-9.049699;S[33][25]=23.011171;S[33][26]=-8.607819;S[33][27]=23.003895;S[33][28]=-8.211933;S[33][29]=23.001358;S[34][0]=-6.428865;S[34][1]=15.514488;S[34][2]=-5.960691;S[34][3]=21.618990;S[34][4]=7.744320;S[34][5]=13.274975;S[34][6]=-27.182142;S[34][7]=5.908820;S[34][8]=-37.523518;S[34][9]=12.590081;S[34][10]=0.188353;S[34][11]=13.894073;S[34][12]=6.172209;S[34][13]=28.042982;S[34][14]=-16.622647;S[34][15]=30.661566;S[34][16]=-15.335606;S[34][17]=28.714538;S[34][18]=-11.247831;S[34][19]=27.076119;S[34][20]=-9.783770;S[34][21]=25.805687;S[34][22]=-9.273284;S[34][23]=24.668346;S[34][24]=-9.095288;S[34][25]=24.802571;S[34][26]=-9.033225;S[34][27]=24.931161;S[34][28]=-9.011585;S[34][29]=24.975997;S[35][0]=-7.223975;S[35][1]=12.723339;S[35][2]=-9.049481;S[35][3]=17.806685;S[35][4]=10.260618;S[35][5]=14.357525;S[35][6]=-5.147932;S[35][7]=-3.756327;S[35][8]=-42.349284;S[35][9]=4.167724;S[35][10]=-12.631291;S[35][11]=17.955513;S[35][12]=13.243621;S[35][13]=34.702413;S[35][14]=-10.529622;S[35][15]=31.576383;S[35][16]=-12.508198;S[35][17]=27.331785;S[35][18]=-10.535614;S[35][19]=25.813043;S[35][20]=-9.191535;S[35][21]=24.670911;S[35][22]=-9.032825;S[35][23]=24.233932;S[35][24]=-9.011445;S[35][25]=24.081567;S[35][26]=-8.352669;S[35][27]=24.028441;S[35][28]=-8.122968;S[35][29]=24.009917;S[36][0]=-5.854795;S[36][1]=15.843135;S[36][2]=1.705507;S[36][3]=27.991179;S[36][4]=17.698505;S[36][5]=21.037402;S[36][6]=-22.545145;S[36][7]=11.959979;S[36][8]=-31.868283;S[36][9]=18.396797;S[36][10]=9.903748;S[36][11]=28.498483;S[36][12]=24.170432;S[36][13]=42.491324;S[36][14]=-11.314869;S[36][15]=35.039548;S[36][16]=-14.386368;S[36][17]=29.151896;S[36][18]=-11.581244;S[36][19]=26.486419;S[36][20]=-9.900024;S[36][21]=25.518282;S[36][22]=-9.313819;S[36][23]=25.180714;S[36][24]=-9.109422;S[36][25]=25.063011;S[36][26]=-9.038153;S[36][27]=25.021971;S[36][28]=-9.013303;S[36][29]=25.007661;S[37][0]=-6.738375;S[37][1]=12.674170;S[37][2]=-9.014063;S[37][3]=16.402235;S[37][4]=11.424533;S[37][5]=15.638927;S[37][6]=-5.103730;S[37][7]=8.327872;S[37][8]=-40.947547;S[37][9]=8.390718;S[37][10]=-6.973317;S[37][11]=11.783859;S[37][12]=27.403578;S[37][13]=22.968207;S[37][14]=-3.170693;S[37][15]=24.043529;S[37][16]=-10.183877;S[37][17]=25.317821;S[37][18]=-9.784223;S[37][19]=25.762139;S[37][20]=-9.273441;S[37][21]=25.917063;S[37][22]=-9.095343;S[37][23]=25.971082;S[37][24]=-9.033244;S[37][25]=25.468214;S[37][26]=-9.011592;S[37][27]=25.163256;S[37][28]=-9.004042;S[37][29]=24.405602;S[38][0]=-6.125795;S[38][1]=17.243103;S[38][2]=-7.937445;S[38][3]=23.347599;S[38][4]=-3.853444;S[38][5]=24.264015;S[38][6]=9.866614;S[38][7]=21.726788;S[38][8]=-26.318005;S[38][9]=9.519783;S[38][10]=-53.654753;S[38][11]=0.974591;S[38][12]=-14.030530;S[38][13]=11.875467;S[38][14]=21.444079;S[38][15]=26.103953;S[38][16]=-16.138609;S[38][17]=26.368989;S[38][18]=-20.095648;S[38][19]=26.089916;S[38][20]=-14.575180;S[38][21]=26.682673;S[38][22]=-11.073563;S[38][23]=26.276776;S[38][24]=-9.723007;S[38][25]=25.906506;S[38][26]=-9.252097;S[38][27]=24.664757;S[38][28]=-9.087901;S[38][29]=24.231787;S[39][0]=-6.125795;S[39][1]=14.005396;S[39][2]=-6.848148;S[39][3]=19.720310;S[39][4]=13.015195;S[39][5]=18.843653;S[39][6]=-13.496770;S[39][7]=5.865882;S[39][8]=-50.069878;S[39][9]=10.507504;S[39][10]=-26.709995;S[39][11]=8.361919;S[39][12]=8.917553;S[39][13]=21.726277;S[39][14]=-20.556654;S[39][15]=29.058482;S[39][16]=-21.086892;S[39][17]=28.068871;S[39][18]=-14.847905;S[39][19]=27.372692;S[39][20]=-11.500360;S[39][21]=26.560417;S[39][22]=-9.871822;S[39][23]=26.195405;S[39][24]=-9.303985;S[39][25]=26.068134;S[39][26]=-9.105993;S[39][27]=26.023757;S[39][28]=-9.036958;S[39][29]=26.008283;
  #endif
}



/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
